 @KezarSoze @Mike4MN it was really random, linked me to Inver Grove RT about a Al Franken event. Should've taken screenshot RT @GENOlukolade: about doing stories that are easy to cover.~ Al Franken /2 RT @edunbarMPR: Ag Secretary Tom Vilsack with Rep Collin Peterson and Sen Al Franken at U's St. Paul campus. http://t.co/7orxhjkrc4 RT @edunbarMPR: Ag Secretary Tom Vilsack with Rep Collin Peterson and Sen Al Franken at U's St. Paul campus. http://t.co/7orxhjkrc4 REMINDER: Al Franken, Amy Klobuchar, &amp; 44 other Democrats Voted to Cede Your Gun Rights to the U.N. http://t.co/Hx1UMeXBns Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MnDOTResearch Al Franken: "Gridlock" http://t.co/uLaBwyra4C RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KQMorningShow #kqrs #kq How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @theuptake RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Hennepin #Hennepincounty RT @Lileensvf1: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
#PJNE How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @sacbee_news Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Enquirer How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @FOX47Roch @scaryinnovative Sen. Al Franken (D) info@franken.senate.gov (202) 224-5641 Owner: Time Warner = $65188 RT @ckazboehm: calmly eating my palak paneer and AL FRANKEN WALKS IN! HES MY POLITICIAN CRUSH!!!!!!!!! @alfranken How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @mowergop @TheCheckeredFlg And I actually like Al Franken. A reason I like MN. Mcfadden is a total moron. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @WashTimes Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @wccoradio RT @GENOlukolade: about doing stories that are easy to cover.~ Al Franken /2 RT @LifeNewsHQ: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @azcentral How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @mntoday RT @plgoldsmith: #Join me in supporting Help us make a firewall around Al Franken and the U.S. Senate. via @actblue http://t.co/AhCs089cqC Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @theobserver How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @stillwgazette How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @sherbdfl Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @RedwoodCtyFair How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @OtterTailCounty Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @baltimoresun Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @DLNewspapers Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ABC6NEWS Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/l7zC3tPFB0 Michele Bachmann Asks Al Franken to Help Defeat Al Franken http://t.co/vCXdtgHYDJ Oh Michele...are you still here? Retire already!! RT @mnpr: ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/5WMgVxS8GP RT @mngop: Al Franken was the decisive vote for #Obamacare, and is responsible for the mess we are in. #mngop #mnsure http://t.co/iZC9CXDn2c Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @FinancialTimes How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @TheGroveland How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn #tpt @tpt Al Franken is a good man! http://t.co/EAmYMkmOCO How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @BrownMNGOP RT @WebCaptioning: Net Neutrality-Sen. Al Franken 
Retweet! http://t.co/G1sRfK6yCP
http://t.co/7yHPPYLzox #NoSlowLane #Deaf Senator Al Franken draws map of USA: http://t.co/HeydXg3Qlb via @YouTube RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/ZqpH2ZizBb #PJNET RT please. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @NWHealthU RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @washingtonpost #washpost Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mySA Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CookCoVisitors Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @NWHealthU Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @fsnorth Such a cool experience watching Al Franken be interviewed http://t.co/qCjn7FJ0J7 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CrownCollege Sen. Al Franken addressing the MN AFL CIO convention about the importance of the middle class to the America economy.  Let's re-elect him. "How #ISIS Is Complicating Al Franken's Reelection Bid" 
http://t.co/VCMPeX3lsg @alfranken #tcot RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @mlacsmessenger Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @brd_dispatch ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/jht4VfivbH via @creepingsharia RT @JKelligesq: Join me in supporting AL FRANKEN IN US SENATE-SEND $3 OR $5  WHATEVER U CAN against Koch n Rove milions via @actblue http:/ How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @PlymouthMag How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @SWjournal Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @hopechurchmn RT @Lileensvf1: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
#PJNE  @YouTube : http://t.co/U4wdxq1azC Bill O'Reilly clashes with Al Franken "SHUT UP!" 1/2 Al Franken has been edited http://t.co/0GvZhUqz34 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @RiceCountyFair How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @LATimes #latimes How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @HibbDailyTrib RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn AL FRANKEN: Minnesota needs federal action on railroads http://t.co/XI6655Q6td RT @GENOlukolade: about doing stories that are easy to cover.~ Al Franken /2 RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @kare11 #kare11 RT @mngop: Al Franken promised Veterans would have access to quality healthcare for life, he broke his promise. http://t.co/jrGZPi366D #mng Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @NorthwesternMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CakeIn15 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC #teaparty #mn2014 RT @LloydMarcus: Liberals panic over defeat of Al Franken http://t.co/rKRgiiCUez @ConservativeCCC #tcot #teaparty How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @mySA RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @aitkinage Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @denverpost Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @NorthcentralU RT @RepubAbroadHK: More pro #FATCA Senate Dems:
5. Mary Landrieu (D-IL)
6. Al Franken (D-MN)
7. Kay Hagan (D-NC)
8. Jeanne Shaheen (D-NH)
@ Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KQMorningShow #kqrs #kq Real American extremism http://t.co/esuler4ZsF 48 Democrat senators attempt to amend our 1st Amendment. #merkley #warren #franken are worse Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @kool108radio #kool108 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ichsociety How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @HamlineOracle Al Franken has been edited http://t.co/QJ8Uexl49o RT @DclareDiane: REMINDER: Al Franken, Amy Klobuchar, &amp; 44 other Democrats Voted to Cede Your Gun Rights to the U.N. http://t.co/Hx1UMeXBns How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn  @courierjournal How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @tptAlmanac How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Crossroads_MN From @Newsbusters- Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/zYFC9oqk5p http://t.co/dfJOtheOWw RT @The__Chauvinist: ISIS Complicating Al Franken's Dem

http://t.co/y415xPd4hb
#MyJihad Muslims ISIS #MakeInIndia Happy Navratri BJP - Sh RT @Lileensvf1: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
#PJNE Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @sherburnecounty RT @nielslesniewski: Michele Bachmann wants Al Franken's help to defeat, um, Al Franken http://t.co/zyC3YxfTbZ RT @AoSHQDD: New #MNSEN Poll: Franken (D) 49%, McFadden (36%) http://t.co/Pjk3STgEIo RT @p_staatz: Rt"@bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R)Mike McFadden!Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @redwoodarea RT @AwfulGiraffes: Thanks @alfranken for the "caraffe." It's your turn, @MikeForMN! http://t.co/vYoiMrSwzw #MNPolitics #MNLeg #StribPol htt How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ichsociety Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MayoClinic #MayoClinic RT @RepubAbroadHK: More pro #FATCA Senate Dems:
5. Mary Landrieu (D-IL)
6. Al Franken (D-MN)
7. Kay Hagan (D-NC)
8. Jeanne Shaheen (D-NH)
@ RT @jnridlinghafer: Liberals panic over defeat of Al Franken http://t.co/lLqjTQzCdA Ox talks with Senate Candidate Running Against Al Franken Mike McFadden during his visit to St. Cloud Here:... http://t.co/b9QBtUQjox RT @W_Churchilll: There's plenty of room for humor in politics, God knows, but it's a serious business.
 -Al Franken
., Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @concordiastpaul How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @BethanyLutheran RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how http://t.co/PVUhwY3fnn @MyFOX9 #fox @FoxNews @FNS How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @twincitiespulse How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ApostolicBible RT @BigPimpin_Anish: @liamobde The sad thing is Norm Coleman sat on the Foreign relations committee and had some sway but got beat by Al Fr Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @dc4DFL Join me in supporting AL FRANKEN IN US SENATE-SEND $3 OR $5  WHATEVER U CAN against Koch n Rove milions via @actblue http://t.co/HPU06PLyVo RT @themillieneal: Al Franken's fatuous lies to support Obama and progressivism smell like #Taqiyya. Are U voting for ISIS in '14 #mnsen ht RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. RT @MNVAPERS: URGENT: Call To Action - Tell US Senators from MN what you think about the FDA regulations on #ecigs - http://t.co/gTbFJvzXIf "Passwords are secret and dynamic; fingerprints are public and permanent" - Al Franken How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MinnesotaCities RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @pipestonestar How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @NewsdayOpinion Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @orlandosentinel RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. I go, 'No, I'm really honest.' Al Franken How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/rG96uRACvF @ScottLib_MN RT @michaelemlong: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/f2NPdeHpdz #tcot #teaparty #obama #sgp #tgdn McFadden proposes to scrap Obamacare; Franken says that would hurt Minnesotans. http://t.co/ndPiYMOvEX RT @fabfunfam2: @GOP  Local Issues, Ground game, and trunks full of extra votes just in case. Just ask Al Franken. Join me in supporting We PROUDLY endorse Senator Al Franken for re-election! via @actblue http://t.co/ieJgkxHk19 @Mike4MN I am focusing on voting for Sen. Al Franken. RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @OlmstedGOP @mnpr: ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/35Slno7eJz Mohamoud Hussain interviewed Net Neutrality supporter Al Franken on Somali TV. Next week he will interview Mike... http://t.co/R6RhftLQAN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MyFOX9 #fox @FoxNews @FNS RT @creepingsharia: ISIS Complicating Al Frankens Dem. Reelection Bid inMinnesota http://t.co/ZpJYo3tIJx Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Newsday RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. Minneapolis Star Tribune Surprisingly Critical of Al Franken ~via NewsBusters #TCOT http://t.co/rqh3LuQEoi Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mntoday Senator Al Franken to AFLCIO delegates: "I'm here because of you. I fight for you." #mnaflcio14 #4allworkers @AFLCIO @MNAFLCIO PUNDIT: Al Franken arranged pedophile priest scandal to hide satanic love child unpleasantness #alwaysRemember RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @brd_dispatch Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/WYtuadVE7k Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @chaskaherald How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @baltimoresun RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @courierjournal Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MSPmagEats Franken hosts US ag secretary in Minnesota - News &amp; Observer http://t.co/B3NluPPqE0 #mn Michele Bachmann Asks Al Franken to Help Defeat Al Franken http://t.co/EfMp1J4JBu http://t.co/PXB9JzRQXA #capitolhill hey, whoever runs candidate .@SteveWCarlson's twitter, please stop spamming us with hack political attacks about Al Franken RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @OwatonnaNews @ConeyJoey @rushlimbaugh @alfranken Al Franken has never been right about anything. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @AugsburgCollege 
Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/E56Il6YstE #wiunion How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @StKate How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @dglobe RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @elyecho RT @Sarah__Reynolds: Al Franken won MN Senate race in 08 by 312votes of 2.4MILLION Mn votes cast. He was deciding O'care vote. http://t.co/ RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @LookTrueNorth RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn RT @eph4_15: Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @themacweekly How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @StOlaf #saintolaf Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @OlmstedDFL Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t.co/72Z2TzaZYU Minneapolis Star Tribune Surprisingly Critical of Al Franken: The Minneapolis Star Tribune is known for its li... http://t.co/gZxjkFAIDf RT @LifeNewsHQ: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @My29tv RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @StScholastica Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @lohud Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KAXE RT @Tbaglady: ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/DrwKmkPAyu via @creepingsharia RT @StarTribune: Latest in 2014 Senate race: Franken, McFadden tailor messages to college students at University of Minnesota http://t.co/R ISIS Complicating Al Frankens Dem. Reelection Bid in Minnesota | Creeping Sharia http://t.co/euH5P8IUkp Steal the 1st election &amp; 2nd one is much easier. RT@AoSHQDD: New #MNSEN Poll: Franken (D) 49%, McFadden (36%) http://t.co/yM3s8DRSIO ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/Rj7aolILCl via @creepingsharia Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @RenCoHRAEDA How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/rG96uRACvF @newcountry957 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @DandC Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t.co/CVEuFq2NpI RT @mattprivratsky: True for ag, energy, and the whole economy. "Sen. Franken: Minnesota needs federal action on railroads" http://t.co/WLq Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @AP #ap #upi @upi #bbc @bbc Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/kMjTKkmT69 @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/97MQ0jm0ua Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @river_valley_mn How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @StarTribune #strib How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MinnPost "Its been a rough day here at the Al Franken Center for Innovation in Fundraising Emails." RT @CREWcrew: Meanwhile, @MicheleBachmann's political machine remains a real crack operation. http://t.co/FtcHAMANNK via @nielslesniewski Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @OWHnews Just contributed to Al Franken and Kay Hagen. Have you donated to the Democratic Senate candidates yet? How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ClassicalMPR How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @statesman How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @goodhuehistory % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
#PJNET #Sinister6 RT @The__Chauvinist: ISIS Complicating Al Franken's Dem

http://t.co/y415xPd4hb
#MyJihad Muslims ISIS #MakeInIndia Happy Navratri BJP - Sh How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Mlive Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @journalsentinel How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @njdotcom RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. Interesting they don't seem to mind that Al Franken doesn't think they are worth his time... @JohnCroman @AnnCoulter I'm surprised you didn't include supporting McFadden (running against Al Franken) in your to do list. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @dailyherald sharing #suaju Sen. Al Franken: Comcast buying Time Warner Cable could... - The Verge #internet #web http://t.co/tk8nAvA2Ip How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MeekerGOP RT @LloydMarcus: DEFEAT MARK BEGICH: http://t.co/7BSbuMXy5D
DEFEAT DICK DURBIN: http://t.co/zFMmHLD9tD
DEFEAT AL FRANKEN:... http://t.co/JN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @dailyherald How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @readersdigest RT @tradethecycles: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
# Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @powerlineblog How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @cookcountymn RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @FinancialTimes Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @1013KDWB #KDWB RT @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/uBLnd2LcGD RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/rG96uRACvF @AccessPress Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @FresnoBee RT @Sarah__Reynolds: Al Franken won MN Senate race in 2008 by 312 votes of 2.4MILLION votes cast. He was deciding O'care vote. http://t.co/ RT @creepingsharia: ISIS Complicating Al Frankens #Dem Reelection Bid in Minnesota http://t.co/nVZ5OXB1n4  #tcot #a4a #lnyhbt Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/1M6NnlfvVq RT @eph4_15: Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. RT @MikeForMN: Sen Franken would rather focus on raising taxes than keep us safe from American ISIS fighters. He just doesnt get it http:/ AL FRANKEN: Minnesota needs federal action on railroads | Grand Forks Herald http://t.co/yT4BCD9JfR RT @creepingsharia: ISIS Complicating Al Frankens Dem. Reelection Bid inMinnesota http://t.co/ZpJYo3tIJx RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. Join me in supporting Al Franken!  Please Contribute Today via @actblue http://t.co/jGTX4PI4E2 Email sent and submitted electronically to Al Franken/Amy Klobuchar w/cc: Congressman Rick Nolan &amp; Others 08/22/14, http://t.co/oaMee16C9V Al Franken using Sandy Hook for re-election makes me sick and pisses me right the fuck off. @macsmarts I'm surprised Al Franken hasn't wasted their time already. RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Marshall_MN RT @UKProgressive: Today in dumb: Michele Bachmann Asks Al Franken to Help Defeat AlFranken http://t.co/fjjCL0MkOw How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @105theticket RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. @Mike4MN @marypatriott Every time I think of Al Franken, Jessie Ventura or Keith Ellison I am amazed Minnesota is still in business. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MetCouncilNews How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @CBS @nbc @abc @ap Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ladailynews Would anyone doubt that Al Franken would confirm an Obama appointment of Eric Holder to the U.S. Supreme Court??? RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. RT @Chris_1791: Minneapolis Star Tribune Surprisingly Critical of Al Franken   via @NewsBusters http://t.co/NPOPV32nQ2 How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @smumn How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @morrisongop Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @GustavianWeekly RT @cheshirecat0025: ISIS Complicating Al Frankens Dem. Reelection Bid in Minnesota http://t.co/ytRKfDfcmH RT @luchadora41: ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/Rj7aolILCl via @creepingsharia Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @tptAlmanac RT @mngop: Al Franken promised Veterans would have access to quality healthcare for life, he broke his promise. http://t.co/jrGZPi366D #mng Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PlymouthMag RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn #state @stcloudstate RT @creepingsharia: ISIS Complicating Al Frankens Dem. Reelection Bid inMinnesota http://t.co/ZpJYo3tIJx Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @heavytable RT @nielslesniewski: If you're just catching up on weird politics news, Michele Bachmann asked Al Franken for campaign cash: http://t.co/zy http://t.co/nJFWpk17rF How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @AM950Radio Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @stpeterherald ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/GwU01khUGy via @creepingsharia How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @TheBuffaloNews RT @Sarah__Reynolds: Al Franken won MN Senate race in 2008 by 312 votes of 2.4MILLION votes cast. He was deciding O'care vote. http://t.co/ RT @cheshirecat0025: ISIS Complicating Al Frankens Dem. Reelection Bid in Minnesota http://t.co/ytRKfDfcmH RT @LifeNewsHQ: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @1500ESPN #ESPN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @statesman How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @RiceCountyDFL RT @LifeNewsHQ: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen RT @SheilaKihne: So did Erik Paulsen &amp; John Kline @MrPaulotics: Al Franken voted to arm syrian rebels with your money!! #mnsen @alfranken  Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TPPatriots #TPPatriots #teaparty Liberals panic over defeat of Al Franken http://t.co/lLqjTQzCdA Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MiamiHerald How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @stltoday Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MplsTVNetwork How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @BMileskiKFAN RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. Al Franken on Buzzfeed: Minnesota Voting Made Easy - Democratic Underground http://t.co/MkgQTbEeSr How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ItascaHabitat RT @quiet888: Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/5oFT6QpcGR via @politicususa Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @FOX47Roch RT @UKProgressive: Today in dumb: Michele Bachmann Asks Al Franken to Help Defeat AlFranken http://t.co/fjjCL0MkOw RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn Al Franken voted to arm syrian rebels with your money!! #mnsen @alfranken @MikeForMN @Mike4MN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @BringMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @StKate Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @1013KDWB #KDWB Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Enquirer Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @theuptake ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/DELSaaF0Hv via @creepingsharia RT @edunbarMPR: Ag Secretary Tom Vilsack with Rep Collin Peterson and Sen Al Franken at U's St. Paul campus. http://t.co/7orxhjkrc4 You wont believe who Michele Bachmann sent a campaign fundraising mailer to http://t.co/k66LDfrDQv via @nielslesniewski RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. RT @FreebornGOP: Our Senate Race is getting NATIONAL attention!  Al Franken's seat isn't as safe as he'd like..Mike McFadden can... http:// How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @LutherSeminary #luther Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @NBCDFW @AnnCoulter come drown me! I'm voting for Heather Johnson (L) @AsurasStar for U.S. Senate - a vote 4 McFadden (R) or Franken (D) = more evil RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. RT @WintheSenate: Obama Yes-Man, Al Franken, too afraid to debate #GOP @MikeforMN, RT if you are tired of liberals running scared #TCOT htt RT @SpryGuy: If you haven't read the book "Rush Limbaugh Is a Big Fat Idiot" by Al Franken, you owe yourself: http://t.co/8BIGIplyCV #StopR RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. RT @mngop: Al Franken was the decisive vote for #Obamacare, and is responsible for the mess we are in. #mngop #mnsure http://t.co/iZC9CXDn2c Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @WillmarChamber RT @creepingsharia: ISIS Complicating Al Frankens #Dem Reelection Bid in Minnesota http://t.co/nVZ5OXB1n4  #tcot #a4a #lnyhbt RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @StarbucksUK Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mercnews RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn RT @nielslesniewski: Michele Bachmann wants Al Franken's help to defeat, um, Al Franken http://t.co/zyC3YxfTbZ RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/ZqpH2ZizBb #PJNET RT please. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @NorthcentralU ISIS Complicating Al Franken's Dem

http://t.co/y415xPd4hb
#MyJihad Muslims ISIS #MakeInIndia Happy Navratri BJP - Shiv Sena Join me in supporting Al Franken via @actblue http://t.co/ftswLECXHL / What can I say? I &lt;3 Al ! RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @daytondailynews RT @bradleyaz79: @alfranken Hey! Al Franken said something! It's about time he woke up. He's been taking a pretty sweet nap for last 5 year Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @unitedtheologic An invitation has also been extended to DFL Sen Al Franken to appear on the show. Franken's campaign has not committed to a date yet. RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD ISIS Complicating Al Frankens Dem. Reelection Bid in Minnesota #Ccot #tcot #pjnet https://t.co/yYqjS7EjlH RT @eph4_15: Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT Liberals panic over defeat of Al Franken http://t.co/rKRgiiCUez http://t.co/tSdlw1Phsv Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @detroitnews RT @NumbersMuncher: In Minnesota, the GOP leads generic ballot by 2 but Franken leads by 9. Difference? GOP leads Indys by 21 on generic, j Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/O7CsjL7NOW #wiunion #twisters #tcot #ccot #ctl RT @TNTweetersTX: Re-Elect SEN AL FRANKEN @alfranken #MN #StayBlue #TNTweeters #CIR #OFA Keep Democratic Senate Majority! #TNTweeters http How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @KMHL_AM Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @kare11 #kare11 RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn Al Franken won MN Senate race in 2008 by 312 votes of 2.4MILLION votes cast. He was deciding O'care vote. http://t.co/wGMLnHtyvm It matters! RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @AOL Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TB_Times Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KenyonLeader Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @EyeOnPolitics RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. @TommyLeeAllman @Mindspanker2002 @DaleF3 @SouthernLady328 @nhdogmom idiot did when Al Franken won! We just took it #Uniteblue #Libcrib Al Franken~ Its easier to put on slippers than to carpet the whole world. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MNMOmag RT @Brad_Carlson: 60% on #mnsure already hurt. RT @KSTP: McFadden proposes to scrap Obamacare; Franken says that would hurt Minnesotans htt @Mike4MN Sorry, Mike--Senator Al Franken has my vote! #UniteBlue #VoteBlue2014 RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/qT2zZh0dzf via @creepingsharia Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MyFOX9 #fox @FoxNews @FNS How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @fsnorth How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @sctimes #stcloudtimes Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @washingtonpost #washpost Al Franken=shoe-in RT @Phil_Mattingly: I'm just gonna say it: some of the names being tossed out as possibilities as the next AG are absurd. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PopeCountyFair Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @WCCO How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @elyecho RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT RT @eph4_15: Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t.co/NqKJ2lG8EW RT @WintheSenate: Obama Yes-Man, Al Franken, too afraid to debate #GOP @MikeforMN, RT if you are tired of liberals running scared #TCOT htt How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MattSwenson Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @EdenPrairieNews RT @tradethecycles: % Voted WITH BHO:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
# How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @SherburneArea True for ag, energy, and the whole economy. "Sen. Franken: Minnesota needs federal action on railroads" http://t.co/WLqCNOxLZX via @gfherald How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @indystar RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KandiWillmarEDC @Arianna8927 I told you about the most hilarious thing ever on Donahue when Al Franken almost had him in tears. Soooo funny. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @CrookstonTimes Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @swcbulletin RT @WintheSenate: Obama Yes-Man, Al Franken, too afraid to debate #GOP @MikeforMN, RT if you are tired of liberals running scared #TCOT htt How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @PioneerPublicTV How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @kvsc881fm Al Franken visited the Minneapolis Television Network today-here he is with a starstruck staff memb http://t.co/3GYjJm5NFD ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/6Gh6IVtAH2 via @creepingsharia Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @AM950Radio RT @themillieneal: Al Franken's fatuous lies to support Obama and progressivism smell like #Taqiyya. Are U voting for ISIS in '14 #mnsen ht How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @DandC RT @ericmferguson: @zschneiderNNC @alfranken Al Franken is right about #AdrianPeterson . #vikings should handle Peterson like they handled  Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @OlmstedGOP Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC #tpt @tpt #YesAllWomen remember False Accuser Jamie Leigh Jones and how Al Franken took her word simply because she's a woman. He has egg on his face RT @eph4_15: Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT RT @StevenErtelt: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PioneerPress #PioneerPress RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mySA RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @BringMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MinnLocal RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PB_News #postbulletin Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @twincitiespulse RT @JKelligesq: Join me in supporting AL FRANKEN IN US SENATE-SEND $3 OR $5  WHATEVER U CAN against Koch n Rove milions via @actblue http:/ How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @canishoopus RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MSUReporter @liamobde  I guess it was Al Franken eh I will forever praise Al Franken with his Mental Health actions in schools. It is definitely a necessary thing. For everyone. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @orlandosentinel sharing #suaju Sen. Al Franken: Comcast buying Time Warner Cable could... - The Verge #internet #web http://t.co/5zstDkTlON RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. Is there any tactic too "low" for liberal Al Franken &amp; his #biggovernment pals? Don't let them win: http://t.co/MNqIZta1L9  Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CCTimes RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mnstateparks #mnstateparks @Steverocks35 Al Franken has been very quiet as a Senator except for Internet issues. ISIS Complicating Al Franken Dem Reelection Bid n Minnesota http://t.co/nb7bLJUv2F via @creepingsharia #tcot #ccot #military #teaparty #WAAR RT @InverHillsCC: Sen. Amy Klobuchar and Sen. Al Franken with AVHS students at Uponor for DOL E3 STEM grant tour. http://t.co/nD0uWH1BAI How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ClayCoPHMN How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @FboNews RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/ZqpH2ZizBb #PJNET RT please. RT @edunbarMPR: Ag Secretary Tom Vilsack with Rep Collin Peterson and Sen Al Franken at U's St. Paul campus. http://t.co/7orxhjkrc4 @cheshirecat0025: ISIS Complicating Al Frankens Dem. Reelection Bid in Minnesota http://t.co/0KILxNj332 Stuart Smalley sucks How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @49ers How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MapleGroveMag RT @creepingsharia: ISIS Complicating Al Frankens Dem. Reelection Bid inMinnesota http://t.co/ZpJYo3tIJx Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @the_wake Al Franken~ Im good enough Im smart enough and dog-gone it people like me. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @StarAdvertiser RT @Sarah__Reynolds: Al Franken won MN Senate race in 2008 by 312 votes of 2.4MILLION votes cast. He was deciding O'care vote. http://t.co/ Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @keyc Bachelor parties, bird deposits, Al Franken... another Cashing In with T.J. Miller here! http://t.co/pJjxNsZ2pU @cashlevy @nottjmiller How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @KSTP #KSTP RT @yoshpoint0: "Net neutrality is no laughing matter" -me to al franken http://t.co/6lvQmlCqyJ @JackTomczak 
... The reason gas was $1.86 in Dec. '08 is basically the same reason Al Franken is currently our senator ... (2/3) RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @TheJournalMN How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT #nytimes #washpost #ap Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CarletonCollege #CarletonCollege Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @SWjournal RT @SusanDanzig219: @DocTexian @UniteBlueTX I'm w/Al Franken on this one: RUSH LIMBAUGH IS A BIG FAT IDIOT. ;-)  #StopRush Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MiamiHerald ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/jxHU0pWjRa via @creepingsharia "And, worse still, the middle-class isnt just being flooded; its being blindfolded, too  because these wealthy... http://t.co/XPoBsrJRd0 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @cspan ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/59rCEJ5HTP via @creepingsharia How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @houstonctygop I'm baffled. This Al Franken fundraising email subject lined w "The machine exploded" is the strangest FR'ing email, ever. #MNsen #gop #tcot @ChristineOD what "HARSH?!" and your comment's weren't.. only reason Al Franken n Hillary got elected was their star-power ..that only RT @JohnCroman: Sen Al Franken chats with students at U of M VoterPalooza event. Mike McFadden will be here later for a town hall http://t. RT @eph4_15: Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ladailynews How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MyFoxTampaBay RT @LloydMarcus: Liberals panic over defeat of Al Franken http://t.co/rKRgiiCUez @ConservativeCCC #tcot #teaparty Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @journalsentinel Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CrookstonTimes Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Crossroads_MN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PEcom_news How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MPR Al Franken~ Its easier to put on slippers than to carpet the whole world. RT @LloydMarcus: DEFEAT MARK BEGICH: http://t.co/7BSbuMXy5D
DEFEAT DICK DURBIN: http://t.co/zFMmHLD9tD
DEFEAT AL FRANKEN:... http://t.co/JN Urge Al Franken to stand with miners, not with environmental elitists: http://t.co/a3E4viRmli via @YouTube RT @themillieneal: Al Franken's fatuous lies to support Obama and progressivism smell like #Taqiyya. Are U voting for ISIS in '14 #mnsen ht Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MNEpiscopal How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MilleLacTourism Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @UMDBulldogs #umd RT @StevenErtelt: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @kumm_radio RT @NASCARNAC: NewsBusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/wUwbu2ZFxB #tcot #ocra #ampat Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @StCloudMinn RT @RepubAbroadHK: More pro #FATCA Senate Dems:
5. Mary Landrieu (D-IL)
6. Al Franken (D-MN)
7. Kay Hagan (D-NC)
8. Jeanne Shaheen (D-NH)
@ Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MinnEcon How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @NewsOK Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @SaintPaul Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ChanhassenNews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mlacsmessenger How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @1013KDWB #KDWB Democrats use voter fraud to win every election. That's a fact. Al Franken in Minn won by voter fraud. That's also a fact. Got it. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @StCloudMinn @USChamberAction @JLenardDetroit @MikeForMN  YES!!!!! MINNESOTA!!! PLEASE VOTE OUT al franken!!!!! RT @edunbarMPR: Ag Secretary Tom Vilsack with Rep Collin Peterson and Sen Al Franken at U's St. Paul campus. http://t.co/7orxhjkrc4 @pcdmint @MattyIceAZ Says a #LWNJ from Minnesota, Home Of Asshole AL Franken, #Dem #Voter Fraud , And HomeGrown #ISIS Terrorists LMBO! Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TheBasementKUMD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC #CBS @CBS #abc @abc @nbc #nbc Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @StKate RT @HouseCracka: Orman gives money to Obama, Hillary, Reid, Franken. He is a Democrat in a costume. @mdcolli @Burdog7 @patRoberts2014 @Orma Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @seattlepi Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/2ssvlMUA5H  @AP @CNN @CBS @PBS @NPR @wsj How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MSPmagEats How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @concordiastpaul How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MowerCoHistory RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/rG96uRACvF @wccoradio Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MinnesotaCities RT @townhallcom: Could ISIS Hurt Franken's Chance for Reelection? - While incumbent Minnesota Sen. Al Franken (D) has a comfortable... http ISIS Complicating Al Frankens Dem. Reelection Bid in Minnesota http://t.co/ytRKfDfcmH Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/2ssvlMUA5H @journalsentinel U.S. Senator Al Franken, Minnesota http://t.co/WRwEF9j2fe #VOTE2014 @UniteBlue @alfranken vs. Conservative https://t.co/arJlfcNzjd How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @AsburyParkPress Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MyFoxTampaBay RT @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/uBLnd2LcGD RT @TIB2016: @alfranken  a SNL clown and now a obama clown . Send Al Franken back to the comedy club! http://t.co/te81lPGHVM RT @SusanDanzig219: @DocTexian @UniteBlueTX I'm w/Al Franken on this one: RUSH LIMBAUGH IS A BIG FAT IDIOT. ;-)  #StopRush Al Franken's 70's fro is a sight to behold. RT @WintheSenate: Obama Yes-Man, Al Franken, too afraid to debate #GOP @MikeforMN, RT if you are tired of liberals running scared #TCOT htt How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @detroitnews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Newsweek Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MnBizMag RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr @lindsaylohan oh god al Franken Saturday night live ebloa vaccine great thx spreading it RT @GENOlukolade: about doing stories that are easy to cover.~ Al Franken /2 How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @KandiHistory Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @grheraldreview Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @McLeodGOP % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
#PJNET #Sinister6 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @UMMorris #morris RT @modujo: #stoprush   prime example of their fake anti rush software posts. 3 guys in a row all posted the exact same thing referencing a RT @The__Chauvinist: ISIS Complicating Al Franken's Dem

http://t.co/y415xPd4hb
#MyJihad Muslims ISIS #MakeInIndia Happy Navratri BJP - Sh Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mndailynews #mndaily How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @unfoundation Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MNSUMankato #mankatostate RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD #StopRush #UniteBlue Check out this Amazon deal: Rush Limbaugh Is a Big Fat Idiot by Al Franken http://t.co/rCgK5LgSVV via @amazon RT @MediaCircusCom: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/cl62UA1rUy #tcot #msm #libtards Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @BethanyLutheran Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @963KTWIN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mlcknights RT @CloudWiser: Liberals panic over defeat of Al Franken http://t.co/InCtqJMxPx RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/ZqpH2ZizBb #PJNET RT please. RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. RT @C_C_Mitchell: The NRA has endorsed Republican Mike McFaddens campaign for U.S. Senate. He's challenging incumbent Al Franken (D-MN) #m RT @chivaneze: So you know? Then still granted that interview? @GENOlukolade: about doing stories that are easy to cover.~ Al Franken /2" Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CityofPequotLak How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @1500ESPN #ESPN RT @SusanMaylone: Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/QJSl8CfWsY via @politicususa RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @UniversityChron RT @edunbarMPR: Ag Secretary Tom Vilsack with Rep Collin Peterson and Sen Al Franken at U's St. Paul campus. http://t.co/7orxhjkrc4 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @NYDailyNews Does a single undecided voter in MN care that Sen. Franken "only" agreed to 3 debates? Asking for a GOP Senate candidate. #mnsen RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @tcdailyplanet Sen. Al Franken managed to turn a canned pre - recorded video into a true moment of mirth. Only in MN. #RailVolution How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how http://t.co/PVUhwY3fnn @AP #ap #upi @upi @BBCNews RT @AlexisinJax: Did I wake up in the middle of Idiocracy or is Al Franken actually a Senator? #tcot How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ScottCountyMN sharing #suaju Sen. Al Franken: Comcast buying Time Warner Cable could... - The Verge #internet #web http://t.co/7xVzj0g2q0 The 1st time I heard Repub. Mike McFadden rip on Al Franken regarding minority education outcomes, I shot water through my nose. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @caledoniaargus Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MinnesotaCities RT @SusanDanzig219: @DocTexian @UniteBlueTX I'm w/Al Franken on this one: RUSH LIMBAUGH IS A BIG FAT IDIOT. ;-)  #StopRush Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @HeraldTribune RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn This reminds me of the skill of Al Franken in drawing the U.S. from scratch (you did know he can do that right?) http://t.co/uskxcx7aH0 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @canishoopus Michele Bachmann wants Al Franken's help to defeat, um, Al Franken http://t.co/zyC3YxfTbZ RT @Progress2day: Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/O7CsjL7NOW #wiunion #twister RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @NicolletCty_GOP Al Franken - U.S. Senator, Minnesota

Dear Randall,

As Im sure youve heard from Al, were starting the final... http://t.co/Lr8vVGMUbz Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @sltrib Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @UniversityChron RT @SpryGuy: If you haven't read the book "Rush Limbaugh Is a Big Fat Idiot" by Al Franken, you owe yourself: http://t.co/8BIGIplyCV #StopR A young Al Franken. http://t.co/mXWzhtYnJp RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CityHallScoop Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Starbucks Al Franken has really good PR. Just sayin. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ScottLib_MN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @LeftMN RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Mankatonews How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @PLChamberMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MPR RT @tradethecycles: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
# RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. RT @eph4_15: Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @LutherSeminary #luther RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Macalester #college RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @APkrawczynski RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @projo RT @MnFarmersUnion: AL FRANKEN: Minnesota needs federal action on railroads | Grand Forks Herald http://t.co/yT4BCD9JfR RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Hennepin #Hennepincounty Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TheJournalMPLS Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @seattletimes Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/2ssvlMUA5H @VisitFaribault KEEP SAFE. MAINTAIN PRIVACY.  #Al Franken Privacy  http://t.co/AghKpUFcs6 RT @StarTribune: Latest in 2014 Senate race: Franken, McFadden tailor messages to college students at University of Minnesota http://t.co/R AL FRANKEN: Minnesota needs federal action on railroads http://t.co/opEO17c3t2 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MNMOmag Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @OakHillsCollege How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ArtsOrbit RT @ConservativeCCC: Al Franken and his supporters are sinking to new lows: http://t.co/Bw3bnSxlOJ http://t.co/6SYzUcePYU How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @wctrib Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KSTP #KSTP "Net neutrality is no laughing matter" -me to al franken http://t.co/6lvQmlCqyJ RT @krj1911: @USChamberAction @JLenardDetroit @MikeForMN  YES!!!!! MINNESOTA!!! PLEASE VOTE OUT al franken!!!!! RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MarshallCntyGOP How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @KTTCTV #kttctv How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @IndependentMN This is my favorite. RT @nielslesniewski: Michele Bachmann wants Al Franken's help to defeat, um, Al Franken http://t.co/THX2LUHXYq Al Franken talking about being accessible. So he has ducked @MikeforMN debates and that's being accessible?? #stoprush   prime example of their fake anti rush software posts. 3 guys in a row all posted the exact same thing referencing al franken.LOL RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. RT @bradleyaz79: @alfranken Hey! Al Franken said something! It's about time he woke up. He's been taking a pretty sweet nap for last 5 year @TaggertGirl: Democrat Group Think
% of Votes w/ #Obama:
Begich - 97%
Franken - 98%
Hagan - 96%
Landrieu - 97%
Pryor - 90% 

#tcot #tlot Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KDAL610 How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @tcimc Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @BeltramiHistory Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @duluthnews #duluthnews Amy Klobuchar, Al Franken, US Rep Rick Nolan! http://t.co/GyqgOmkg15 RT @creepingsharia: ISIS Complicating Al Frankens #Dem Reelection Bid in Minnesota http://t.co/nVZ5OXB1n4  #tcot #a4a #lnyhbt How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @StarbucksUK RT @tradethecycles: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
# Carlson confronts Franken/Dayton over hypocrisy in harsh actions against Peterson and Vikings http://t.co/HR0uYxlTAL @vita_mn Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @vita_mn RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @SherburneArea RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @reviewjournal How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @PoliticsMN How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @insightnews RT @jjliberty: ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/cE4E3Tzt14 Al Franken soundtrack. Ahs and ums Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MNProgressive The early ballots will be found in Al Franken's trunk--&gt;Minnesotans Are Casting Ballots Already. Really. http://t.co/EGwAKwIjOU via @NRO How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @dchsmn Senator Al Franken addressing the MN AFL-CIO Convention delegates. http://t.co/XzER39cFvH RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ks95 #ks95 RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ThiefRiverFallz @graceishuman Plus, Al Franken is there. So you know, liberal terrorist-hugger. @AddamUp Sen. Al Franken D info@franken.senate.gov (202) 224-5641 Funded By: Time Warner = $65188 @Candace07 @VeronicaLewis @ASourAppleTree Al Franken. RT @LloydMarcus: DEFEAT MARK BEGICH: http://t.co/7BSbuMXy5D
DEFEAT DICK DURBIN: http://t.co/zFMmHLD9tD
DEFEAT AL FRANKEN:... http://t.co/JN RT @Sarah__Reynolds: Al Franken won MN Senate race in 2008 by 312 votes of 2.4MILLION votes cast. He was deciding O'care vote. http://t.co/ @sens_adnan @numerartovertag @TalkingRed that state has elected her, Ventura for gov and Franken for Senate. You can have them Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TheBasementKUMD How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @macbreakweekly Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ajc How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @KSTPbrk RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @OWHnews @ChuckNellis @DMashak @PatVPeters @ZookZangsten @JohnFromCranber  Barry's next choice for AG ~input from Al Franken &amp;.Al Sharpton~ Muslim??? How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @PB_News #postbulletin Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @963KTWIN RT @tradethecycles: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
# Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TCBmag RT @InverHillsCC: Sen. Amy Klobuchar and Sen. Al Franken with AVHS students at Uponor for DOL E3 STEM grant tour. http://t.co/nD0uWH1BAI How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @SMSUToday Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @RTDNEWS How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ALcomBirmingham Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ALcomBirmingham Al Franken Drops a Truth Bomb On The Senate: #CitizensUnited Is Money Laundering http://t.co/yVrfXynojX via @politicususa Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/QJSl8CfWsY via @politicususa Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @cityofduluth How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @newsnorthfield @GOP Not MN. @MikeForMN running against Franken's support of Obama record. Obama caried MN. Twice. Handily. #badstrategy Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TPPatriots #TPPatriots #teaparty RT @Lileensvf1: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
#PJNE Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @theobserver How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @unitedtheologic RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @NBCDFW RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/ZqpH2ZizBb #PJNET RT please. "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PoliticsMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @usatoday #usatoday How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @UofStThomasMN #stthomas How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @K102 #k102 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @RiceCountyDFL RT @rollcall: You wont believe who Michele Bachmann sent a campaign fundraising mailer to http://t.co/UU3c58WZY3 via @nielslesniewski Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @dallasnews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @chicagotribune Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @freep RT @JudiU883: Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering -  http://t.co/0zdsYYvXEU RT @EqualityRising_: .  #CitizensUnited Is Money Laundering http://t.co/U7HKBroVSv #GOPKochAddicts http://t.co/FUecZnQp56 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @perfectduluth Al Franken on campus. http://t.co/4lxAbpjRQU @MickiNickHarp When I hear the words Bill O'Reilly.....I try to imagine Al Franken. Al Franken~ Im good enough Im smart enough and dog-gone it people like me. RT @eph4_15: Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering -  http://t.co/RiDsHSBSX3 RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. @LookTrueNorth 
Today's ALG Toon targets Al Franken:
EPA Scales of Injustice
http://t.co/3iq496IbF0 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @EyeOnPolitics RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KTTCTV #kttctv @cynthiapirl Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/YfhlxuM5MP via @donaldpirl RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. sharing #suaju Sen. Al Franken: Comcast buying Time Warner Cable could... - The Verge #internet #web http://t.co/UQg4SvEUie How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @KFAN1003 #KFAN1003 RT @LifeNewsHQ: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen RT @creepingsharia: ISIS Complicating Al Frankens #Dem Reelection Bid in Minnesota http://t.co/nVZ5OXB1n4  #tcot #a4a #lnyhbt @Mediaite @KatMcKinley @rushlimbaugh Al Franken sold a lot of books putting down Limbagh. I'm sure this is her marketing plan too! Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CakeIn15 How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @cityofalbertlea RT @creepingsharia: ISIS Complicating Al Frankens Dem. Reelection Bid inMinnesota http://t.co/ZpJYo3tIJx ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/rwpHyMOcKL via @creepingsharia Dems support Islam everywhere RT @lord_dottie: @ChuckNellis @DMashak @PatVPeters @ZookZangsten @JohnFromCranber  Barry's next choice for AG ~input from Al Franken &amp;.Al S Opening session at #railvolution.  Great speeches by local leaders. And a message from Sen. Al Franken ending with a song. Yes, a song. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @cities97radio How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @dailyherald RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/ZqpH2ZizBb #PJNET RT please. If you haven't read the book "Rush Limbaugh Is a Big Fat Idiot" by Al Franken, you owe yourself: http://t.co/8BIGIplyCV #StopRush #tlot #p2 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KMHL_AM How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @wsj Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @SunSentinel RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Thanks @alfranken for the "caraffe." It's your turn, @MikeForMN! http://t.co/vYoiMrSwzw #MNPolitics #MNLeg #StribPol http://t.co/1fe2wbJKw1 RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn You just can't make this up: Michele Bachmann Asks Al Franken to Help Defeat Al Franken http://t.co/6XlW8gMh65 via @rollcall Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @daytondailynews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ClassicalMPR Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CatholicSpirit @retiredfirecapt There is probably no worse shame for MN than Al Franken stein. Even being the North American recruiting HQ for ISIS. #tcot Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @StribBiz RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. RT @nielslesniewski: Michele Bachmann wants Al Franken's help to defeat, um, Al Franken http://t.co/zyC3YxfTbZ RT @JohnCroman: Sen Al Franken chats with students at U of M VoterPalooza event. Mike McFadden will be here later for a town hall http://t. RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @HamlineOracle Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @crowwingmn Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @insightnews Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t.co/6ukVj3uYpT RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @seattletimes RT @Chris_1791: Minneapolis Star Tribune Surprisingly Critical of Al Franken   via @NewsBusters http://t.co/NPOPV32nQ2 How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @proctorjournal Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @WasecaNews RT @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/uBLnd2LcGD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CarltonCountyMN @MNSunSailor RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @NewsOK How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @SPNN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KSMQ #ksmq RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. RT @Lileensvf1: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
#PJNE Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Bemidji How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @grheraldreview Al Franken's fatuous lies to support Obama and progressivism smell like #Taqiyya. Are U voting for ISIS in '14 #mnsen http://t.co/RsJEc3UNJa RT @StarTribune: Latest in 2014 Senate race: Franken, McFadden tailor messages to college students at University of Minnesota http://t.co/R How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ThePlainDealer RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @UofStThomasMN #stthomas Someone said the secret to success in life is in showing up. I went to a mtg this am &amp; met Mark Dayton &amp; Al Franken. http://t.co/VFj2DBGN3W RT @GOP

Early voting has started in #MN. It's easy: http://t.co/qoaU09XdiX Retweet &amp; Kick out Al Franken! #MNSen http://t.co/7ZN0ENvymj How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @sltrib How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/rG96uRACvF @WDSE_WRPT How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @AnokaCounty Al Franken, Mike McFadden agree to three debates http://t.co/G9mhTjNJ77 #StarTribune RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. RT @creepingsharia: ISIS Complicating Al Frankens #Dem Reelection Bid in Minnesota http://t.co/nVZ5OXB1n4  #tcot #a4a #lnyhbt How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Newsday Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @GustavianWeekly How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @cityofduluth Donate now to Al Franken. The Senate definitely needs a sense of humor. Join me, contribute today via @actblue http://t.co/AWVzXpFgSB McFadden Proposes to Scrap Affordable Care Act; Franken Says that Would Hurt Minnesotans: Republican Senate ca... http://t.co/AloY3X75hF Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/ftbVjyvVJD Al Franken Wikipedia article edited by Designate http://t.co/7VznBNj4hS @emmaroller I have a soft spot for Luntz bc of his fictional depiction in "Why Not Me: The story of the Al Franken Presidency" also his name How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @BUZN1029 #buzn1029 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MN_Newspapers MT @GamingTrent Supply side Jesus by Al Franken (Video) - http://t.co/wWDXnuvpA8   @NYPost_Mets Are you sure you not Senator Al Franken? If so, you need to be in MN for your reelection campaign. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC  @AP @CNN @CBS @PBS @NPR @wsj Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @StarAdvertiser @alfranken  a SNL clown and now a obama clown . Send Al Franken back to the comedy club! http://t.co/te81lPGHVM How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @denverpost RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @fcdfl Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @sacbee_news Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PioneerPublicTV Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @unfoundation Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @105theticket @WAGNERGIRLE @tedcruz What we need (an honest AG) &amp; what we get are two different things. Al Franken will probably get it. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @hutchleader Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @105theticket Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @SWMetroMag RT @xertx3: ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/rwpHyMOcKL via @creepingsharia Dems support Islam e RT @mngop: Al Franken broke his promise to Veterans. WATCH: https://t.co/s52RWAWLxv #mngop #stribpol #VAScandal 20 minutes well spent, I wouldn't have my senator Al Franken in office were it not for overseas votes!  #ProudOverseasVoter RT @LifeNewsHQ: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KTTCTV #kttctv How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MN_Newspapers Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @keyc Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Suntimes RT @Sarah__Reynolds: Al Franken won MN Senate race in 2008 by 312 votes of 2.4MILLION votes cast. He was deciding O'care vote. http://t.co/ RT @NotFunnyFranken: Over 110,000 views already! Don't miss our new ad exposing Al Franken's Obamacare lie. #MNSen WATCH:
https://t.co/FHrL Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/pIQ26PTAvH via @politicususa RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @CakeIn15 RT @Dgould45: @ksorbs @RealJamesWoods @REALStaceyDash @fredthompson @TherealJoepesci Need your help!  Al Franken has his h'wood libs. Suppo Michele Bachman Asks Al Franken to Help Defeat ... Al Franken http://t.co/NfLnjhNkEL via @nielslesniewski Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @cookcountymn Your monthly reminder that this guy is the most powerful democrat in congress and Al Franken supports him. #McFadden http://t.co/RixaWVysJn Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @macbreakweekly RT @KStreetHipster: The Senate matters: RT @Sarah__Reynolds: Franken won MN Sen in 2008 by 312 votes of 2.4MILLION votes cast. He was decid RT @Progress2day: Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/O7CsjL7NOW #wiunion #twister RT @nielslesniewski: Michele Bachmann wants Al Franken's help to defeat, um, Al Franken http://t.co/zyC3YxfTbZ RT @tradethecycles: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
# Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MinnPost RT @MichaelBenghazi: Hmmm...a 53' Massengill truck is being unloaded at Al Franken's Campaign HQ. RT @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/uBLnd2LcGD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @concordiastpaul How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ABC6NEWS Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @schoolchoicewk Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Newsweek Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CityofPequotLak Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @BemidjiState Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Utsandiego RT @Lileensvf1: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
#PJNE ISIS Complicating Al Franken's Re-Election Bid  http://t.co/yOymdAvWFP How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @FillCoJournal Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Suntimes #Join me in supporting Sen. Al Franken Contribute Today via @actblue http://t.co/8PnvFIHQnG RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @csbsjurecord Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KCStar Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @dglobe Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @unfoundation ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/DrwKmkPAyu via @creepingsharia RT @rollcall: Michele Bachman Asks Al Franken to Help Defeat ... Al Franken http://t.co/YanjWXCR50 via @nielslesniewski RT @townhallcom: Could ISIS Hurt Franken's Chance for Reelection? - While incumbent Minnesota Sen. Al Franken (D) has a comfortable... http RT @InverHillsCC: Sen. Amy Klobuchar and Sen. Al Franken with AVHS students at Uponor for DOL E3 STEM grant tour. http://t.co/nD0uWH1BAI RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PequotLakes @KSTP Franken is an embarrassment to MN. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @WinonaStateNews RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. @Chuckhalt @ChuckNellis How about Al Franken and Alan Grayson.......and the Congressman who thought Guam would flip over. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @newcountry957 How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Concordia_MN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @StScholastica Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Franken 
Impostor. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @AccessPress Fundraising mailer to "Alan Franken" from Bachmann seen here http://t.co/zyC3YxfTbZ #mnsen http://t.co/eOHSIihHK9 RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. Senator Franken is right! SCOTUS made a crime for the rest of us legal in politics. #ows #voteblue2014 #uniteblue... http://t.co/LBw5XAvdnM Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @AOL RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. RT @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/uBLnd2LcGD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @WasecaChamber NO! He voted for #Obamcare &amp; $17+ trillion #debt RT @jjbenz19: RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT... How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @cdcmorrisonmn #TCOTBreakingNews Minneapolis Star Tribune Surprisingly Critical of Al Franken: The Minneapol... http://t.co/gpGiTPm4P8 Via @Newsbusters Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MayoClinic #MayoClinic How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @chaskaherald How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MSUReporter How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @963KTWIN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @NYDailyNews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CrossrdsCollege RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @VikingsNow Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @UofStThomasMN #stthomas RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mndnr How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @CarletonCollege #College Al Franken: Voting To Cut Our Military Budget, Putting Americans At Risk. http://t.co/dcXoymo2rJ #mngop #stribpol RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. @BossyAmerican2 @LyndaG1963 @bristola48 @Wolfiemann @lgib15 @Bizness4America @jerrilyn71 @ornerynana @Alecsky_1 @renomarky Al Franken Duluth U.S. Sen. debate organizers favor Franken, McFadden, exclude IP Nom. violating fed law http://t.co/qp66LnThSq @vita_mn RT @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/uBLnd2LcGD RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/mK1FhRvawS via @creepingsharia Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ALcomBirmingham RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @JournalNewsroom RT @LloydMarcus: DEFEAT MARK BEGICH: http://t.co/7BSbuMXy5D
DEFEAT DICK DURBIN: http://t.co/zFMmHLD9tD
DEFEAT AL FRANKEN:... http://t.co/JN Can WE UNIFY against the BIGOTED 1% 

What does AL FRANKEN mean here?

Was he right?

@alfranken http://t.co/wjf3HOheBW RT @washdcnews: Michele Bachmann Asks Al Franken to Help Defeat Al Franken http://t.co/B6ka6UY0Gw Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ClayCoPHMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @newsobserver Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC  @courierjournal How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @AaronGleeman RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. RT @TaggertGirl: Democrat Group Think
Votes with #Obama:
Begich - 97%
Franken - 98%
Hagan - 96%
Landrieu - 97%
Pryor - 90% Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @memphisnews How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ks95 #ks95 RT @PJKirk9: BREAKING - Suddenly Democrat Senator Al Franken in Minnesota Becomes Very Vulnerable as Obama Shoots Him in the Foot  http://t "Al Franken: God Spoke" (2005) is a shallow movie (C) #DallasCritic &lt;ncf3hq&gt; How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @93XRadio #93xradio How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MinnesotaUMC RT @rollcall: You wont believe who Michele Bachmann sent a campaign fundraising mailer to http://t.co/YanjWXCR50 via @nielslesniewski RT @Lileensvf1: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
#PJNE Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CBS @nbc @abc @ap RT @MdlMurray: ISIS Complicating Al Frankens Dem. Reelection Bid in Minnesota | Creeping Sharia http://t.co/euH5P8IUkp Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @njdotcom @librab103 @alexmazzaraa @dierdrelewis oh?  show me where al franken, elizabeth warren, president obama, joe biden, etc - are owned. Did enjoy that stuffed pizza tonight @GreenMillUptown. Al Franken was also enjoying some pizza there tonight too! #happyhour #bestwings Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ks95 #ks95 @PhxKen forgot Al Franken! Stole election! RT @mngop: Al Franken was the decisive vote for #Obamacare, and is responsible for the mess we are in. #mngop #mnsure http://t.co/iZC9CXDn2c RT @RepubAbroadHK: More pro #FATCA Senate Dems:
5. Mary Landrieu (D-IL)
6. Al Franken (D-MN)
7. Kay Hagan (D-NC)
8. Jeanne Shaheen (D-NH)
@ MN has Ventura, Franken, ISIS Syrian home grown fighters, OK has black masses, 1st beheading. Two states to cross off to retire. RT @SpryGuy: If you haven't read the book "Rush Limbaugh Is a Big Fat Idiot" by Al Franken, you owe yourself: http://t.co/8BIGIplyCV #StopR Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @memphisnews "Its been a rough day here at the Al Franken Center for Innovation in Fundraising Emails." even so, @alfranken's AFCIFE keeps on crankin' RT @WintheSenate: Obama Yes-Man, Al Franken, too afraid to debate #GOP @MikeforMN, RT if you are tired of liberals running scared #TCOT htt Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @millelacs RT @mattprivratsky: True for ag, energy, and the whole economy. "Sen. Franken: Minnesota needs federal action on railroads" http://t.co/WLq RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @LATimes #latimes Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @RAMyersLibrary Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @RTDNEWS Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/f2NPdeHpdz #tcot #teaparty #obama #sgp #tgdn RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MNSUMankato #mankatostat RT @Chris_1791: Minneapolis Star Tribune Surprisingly Critical of Al Franken   via @NewsBusters http://t.co/NPOPV32nQ2 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @fergusfjournal RT @themillieneal: Al Franken's fatuous lies to support Obama and progressivism smell like #Taqiyya. Are U voting for ISIS in '14 #mnsen ht How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @uwolmsted Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mytalk1071 #mytalk RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mndotnews How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @KDAL610 How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @cities97radio Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CityMinneapolis How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @isanticonews RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @hopechurchmn AIDE: Al Franken orchestrated Rhea Perlman/Danny DeVito divorce to whitewash lustful black UN helicopter affair #benghazi @SoylentGamer nah, i get the al franken etc ads RT @BDayspring: Is raising political $$$ off Sandy Hook murders/tragedy ok? Al Franken thinks it is. http://t.co/lhf5LMcnSm   #MNsen How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @stribmoney Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @WildRiceCouncil Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MinneapolisMN Franken: Under the right circumstances, genocide is acceptable! http://t.co/RfZ5NYRuMJ #FreePalestine #Gaza #Israel http://t.co/JAc7whA9u9 RT @JohnCroman: Senator Al Franken says Senate members want a briefing on Syria air strikes. He wants assurances about scale and scope of o How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @walleyecapital RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. RT @mngop: Al Franken: Voting To Cut Our Military Budget, Putting Americans At Risk. http://t.co/dcXoymo2rJ #mngop #stribpol RT @Faith4Mishel: ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/jht4VfivbH via @creepingsharia RT @WintheSenate: Obama Yes-Man, Al Franken, too afraid to debate #GOP @MikeforMN, RT if you are tired of liberals running scared #TCOT htt Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @DispatchAlerts "Today I will masterbate! Okay, that was a mistake. I should have written "Today I will masterbate--if I want to!" -Al Franken RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/llLkXmNU8O via @creepingsharia RT @Progress2day: Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/O7CsjL7NOW #wiunion #twister sharing #suaju Sen. Al Franken: Comcast buying Time Warner Cable could... - The Verge #internet #web http://t.co/9BHznE90za RT @PJKirk7: 5 Democrat Senators in IRS Scandal in 2014 ReElection: DURBIN-IL, Franken-MN, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL  http://t How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT #teaparty #tpt #npr #bbc How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @heavytable How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @CarltonCountyMN #MN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @1280ThePatriot How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @VisitFaribault Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @dunnbroscoffees Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ArkansasOnline 60% on #mnsure already hurt. RT @KSTP: McFadden proposes to scrap Obamacare; Franken says that would hurt Minnesotans http://t.co/9LYkF7hLbE Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MCAD #mcad RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. RT @KStreetHipster: The Senate matters: RT @Sarah__Reynolds: Franken won MN Sen in 2008 by 312 votes of 2.4MILLION votes cast. He was decid Al Franken broke his promise to Veterans. WATCH: https://t.co/s52RWAWLxv #mngop #stribpol #VAScandal Net Neutrality-Sen. Al Franken 
Retweet! http://t.co/G1sRfK6yCP
http://t.co/7yHPPYLzox #NoSlowLane #Deaf How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @citypages #citypages RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. My guy al franken! #VoteOrDie keeping the internet free! http://t.co/R9uGvj1fPI How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @alzMNND How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how http://t.co/PVUhwY3fnn @TPPatriots #TPMP #teaparty RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @altribune RT @LloydMarcus: Liberals panic over defeat of Al Franken http://t.co/rKRgiiCUez @ConservativeCCC #tcot #teaparty RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. RT @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/uBLnd2LcGD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @themacweekly U.S. ag secretary mingles with DFL leaders: ST. PAUL  Sen. Al Franken got an election-season bump Thursday fr... http://t.co/vbt09PYLdP Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @BemidjiState RT @jensan1332: Also 1000's of illegal votes were found in FL. Not to mention Al Franken seat who had more votes @navylostb0y @KenBottcher  Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Mankatonews Minneapolis Star Tribune Surprisingly Critical of Al Franken   via @NewsBusters http://t.co/NPOPV32nQ2 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC #CBS @CBS #abc @abc @nbc #nbc How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @newsobserver RT @Sarah__Reynolds: Al Franken won MN Senate race in 2008 by 312 votes of 2.4MILLION votes cast. He was deciding O'care vote. http://t.co/ Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @BeaconCF How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @powerlineblog @jeffsussna Adding that to my list of Prince, Husker Du, Bob Dylan, Al Franken, and Lonnie Anderson. Thanks. RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Join me in supporting Contribute Today via @actblue http://t.co/Zd6Ki3PXeT Supporting Al Franken against the Koch brothers' millions Al Franken~ Im good enough Im smart enough and dog-gone it people like me. RT @LloydMarcus: Al Franken and his supporters are sinking to new lows: http://t.co/EIVTWv1oDL http://t.co/wg6vGEktkc How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Macalester #college Today in dumb: Michele Bachmann Asks Al Franken to Help Defeat AlFranken http://t.co/fjjCL0MkOw RT @rollcall: You wont believe who Michele Bachmann sent a campaign fundraising mailer to http://t.co/YanjWXCR50 via @nielslesniewski RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn #CBS @CBS #abc @abc @nbc RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/ZqpH2ZizBb #PJNET RT please. RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @reviewjournal RT @MdlMurray: ISIS Complicating Al Frankens Dem. Reelection Bid in Minnesota | Creeping Sharia http://t.co/euH5P8IUkp Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @njdotcom RT @NWCTACCESS: Senator Al Franken stopped by the studio this afternoon for an exclusive interview for Oromo TV. @MailOnline @Shutterbugfun Were there any Al Franken votes there? #tcot Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @875Summit Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @tcimc Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @wctrib How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @HeraldTribune Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @GrandMaraisMN RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @sctimes #stcloudtimes How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Tennessean Is Al Franken admitting his mental illness? Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @dailyherald RT @Sarah__Reynolds: Al Franken won MN Senate race in 2008 by 312 votes of 2.4MILLION votes cast. He was deciding O'care vote. http://t.co/ Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @tptAlmanac Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @lohud How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @wdiowirt #WDIO #wirt Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PioneerPress #PioneerPress RT @MartinMawyer: ISIS Complicating Al Franken's Re-Election Bid  http://t.co/yOymdAvWFP RT @Progress2day: Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/O7CsjL7NOW #wiunion #twister @zapm: ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/pN6LfURoEj via @creepingsharia #tcot #ccot RT @creepingsharia: ISIS Complicating Al Frankens #Dem Reelection Bid in Minnesota http://t.co/nVZ5OXB1n4  #tcot #a4a #lnyhbt @heidiwillis @TaraLConklin How bout Senator Al Franken and Eleanor Roosevelt? re former #SNL cast members. Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/TPL1fsGP7g RT @GregoryLewis22: #StopRush #UniteBlue Check out this Amazon deal: Rush Limbaugh Is a Big Fat Idiot by Al Franken http://t.co/rCgK5LgSVV  RT @LloydMarcus: Al Franken and his supporters are sinking to new lows: http://t.co/EIVTWv1oDL http://t.co/wg6vGEktkc RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @theobserver Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @tulsaworld McFadden Proposes to Scrap Affordable Care Act; Franken Says that Would Hurt Minnesotans: Republican Senate ca... http://t.co/1n56lfqTWQ Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ArkansasOnline Should I get Al Franken glasses? Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ABC6NEWS Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @hutchleader ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/dAl4oKKZmn via @creepingsharia RT @Lileensvf1: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
#PJNE RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/ZqpH2ZizBb #PJNET RT please. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ThiefRiverFallz How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @dallasnews @Rockprincess818 They tried...   remember Al Franken?   lol ISIS Complicating Al Frankens #Dem Reelection Bid in Minnesota http://t.co/nVZ5OXB1n4  #tcot #a4a #lnyhbt Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @AnokaCounty Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @prmotefaribault Video: jessehimself: Bill OReilly clashes with Al Franken 1/2 http://t.co/GR8PTOOYBa ISIS Complicating Al Frankens Dem. Reelection Bid in Minnesota | Creeping Sharia http://t.co/LCTyA9fd9h Just saw an Al Franken political  commercial. #welcometoMN RT @The__Chauvinist: ISIS Complicating Al Franken's Dem

http://t.co/y415xPd4hb
#MyJihad Muslims ISIS #MakeInIndia Happy Navratri BJP - Sh How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @875Summit RT @townhallcom: Could ISIS Hurt Franken's Chance for Reelection? - While incumbent Minnesota Sen. Al Franken (D) has a comfortable... http RT @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/uBLnd2LcGD Al Gore, iargeted Individual Al Franken: More in common than first name http://t.co/HppH9IKQun RT @ConservativeCCC: Al Franken and his supporters are sinking to new lows: http://t.co/Bw3bnSxlOJ http://t.co/6SYzUcePYU Join me in supporting We PROUDLY endorse Senator Al Franken for re-election! via @actblue http://t.co/taPULYRDYx Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @reviewjournal ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/X3JYewlyzx via @creepingsharia Michele Bachmann Asks Al Franken to Help Defeat Al Franken http://t.co/0kNaswWfBZ via @rollcall   "This doesn't look like chatting" @grantbenner_ yep just hanging out with Al Franken. heading out soon, though. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/rG96uRACvF @TheBasementKUMD BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t.co/YvZwRLO0lf Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @nytimes #nytimes @nypost #nypost Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TBOcom Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC #stribpol #nytimes #washpost #AP RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr RT @plgoldsmith: #Join me in supporting Help us make a firewall around Al Franken and the U.S. Senate. via @actblue http://t.co/AhCs089cqC Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MPR RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @cities97radio RT @NickZerwas: Interesting they don't seem to mind that Al Franken doesn't think they are worth his time... @JohnCroman RT @teamvicbo: Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering -  http://t.co/RiDsHSBSX3 RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @TheLineMag Join me in supporting Help us make a firewall around Al Franken and the U.S. Senate. via @actblue http://t.co/DbcmI75nJq How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @TheSentinelMN How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @GustavianWeekly Michele Bachmans trolling is hilarious. Bachmann Asks Al Franken to Help Defeat Al Franken http://t.co/h7qlbHKBrW via @nielslesniewski RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ThePlainDealer RT @themillieneal: Al Franken is an apologist for Jihad and Muslim violence. All fighting is the same to the Saturnday Night Dumbass #mnsen Michele Bachmann Asks Al Franken to Help Defeat Al Franken http://t.co/1GQTd7Wjbr Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @WDSE_WRPT Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @duluthnews #duluthnews Join me in supporting Help us make a firewall around Al Franken and the U.S. Senate. via @actblue http://t.co/bY2O6WZ1Ds RT @LloydMarcus: Liberals panic over defeat of Al Franken http://t.co/rKRgiiCUez @ConservativeCCC #tcot #teaparty How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @thekingofwake Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @LawyerMN RT @ItsTheBrandi: Mike McFadden is running the campaign that everyone imagined non-serious Al Franken running in '08. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Rasmussen How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @CityHallScoop RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @wdiowirt #WDIO #wirt Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @HibbDailyTrib about doing stories that are easy to cover.~ Al Franken /2 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MyFoxTampaBay RT @WintheSenate: Obama Yes-Man, Al Franken, too afraid to debate #GOP @MikeforMN, RT if you are tired of liberals running scared #TCOT htt RT @res416: Minneapolis Star Tribune Surprisingly Critical of Al Franken #Ccot #tcot #pjnet http://t.co/bddsLfRP4c How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @HubbardGOP RT @mngop: Al Franken: Voting To Cut Our Military Budget, Putting Americans At Risk. http://t.co/dcXoymo2rJ #mngop #stribpol #stribpol #mn2014 #ap #teaparty #nytimes #washpost Duluth originators of broadcast Senate debate admit excluding IP to benefit Al Franken Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @washingtonpost #washpost RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. new Al Franken pancake http://t.co/26Pd3abu6A How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @letoilemagazine 2010 Fox News Report-"Al Franken likely owes his Senate seat to felons" - who voted illegally thanks to Mark Richie
http://t.co/kodij22fRq Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TIME How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @mercnews RT @lee_ritz: The early ballots will be found in Al Franken's trunk--&gt;Minnesotans Are Casting Ballots Already. Really. http://t.co/EGwAKwIj Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MinnLocal Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/2ssvlMUA5H @mytalk1071 #mytalk Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @denverpost Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @LutherSeminary #luther Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MetroCitiesMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MnBizMag RT @townhallcom: Could ISIS Hurt Franken's Chance for Reelection? - While incumbent Minnesota Sen. Al Franken (D) has a comfortable... http Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @wccoradio How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @NWHealthU RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MinneapolisMN RT @ConservativeCCC: Al Franken and his supporters are sinking to new lows: http://t.co/Bw3bnSxlOJ http://t.co/6SYzUcePYU How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @WCCO Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @projo Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @letoilemagazine RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. Free pizza and Al Franken #ICanDigIt Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @RadioK How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @pinejournal How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @DakotaCoFairMN RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. Al Franken you can SUCK A DICK How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @UMNews #UMNews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @nytimes #nytimes @nypost #nypost How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @RiceCoHS How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @BeaconCF Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC #stcloudstate @stcloudstate RT @tradethecycles: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
# How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Utsandiego RT @terri_georgia: Senator Al Franken draws map of USA: http://t.co/HeydXg3Qlb via @YouTube RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KandiHistory How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @swcbulletin @redsteeze The democratic ticket 2016; Al Franken,Hillary Rodham,Barbra Streisand,Billy Ayers,Louis Farrakhan,and Jerry mathers asthe beaver Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @SPNN RT @EqualityRising_: .@AlFranken Drops the Truth On The Senate: #CitizensUnited Is Money Laundering http://t.co/U7HKBroVSv #UniteBlue http: If you're just catching up on weird politics news, Michele Bachmann asked Al Franken for campaign cash: http://t.co/zyC3YxfTbZ Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @UMNews #UMNews sharing #suaju Sen. Al Franken Warns That Comcast, TWC Merger Could Threaten Open Internet - Va.. #internet #web http://t.co/zRgdSEZ5pk Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TB_Times How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @AOL RT @Sarah__Reynolds: Al Franken won MN Senate race in 2008 by 312 votes of 2.4MILLION votes cast. He was deciding O'care vote. http://t.co/ Al Franken kowtows to Islamists while Minnesota becomes a Jihadist hotbed http://t.co/l3d7DKNMRE RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. RT @WoodenThreat: @lynn9353 @Cats_lmbo @marylene58 @KoichicCheryl Oh,Al Franken Was, Here It's #LiberalApproved! Voted For It! http://t.co/ Sen. Franken Presses for Investigation into MN Veterans Death http://t.co/QKJ3UvSpwX Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @NewsdayOpinion RT @eph4_15: Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @mnartistsdotorg Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @millelacs RT @StevenErtelt: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MnBizMag Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @cookcountymn Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Caribou_Coffee RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @thenewstribune sharing #suaju Sen. Al Franken: Comcast buying Time Warner Cable could... - The Verge #internet #web http://t.co/Je9wsgpc33 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC #tpt @tpt RT @workdaymn: Senator Al Franken to AFLCIO delegates: "I'm here because of you. I fight for you." #mnaflcio14 #4allworkers @AFLCIO @MNAFLC How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @Broncos RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. RT @HonourableHusba: Al Franken, Michele Bachmann, and now the mooted return of Jesse Ventura. Minnesota is the id of American politics.  h Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ExcelSchools Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @HeraldTribune via @NewsBusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/6DabgkPAZg #tcot RT @Lileensvf1: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
#PJNE Could ISIS Hurt Franken's Chance for Reelection?: While incumbent Minnesota Sen. Al Franken (D) has a comforta... http://t.co/9Au6L65EBW How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @BringMN ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/Yzch4XeyYS via @creepingsharia RT @Sarah__Reynolds: Al Franken won MN Senate race in 08 by 312votes of 2.4MILLION Mn votes cast. He was deciding O'care vote. http://t.co/ RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. Al Franken's SUPPLY SIDE JESUS: http://t.co/ROXm5ket2M RT @LifeNewsHQ: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen Would "cons" like Randy have complained of secondary boycott of Al Franken? I wouldn't put it that way. RT@jadler1969 @RandyEBarnett The Senate matters: RT @Sarah__Reynolds: Franken won MN Sen in 2008 by 312 votes of 2.4MILLION votes cast. He was deciding O'care vote. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @seattletimes Al Franken: Sen. Al Franken at the 2014 Minnesota State Fair http://t.co/QAiGrHFBq9 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @UtneReader RT @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/uBLnd2LcGD RT @2AmendDefender: @Vote4Wallace @weeki1 @GOP A la Al Franken in Minnesota. Stolen Senate seat. RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD Ag Secretary Tom Vilsack with Rep Collin Peterson and Sen Al Franken at U's St. Paul campus. http://t.co/7orxhjkrc4 RT @Progress2day: Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/O7CsjL7NOW #wiunion #twister RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. @GirlygirlinMN @alfranken @GovMarkDayton The AL FRANKEN DECADE was the '80's ! http://t.co/7MQY2bjm8W Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @stillwgazette Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PioneerPublicTV Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KDAL610 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @SunSentinel @PhxKen @RussVet1 Al Franken? Was 60 vote 4 ocare? Stolen,(look up)! 1/9 Senators sent letter to IRS 2 go after conserv, tea party groups!! Just walked past Al Franken. Thats my exciting news How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @austinherald Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @1280ThePatriot RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MarshallCntyGOP RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. New #MNSEN Poll: Franken (D) 49%, McFadden (36%) http://t.co/Pjk3STgEIo How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @My29tv Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MNProgressive Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC #stcloudstate @stcloudstate RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD RT @mngop: Al Franken broke his promise to Veterans. WATCH: https://t.co/s52RWAWLxv #mngop #stribpol #VAScandal How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Marshall_Radio RT @Progress2day: Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/O7CsjL7NOW #wiunion #twister RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. RT @WintheSenate: Obama Yes-Man, Al Franken, too afraid to debate #GOP @MikeforMN, RT if you are tired of liberals running scared #TCOT htt Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @RenvilleCoFair Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @K102 #k102 Al Franken and his supporters are sinking to new lows: http://t.co/Bw3bnSxlOJ http://t.co/6SYzUcePYU How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @tulsaworld How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Saint_Cloud_MN a great EXAMPLE was when I met with IDIOT Al Franken, at their MN Sure celeb event. (Jan 2012) The top attorney EXPEhttp://t.co/bSFRkLazrb Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KFAN1003 #KFAN1003 RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @KandiWillmarEDC RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TCBmag RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @NorthwesternMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @GlobeMetro RT @BettyeBear: @Mike4MN  FL is in a fight 4 R Gov but if Al Franken can go down, very happy! A snake in the grass. One reason slipping int In Minnesota last time I checked AL franken's campaign has largely been financed by this Sugar corporate ( forgt the name) RT @StarTribune: Latest in 2014 Senate race: Franken, McFadden tailor messages to college students at University of Minnesota http://t.co/R Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @AccessPress Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t.co/HmpczggpOd RT @bridgetbhc: That awkward moment when you ask a senator to donate to the candidate trying to oust him... http://t.co/SgZcmwus1q via @nie The #mngop just called my house to let me know ISIS is here in Minnesota, its Al Frankens fault, and only Mike McFadden can stop them! Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @K102 #k102 RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @DLNewspapers RT @Lileensvf1: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
#PJNE RT @tradethecycles: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
# Seriously considering giving Al Franken's campaign some money just because their fundraising e-mails are truly entertaining. RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @DakotaCoFairMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MSPBJnews @julieblaha @alfranken Moe Jauer is 100% in the Al Franken camp... now who the real me will vote for? - can only hope he's as wise as me :) Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/2ssvlMUA5H @cityofduluth Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @vita_mn Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC #csbsju @csbsju How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @KSMQ #ksmq RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. NewsBusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/wUwbu2ZFxB #tcot #ocra #ampat RT @JohnCroman: Sen Al Franken chats with students at U of M VoterPalooza event. Mike McFadden will be here later for a town hall http://t. RT @LifeNewsHQ: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen RT @themillieneal: Al Franken's fatuous lies to support Obama and progressivism smell like #Taqiyya. Are U voting for ISIS in '14 #mnsen ht Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Saint_Cloud_MN RT @YellowdogAL: RT @EqualityRising_ ".  #CitizensUnited Is Money Laundering  #GOPKochAddicts http://t.co/dMtWxiFbuD" http://t.co/DEilWRs @elmergooch @marcylauren that's pretty funny. I've never listened to him, but I did read Al Franken's book about him Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @stltoday Donate $3 to help Senator Al Franken and keep the Senate in Democratic hands http://t.co/RFp4UxBVCH RT @WintheSenate: Obama Yes-Man, Al Franken, too afraid to debate #GOP @MikeforMN, RT if you are tired of liberals running scared #TCOT htt Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CrossrdsCollege RT @snagela: @SarahPalinUSA #Never forget, those who would destroy our nation. Defeat Kay Hagan,NC, Al Franken,Mn. Mary Landrieu, LA. or is Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Choose_Metro RT @Sarah__Reynolds: Al Franken won MN Senate race in 08 by 312votes of 2.4MILLION Mn votes cast. He was deciding O'care vote. http://t.co/ RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @NorthcentralU Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @LawyerMN RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. (This is a mite long, but I think/hope it's worth the read...)

I've been getting emails from Sen. Al Franken for... http://t.co/gvxs1z2K2A Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. Michele Bachmann Asks Al Franken to Help Defeat Al Franken http://t.co/fEr8CLPShs via @rollcall Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @WCCOBreaking #WCCO RT @mngop: Al Franken was the decisive vote for #Obamacare, and is responsible for the mess we are in. #mngop #mnsure http://t.co/iZC9CXDn2c RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @BostonGlobe Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @uwolmsted Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @UniversityChron Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @detroitnews RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @StCloudMinn @SecretsCity I'm telling you a secret, "secret city". How corrupt your favorite candidate, Al Franken actually is. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @rclreads Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MNSUMankato #mankatostate RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Contribute Today
Al Frankens grassroots team is coming up against their final FEC quarter deadline of this election https://t.co/3lZc3isU5m Rt"@bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R)Mike McFadden!Keep Dem Senate Majority! http://t.co/ee85X2WzYO" RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/cE4E3Tzt14 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @BethanyLutheran RT @LifeNewsHQ: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn @Ssimms777 #Liberals #progressives2014 You won't even take the time to see Al Franken is a puppet of #Obama when it's handed to U #Dreamer RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. RT @shell_belle5: Hmmm is Al Franken in trouble? http://t.co/USIU54B65X RT @LifeNewsToo: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen @DennisDMZ Al franken Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @baltimoresun Michele Bachmann Asks Al Franken to Help Defeat Al Franken http://t.co/PK32jgZQFC Oh Michele...are you still here? Retire already!! How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @freep How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Newsweek How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @Caribou_Coffee RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KSMQ #ksmq Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @BusinessMN RT @ophidianpilot: ISIS Complicating Al Frankens Dem. Reelection Bid in Minnesota 
#tcot #pjnet http://t.co/SGPREPRmPQ via @creepingsharia Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @1041JackFM Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @1500ESPN #ESPN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MNMOmag Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @HoustonChron RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn Senator Al Franken stopped by the studio this afternoon for an exclusive interview for Oromo TV. RT @CarverCountyGOP: Would anyone doubt that Al Franken would confirm an Obama appointment of Eric Holder to the U.S. Supreme Court??? #39, DFL Senator Al Franken voted for a 3.8% Medicare tax!  Higher taxes is not the answer!
Vote Mike McFadden as... http://t.co/OALyF2ezlH RT @NotFunnyFranken: Over 110,000 views already! Don't miss our new ad exposing Al Franken's Obamacare lie. #MNSen WATCH:
https://t.co/FHrL RT @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/uBLnd2LcGD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @93XRadio #93xradio Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @BostonGlobe How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @BeltramiHistory How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @SCUWMN Sending a Michele Bachmann fundraising pitch to the residence of Alan Franken? Yeah http://t.co/zyC3YxfTbZ RT @tradethecycles: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
# Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @WCCOBreaking #WCCO ISIS Complicating Al Frankens Dem. Reelection Bid inMinnesota http://t.co/ZpJYo3tIJx Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TheSentinelMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @WashTimes RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. @joelengel Al Franken is about as funny as Dan Akroyd. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @StribBiz Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @LMTKMag I had a good idea for a Mike McFadden ad that involve an Al Franken look-alike beating a McFadden straw man. Michele Bachmann Asks Al Franken to Help Defeat Al Franken http://t.co/ylZTzFalYI Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/OhiI3u6DJ2 #tcot How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ocregister How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @EyeOnPolitics RT @Chris_1791: Minneapolis Star Tribune Surprisingly Critical of Al Franken   via @NewsBusters http://t.co/NPOPV32nQ2 RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @TheJournalMPLS Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PB_News #postbulletin @lynn9353 @Cats_lmbo @marylene58 @KoichicCheryl Oh,Al Franken Was, Here It's #LiberalApproved! Voted For It! http://t.co/Q9zGXJ1Ahq How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @RamseyCounty RT @WoodenThreat: @lynn9353 @Cats_lmbo @marylene58 @KoichicCheryl Oh,Al Franken Was, Here It's #LiberalApproved! Voted For It! http://t.co/ How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @BemidjiState How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @lohud RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. Al Franken, Mike McFadden agree to three debates http://t.co/tSKXo6mhFN #MNpolitics #UniteBlue #VoteBlue2014 RT @tradethecycles: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
# RT @TNTweetersTX: Re-Elect SEN AL FRANKEN @alfranken #MN #StayBlue #TNTweeters #CIR #OFA Keep Democratic Senate Majority! #TNTweeters http How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @PopeCountyFair Hmmm is Al Franken in trouble? http://t.co/USIU54B65X How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @kool108radio #kool108 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @murraycounty RT @themillieneal: Al Franken's fatuous lies to support Obama and progressivism smell like #Taqiyya. Are U voting for ISIS in '14 #mnsen ht @yoshpoint0 same i spend my birthday with al franken too RT @jblack501c3: Can WE UNIFY against the BIGOTED 1% 

What does AL FRANKEN mean here?

Was he right?

@alfranken http://t.co/wjf3HOheBW How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MplsTVNetwork Join me in supporting Al Franken Contribute Today via @actblue http://t.co/mquaP6fVqi RT @Progress2day: Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/O7CsjL7NOW #wiunion #twister Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @AP #ap #upi @upi #bbc @BBCNews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @IndependentMN RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TCNewsTalk RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/ZqpH2ZizBb #PJNET RT please. RT @WintheSenate: Obama Yes-Man, Al Franken, too afraid to debate #GOP @MikeforMN, RT if you are tired of liberals running scared #TCOT htt @ksorbs @RealJamesWoods @REALStaceyDash @fredthompson @TherealJoepesci Need your help!  Al Franken has his h'wood libs. Support @MikeForMN $ RT @creepingsharia: ISIS Complicating Al Frankens #Dem Reelection Bid in Minnesota http://t.co/nVZ5OXB1n4  #tcot #a4a #lnyhbt How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @PolAnimal RT @Sarah__Reynolds: Al Franken won MN Senate race in 2008 by 312 votes of 2.4MILLION votes cast. He was deciding O'care vote. http://t.co/ "I don't know what it is, but Al Franken looks like a piece of cauliflower." -Abby "The Fourth Amendment doesn't apply to corporations..."
http://t.co/1tpfqexQVL
#Al #Franken #Politician Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PoliticsMN RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn RT @Chris_1791: Minneapolis Star Tribune Surprisingly Critical of Al Franken   via @NewsBusters http://t.co/NPOPV32nQ2 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @LATimes #latimes Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mnartistsdotorg Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @wdiowirt #WDIO #wirt How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @WCCOBreaking #WCCO RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MinneapolisMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @OakHillsCollege Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ScottLib_MN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @echopress Liberals panic over defeat of Al Franken 
http://t.co/rKRgiiCUez http://t.co/qW2JRwQkVI Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Marshall_MN @charlieshayneo @alfranken I think I said it. Al Franken continues to support the Union Public Employee's who own MN's Prison Indus. Complex A vote for Al Franken is a vote for Harry Reid's "do nothing" Senate http://t.co/kmyCgqa236   #stuckinthesenate @MNCD7GOP  @CD7DFL RT @tradethecycles: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
# Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Utsandiego How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @PilotNews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @SMSUToday RT @LloydMarcus: Liberals panic over defeat of Al Franken http://t.co/rKRgiiCUez http://t.co/FKpLblWwDk Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KMHL_AM Sen. Amy Klobuchar and Sen. Al Franken with AVHS students at Uponor for DOL E3 STEM grant tour. http://t.co/nD0uWH1BAI Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @freep @alfranken @MikeForMN And now Al Franken has voted against Constitutional check &amp; balance on Amnesty - giving all power to Obama Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @SWMplsPatch RT @GuertinJen: Al Franken addressing the delegation at the MN AFL-CIO convention #mnaflcio14 @MNAFLCIO http://t.co/K3EAyG9LT0 There's plenty of room for humor in politics, God knows, but it's a serious business.
 -Al Franken
., How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @RTDNEWS #IslamicState Complicating Al Frankens Dem. Reelection Bid in Minnesotastan @DNC @OFA #Islam #TCOT http://t.co/EwB0Xv3GBT Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC #csbsju @csbsju How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @kfaiFMradio #kfai RT @BrianLemaire2: .@RepresentDotUs @StampStampede T.R  had plenty of guts. From today's national pols, Bernie Sanders, Eliz Warren, Al Fra MT @GOP: Early voting has started in #MN. It's easy: http://t.co/T1n4nHXBhO Retweet &amp; Kick out Al Franken! #MNSen http://t.co/f0qzHSG8Xu RT @JohnGalt36: @MailOnline @Shutterbugfun Were there any Al Franken votes there? #tcot RT @snagela: @SarahPalinUSA #Never forget, those who would destroy our nation. Defeat Kay Hagan,NC, Al Franken,Mn. Mary Landrieu, LA. or is How is IP excluded from broadcast debates w/ TV personality Sen. Al Franken? Here's how http://t.co/PVUhwY3fnn @nytimes #times @nypost #post RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. You wont believe who Michele Bachmann sent a campaign fundraising mailer to http://t.co/YanjWXCR50 via @nielslesniewski @DocTexian @UniteBlueTX I'm w/Al Franken on this one: RUSH LIMBAUGH IS A BIG FAT IDIOT. ;-)  #StopRush TIL Senator Al Franken starred in Buffalo Bill's movie debut http://t.co/GZOk2CCl7s More pro #FATCA Senate Dems:
5. Mary Landrieu (D-IL)
6. Al Franken (D-MN)
7. Kay Hagan (D-NC)
8. Jeanne Shaheen (D-NH)
@healeynut RT @LloydMarcus: Liberals panic over defeat of Al Franken 
http://t.co/rKRgiiCUez http://t.co/qW2JRwQkVI RT @eph4_15: Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT Senator Al Franken draws map of USA: http://t.co/oqVfE3fjfr via @YouTube Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @thenewstribune Join me in supporting Al Franken for MN Senate!   Contribute Today via @actblue http://t.co/mquaP6fVqi "Sean Hannity took residence up Newt Gingrich's butt from 94 to 98. I got that from British intelligence." ~Al Franken How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @aitkinage RT @AlexisinJax: Did I wake up in the middle of Idiocracy or is Al Franken actually a Senator? #tcot Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @cityofalbertlea Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @tcdailyplanet @liamobde The sad thing is Norm Coleman sat on the Foreign relations committee and had some sway but got beat by Al Franken Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @cityofalbertlea RT @themillieneal: Al Franken's fatuous lies to support Obama and progressivism smell like #Taqiyya. Are U voting for ISIS in '14 #mnsen ht Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @smumn RT @themillieneal: Al Franken's fatuous lies to support Obama and progressivism smell like #Taqiyya. Are U voting for ISIS in '14 #mnsen ht RT @WintheSenate: Obama Yes-Man, Al Franken, too afraid to debate #GOP @MikeforMN, RT if you are tired of liberals running scared #TCOT htt RT @rollcall: You wont believe who Michele Bachmann sent a campaign fundraising mailer to http://t.co/YanjWXCR50 via @nielslesniewski Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PLChamberMN Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/5oFT6QpcGR via @politicususa RT @keithvlasak: The perfect example of substanceless Democrats FAILING?: Minneapolis Star Tribune Surprisingly Critical of Al Franken http How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @SaintPaul Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @DetroitLakesMN RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. Update: Franken touts farm bill as key accomplishment during US agriculture secretary's Minnesota trip:... http://t.co/oOiR70TwSj #MNleg Al Franken promised Veterans would have access to quality healthcare for life, he broke his promise. http://t.co/jrGZPi366D #mngop #stribpol How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @Atlanta_Falcons Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @statesman RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KAXE Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @SCUWMN Wow. Re: my last tweet. Al Franken's campaign, get out of my head: Case of the Mondays - https://t.co/0c34j0toZs How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @PioneerPress #Press RT @ItsTheBrandi: Mike McFadden is running the campaign that everyone imagined non-serious Al Franken running in '08. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MNCOG Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TIME How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Shakopee Sen Al Franken chats with students at U of M VoterPalooza event. Mike McFadden will be here later for a town hall http://t.co/5ySxSG5gaP Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MSR_NEWS Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/2ssvlMUA5H @pipestonestar Hmmm...a 53' Massengill truck is being unloaded at Al Franken's Campaign HQ. Saw Sen. Al Franken outside Northrup at UMN today. Fun surprise! #UMN #SenatorFranken #democracy #GettingReadyToVote AL FRANKEN: Minnesota needs federal action on railroads | Grand Forks Herald http://t.co/9mRQpJROlD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mspmag Our Senate Race is getting NATIONAL attention!  Al Franken's seat isn't as safe as he'd like..Mike McFadden can... http://t.co/uamnhaks7H RT @Sarah__Reynolds: Al Franken won MN Senate race in 2008 by 312 votes of 2.4MILLION votes cast. He was deciding O'care vote. http://t.co/ Michele Bachmann Asks Al Franken to Help Defeat Al Franken http://t.co/zQRtS9MrSt via @rollcall Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MSUMoorhead @alfranken Hey! Al Franken said something! It's about time he woke up. He's been taking a pretty sweet nap for last 5 years. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @seattlepi Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @newsobserver Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/BbljpVA78J RT @jensan1332: Also 1000's of illegal votes were found in FL. Not to mention Al Franken seat who had more votes @navylostb0y @KenBottcher  RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn  @AP @CNN @CBS @PBS @NPR RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @daytondailynews RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. RT @StarTribune: Latest in 2014 Senate race: Franken, McFadden tailor messages to college students at University of Minnesota http://t.co/R Al Franken, Mike McFadden agree to three debates http://t.co/hbfL8SS0M1 #politics How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @NYDailyNews How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @KQMorningShow #kqrs #kq RT @webertom1: At 11, Senate candidate @MikeForMN joins me on the @DailyCircuit. Your Qs welcome. http://t.co/7rxJRhKrub http://t.co/BVAmWx Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @BUZN1029 #buzn1029 How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @dunnbroscoffees RT @StarTribune: Latest in 2014 Senate race: Franken, McFadden tailor messages to college students at University of Minnesota http://t.co/R RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. RT @LloydMarcus: Liberals panic over defeat of Al Franken http://t.co/rKRgiiCUez @ConservativeCCC #tcot #teaparty RT @washdcnews: Michele Bachmann Asks Al Franken to Help Defeat Al Franken http://t.co/B6ka6UY0Gw @bjs5555 @alfranken Al Franken is one of our best Senators. He represents in the style of the incredible Paul Wellstone. Paul is smiling. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MPRnews #MPRnews @SarahPalinUSA #Never forget, those who would destroy our nation. Defeat Kay Hagan,NC, Al Franken,Mn. Mary Landrieu, LA. or is it DC? RT @jblack501c3: Can WE UNIFY against the BIGOTED 1% 

What does AL FRANKEN mean here?

Was he right?

@alfranken http://t.co/wjf3HOheBW RT @coreytab: Al Franken using Sandy Hook for re-election makes me sick and pisses me right the fuck off. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @EdenPrairieNews RT @MitchinNWA: @MickiNickHarp When I hear the words Bill O'Reilly.....I try to imagine Al Franken. RT @ConservativeCCC: Al Franken and his supporters are sinking to new lows: http://t.co/Bw3bnSxlOJ http://t.co/6SYzUcePYU How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MSPBJnews RT @JohnCroman: Sen Al Franken chats with students at U of M VoterPalooza event. Mike McFadden will be here later for a town hall http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Newsday Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Concordia_MN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @875Summit @TheAnonMessage Al Franken Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @orlandosentinel RT @american_dfndr: RT @GOP

Early voting has started in #MN. It's easy: http://t.co/qoaU09XdiX Retweet &amp; Kick out Al Franken! #MNSen http: McFadden Proposes to Scrap Affordable Care Act; Franken Says that Would Hurt Minnesotans: Republican Senate http://t.co/byRcc1UbiM How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @BusinessMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @pbpost Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ArtsOrbit Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mndailynews #mndaily RT @TaggertGirl: Democrat Group Think
Votes with #Obama:
Begich - 97%
Franken - 98%
Hagan - 96%
Landrieu - 97%
Pryor - 90% How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @crowwingmn RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. RT @alisonweir: Al Franken, the Pretend Progressive http://t.co/J1IrdzrrF4 UFCW Local 653 President Matt Utecht shaking hands with Senator Al Franken at the MN AFL-CIO Convention http://t.co/2m4CChbY6N RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn Liberals panic over defeat of Al Franken http://t.co/InCtqJMxPx How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @HuffingtonPost #Post RT @LifeNewsHQ: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen RT @p_staatz: Rt"@bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R)Mike McFadden!Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @SecretsCity Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @daytondailynews RT @JimHumbert: ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/X3JYewlyzx via @creepingsharia RT @GENOlukolade: about doing stories that are easy to cover.~ Al Franken /2 @ggreenwald This is a dumb, pointless, Al Franken argument. As anti-imperial as the Senate's resident comedian @nathanLfuller RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr Liberals panic over defeat of Al Franken http://t.co/rKRgiiCUez @ConservativeCCC #tcot #teaparty RT @Chris_1791: Minneapolis Star Tribune Surprisingly Critical of Al Franken   via @NewsBusters http://t.co/NPOPV32nQ2 RT @TaggertGirl: Democrat Group Think
Votes with #Obama:
Begich - 97%
Franken - 98%
Hagan - 96%
Landrieu - 97%
Pryor - 90% How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @CrownCollege Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/2ssvlMUA5H @RiceCoHS Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @isanticonews RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @EdinaMag RT @creepingsharia: ISIS Complicating Al Frankens Dem. Reelection Bid inMinnesota http://t.co/ZpJYo3tIJx RT @anjiecast: How involved were Sens. Carl Levin, Dick Durbin, Chuck Schumer &amp; Al Franken in the IRS scandal? http://t.co/6Sm2SLBnEx "http://t.co/5HDvZX5nuy :)" MRT @ChrisEgert Just darn near ran over Sen. Al Franken leaving the set ... thankfully the collision was avoided Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @VikingsNow Could ISIS Hurt Franken's Chance for Reelection? - While incumbent Minnesota Sen. Al Franken (D) has a comfortable... http://t.co/F7K9sVBrAB RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. "Minneapolis Star Tribune Surprisingly Critical of Al Franken" http://t.co/EP21dobJ7o ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/gYuMPA1H6K via @creepingsharia Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Marshall_Radio Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @LawyerMN Al Franken everybody  http://t.co/F8KH5C6M9t How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @tcdailyplanet RT @mngop: Al Franken was the decisive vote for #Obamacare, and is responsible for the mess we are in. #mngop #mnsure http://t.co/iZC9CXDn2c How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @forestlaketimes RT @Lileensvf1: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
#PJNE How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @RenCoHRAEDA Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @FillCoJournal RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @RenvilleCoFair Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @DMRegister RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. RT @PJKirk7: 5 Democrat Senators in IRS Scandal in 2014 ReElection: DURBIN-IL, Franken-MN, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL  http://t RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @theuptake If I get one more piece of mail from Al Franken I'm going to flip. RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @sctimes #stcloudtimes RT @BDayspring: Is raising political $$$ off Sandy Hook murders/tragedy ok? Al Franken thinks it is. http://t.co/lhf5LMcnSm   #MNsen How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @LeftMN That awkward moment when you ask a senator to donate to the candidate trying to oust him... http://t.co/SgZcmwus1q via @nielslesniewski Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ClassicalMPR Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Rasmussen RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KTIS #ktis Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @StOlaf #saintolaf How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @memphisnews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CCTimes RT @GENOlukolade: about doing stories that are easy to cover.~ Al Franken /2 Minneapolis Star Tribune Critical of Al Franken http://t.co/8GLvE9JIjr How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @sherburnecounty RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. Sen. Al Franken says feds must fund multi-modal transportation. #RailVolution http://t.co/HRNwSQhP4n Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @WDSE_WRPT @MayhewFred I'm thinking...Al Franken?  Possibly, David Letterman?  Digging up Saul Alinsky - he might stink, never mind - Beyonce?  Pelosi? Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @cdcmorrisonmn Al Franken won MN Senate race in 08 by 312votes of 2.4MILLION Mn votes cast. He was deciding O'care vote. http://t.co/wGMLnHtyvm It matters! RT @_determan: Your monthly reminder that this guy is the most powerful democrat in congress and Al Franken supports him. #McFadden http:// RT @NorwoodTeaParty: "Minneapolis Star Tribune Surprisingly Critical of Al Franken" http://t.co/EP21dobJ7o RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PhillyInquirer Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @morrisongop Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @StarTribune #strib RT @LifeNewsHQ: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD RT @LarrySabato: In #MNSen, Sen. Al Franken's (D) has maintained a solid lead, so we're moving it back to Likely D from Leans D. http://t.c ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/KwbsTDPSOn via @creepingsharia Al Franken and his wife lookin' good. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Choose_Metro Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Mlive Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @crowwingmn Email sent &amp; submitted electronically to Al Franken/Amy Klobuchar w/cc: Congressman Rick Nolan US Rep http://t.co/oaMee16C9V via @DebMatheny How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/rG96uRACvF @MPRnews #MPRnews RT @ConservativeCCC: Al Franken and his supporters are sinking to new lows: http://t.co/Bw3bnSxlOJ http://t.co/6SYzUcePYU RT @InverHillsCC: Sen. Amy Klobuchar and Sen. Al Franken with AVHS students at Uponor for DOL E3 STEM grant tour. http://t.co/nD0uWH1BAI Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @indystar How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @echopress How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @cspan Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/TrwsyDIpW2 #MNSen Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MinnesotaUMC RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CatholicSpirit Michele Bachmann Asks Al Franken to Help Defeat Al Franken http://t.co/rPVSsgyE4J via @rollcall RT @edunbarMPR: Ag Secretary Tom Vilsack with Rep Collin Peterson and Sen Al Franken at U's St. Paul campus. http://t.co/7orxhjkrc4 How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @TheJI RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KFAN1003 #KFAN1003 Starting @RailVolution hearing Sen Al Franken sing about transit. Gonna be a good day. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CarletonCollege #CarletonCollege RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn Liberal Colin Peterson hanging out with his buddy Al Franken. #mn07 http://t.co/vLXEk6YjuC West texas 
Roswell yeah it grows as it goes 
Takes AS 
U got that right 
Fire fighter 2 blocks away from al franken place 
&amp; look amy k's Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @citypages #citypages RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. RT @kyledanielsmith: Starting @RailVolution hearing Sen Al Franken sing about transit. Gonna be a good day. @Candace07 @VeronicaLewis @ASourAppleTree I selected this tangent &amp; I can be anyone I want to be in it. OOOOOO [raises arm] Al Franken! Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @HuffingtonPost #HuffingtonPost RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @redwoodarea How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @NNCNOW RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen RT @jensan1332: Also 1000's of illegal votes were found in FL. Not to mention Al Franken seat who had more votes @navylostb0y @KenBottcher  You can start voting TODAY! Entertaining instructions by Al Franken on how to vote:... http://t.co/TvGn2hi9XN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CityMinneapolis Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @DispatchAlerts Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @goodhuehistory Senator Al Franken says Senate members want a briefing on Syria air strikes. He wants assurances about scale and scope of offensive. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @TB_Times Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @StarTribune #strib Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MSUMoorhead Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @AlbanyEditor Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @FboNews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TheGroveland Donate $3 to help Senator Al Franken and keep Senate in Democratic hands http://t.co/cg18b4u2Fa Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KSTPbrk Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @VikingsNow Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mlcknights RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @houstonctygop How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @TBOcom RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. Al Franken~ Its easier to put on slippers than to carpet the whole world. RT @creepingsharia: ISIS Complicating Al Frankens #Dem Reelection Bid in Minnesota http://t.co/nVZ5OXB1n4  #tcot #a4a #lnyhbt RT @workdaymn: Senator Al Franken to AFLCIO delegates: "I'm here because of you. I fight for you." #mnaflcio14 #4allworkers @AFLCIO @MNAFLC How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @SWMplsPatch RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @BloomingtonCVB Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TheJournalMN sharing #suaju Sen. Al Franken: Comcast buying Time Warner Cable could... - The Verge #internet #web http://t.co/yvFUg2ToXL RT @p_staatz: Rt"@bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R)Mike McFadden!Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @CityofPequotLak How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @KCStar Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MPRnews #MPRnews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MapleGroveMag RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn RT @mngop: Al Franken: Voting To Cut Our Military Budget, Putting Americans At Risk. http://t.co/dcXoymo2rJ #mngop #stribpol How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Enquirer RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MSR_NEWS Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @sltrib How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @pbpost @Vote4Wallace @weeki1 @GOP A la Al Franken in Minnesota. Stolen Senate seat. RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. RT @dontspeakforme: ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/gYuMPA1H6K via @creepingsharia RT @edunbarMPR: Ag Secretary Tom Vilsack with Rep Collin Peterson and Sen Al Franken at U's St. Paul campus. http://t.co/7orxhjkrc4 @KSTP Well, Al Franken is WRONG!!!!! RT @eph4_15: Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MinnEcon Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/PbuPjpRcUf RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MNProgressive Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @JCPilot How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @murraycounty Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Saint_Cloud_MN How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @WburyMag RT @jjliberty: ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/cE4E3Tzt14 Mike McFadden, Republican US Senate candidate, is in the studio right now. Listen now: http://t.co/Ov62Kj966D via @mprnews How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @SWMetroMag Michele Bachmann Asks Al Franken to Help Defeat Al Franken http://t.co/B6ka6UY0Gw "@AoSHQDD: New #MNSEN Poll: Franken (D) 49%, McFadden (36%) http://t.co/7BWaSARdI0" --what the hell is wrong with you ppl in MN?? Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ExcelSchools Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TECHdotMN How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @HoustonChron Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @dallasnews WCPT Radio: #TBT Al Franken and Barack Obama at a WCPT event in 2006. http://t.co/FrHJtYwAfg Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MilleLacTourism RT @The__Chauvinist: ISIS Complicating Al Franken's Dem

http://t.co/y415xPd4hb
#MyJihad Muslims ISIS #MakeInIndia Happy Navratri BJP - Sh RT @webertom1: At 11, Senate candidate @MikeForMN joins me on the @DailyCircuit. Your Qs welcome. http://t.co/7rxJRhKrub http://t.co/BVAmWx @tptAlmanac Al Franken's makeup looks awesome! RT @rollcall: Michele Bachman Asks Al Franken to Help Defeat ... Al Franken http://t.co/YanjWXCR50 via @nielslesniewski Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @redwoodhistory Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @EdinaMag RT @Sarah__Reynolds: Al Franken won MN Senate race in 08 by 312votes of 2.4MILLION Mn votes cast. He was deciding O'care vote. http://t.co/ @GENOlukolade: about doing stories that are easy to cover. ~ Al Franken /2 | #YouveBeenSubbed:) Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @freep How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @Bengals @petefrt Is that Al Franken standing to her right? @GlennK1962HD2 How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @chicagotribune How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @espn How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @FreebornGOP sharing #suaju Sen. Al Franken: Comcast buying Time Warner Cable could... - The Verge #internet #web http://t.co/3Vf4wsV2do RT @MNVAPERS: URGENT: Call To Action - Tell US Senators from MN what you think about the FDA regulations on #ecigs - http://t.co/gTbFJvzXIf @AddamUp Sen. Al Franken D info@franken.senate.gov (202) 224-5641 @alfranken Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @WashTimes RT @HouseCracka: Greg Orman "Independent" gave thousands of dollars to Barack Obama, Hillary Clinton, Harry Reid, Al Franken, Kansas Democr Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @seattlepi Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @chicagotribune Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/cl62UA1rUy #tcot #msm #libtards Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/2ssvlMUA5H @MPRnews #MPRnews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @AM950Radio How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @GlobeMetro How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MNEpiscopal How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @LMTKMag RT @Sarah__Reynolds: Al Franken won MN Senate race in 2008 by 312 votes of 2.4MILLION votes cast. He was deciding O'care vote. http://t.co/ RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. @Mike4MN  FL is in a fight 4 R Gov but if Al Franken can go down, very happy! A snake in the grass. One reason slipping into Marxism Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @HubbardGOP How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @kare11 #kare11 RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. @johnkriesel You want to talk "misleading"? .@MnGOP ripped Franken for voting w/ McCain on this vote: http://t.co/KCJ9PEpmKS #CantMakeItUp Minnesota people are unintelligent. RT @AoSHQDD: New #MNSEN Poll: Franken (D) 49%, McFadden (36%) http://t.co/wGSbhj4jsu How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn #csbsju @CSBSJU Why are you so so obsessed with the First Lady's body? Al Franken was right.  @rushlimbaugh #StopRush RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn RT @KSTP: McFadden proposes to scrap Obamacare; Franken says that would hurt Minnesotans. http://t.co/ndPiYMOvEX How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @TIME RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Democrat Group Think
Votes with #Obama:
Begich - 97%
Franken - 98%
Hagan - 96%
Landrieu - 97%
Pryor - 90% Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @csbsjurecord RT @YellowdogAL: RT @EqualityRising_ ".  #CitizensUnited Is Money Laundering  #GOPKochAddicts http://t.co/dMtWxiFbuD" http://t.co/DEilWRs RT @JKelligesq: Join me in supporting AL FRANKEN IN US SENATE-SEND $3 OR $5  WHATEVER U CAN against Koch n Rove milions via @actblue http:/ RT @MikeForMN: Sen Franken would rather focus on raising taxes than keep us safe from American ISIS fighters. He just doesnt get it http:/ Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TBOcom Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @pinejournal RT @rollcall: Michele Bachman Asks Al Franken to Help Defeat ... Al Franken http://t.co/YanjWXCR50 via @nielslesniewski Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @schoolchoicewk How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @stpeterherald How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @SecretsCity RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Sen. Al Franken calls for Adrian Peterson suspension http://t.co/8snXyG74k4 How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @vita_mn RT @MNVAPERS: URGENT: Call To Action - Tell US Senators from MN what you think about the FDA regulations on #ecigs - http://t.co/gTbFJvzXIf RT @Faith4Mishel: ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/jht4VfivbH via @creepingsharia RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. RT @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/uBLnd2LcGD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @FinancialTimes RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/GiCwULWnov via @creepingsharia RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @citypages #citypages The perfect example of substanceless Democrats FAILING?: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/rNPtKylWAM RT @townhallcom: Could ISIS Hurt Franken's Chance for Reelection? - While incumbent Minnesota Sen. Al Franken (D) has a comfortable... http RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr RT @2AmendDefender: @Vote4Wallace @weeki1 @GOP A la Al Franken in Minnesota. Stolen Senate seat. Is Kenan Thompson leaving #SNL? He's the 4th longest tenured cast member behind Darell Hammond (14), Seth Myers (13), and Al Franken (12). Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MattSwenson Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @fsnorth @McPhersonHall imagine how many good-paying, family-supporting jobs the industry would have if tax was repealed. Al Franken has failed. RT @LifeNewsHQ: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @rockcountyfair sharing #suaju Sen. Al Franken: Comcast buying Time Warner Cable could... - The Verge #internet #web http://t.co/4KoY7OL4mp RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD @Flying_Spag_Mon @ARStrasser But you still have Al Sharpton and Al Franken! Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @RadioK How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @AZCardinals How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ChanhassenNews How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MinnLocal How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @NorthwesternMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @UMDBulldogs #umd @lee_ritz @NRO BETTER KEEP AN EYE ON THESE F-ING CRIMINAL SHITHEADS.  I WANT AL FRANKEN TOSSED IN F-ING LEAVENWORTH IF HE EVEN THINKS ABOUT Al Franken is the primary cause for tax inversion! Reform the corporate tax law to make the US competitive with other countries! #insanity How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @OlmstedDFL How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @kumm_radio How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @azcentral RT @Sarah__Reynolds: Al Franken won MN Senate race in 2008 by 312 votes of 2.4MILLION votes cast. He was deciding O'care vote. http://t.co/ Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @projo RT @CarverCountyGOP: 2010 Fox News Report-"Al Franken likely owes his Senate seat to felons" - who voted illegally thanks to Mark Richie
ht RT @terri_georgia: Senator Al Franken draws map of USA: http://t.co/HeydXg3Qlb via @YouTube RT @WebCaptioning: Net Neutrality-Sen. Al Franken 
Retweet! http://t.co/G1sRfK6yCP
http://t.co/7yHPPYLzox #NoSlowLane #Deaf How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @PequotLakes Join me in supporting Al Franken for the Senate. Contribute Today via @actblue http://t.co/Z91iORFLyF RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Tennessean RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/ZqpH2ZizBb #PJNET RT please. RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. A Conservative Republican To Defeat Al Franken! http://t.co/7zZjZfftG2 Al Franken voted to raise our taxes 40 times since Obama's election! RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ocregister RT @terri_georgia: Senator Al Franken draws map of USA: http://t.co/HeydXg3Qlb via @YouTube Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KTIS #ktis Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ajc How ISIS Is Complicating Al Franken's Reelection Bid - ABC News http://t.co/A8pctduWge RT @C_C_Mitchell: The NRA has endorsed Republican Mike McFaddens campaign for U.S. Senate. He's challenging incumbent Al Franken (D-MN) #m Support Al Franken for Senate!! http://t.co/0OoJbC4icC Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @austinherald RT @ProLifePolitics: Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/uBLnd2LcGD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Rasmussen Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MSPBJnews ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/5WMgVxS8GP RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. @DineshDSouza  Congrats! My jaw is still hanging over Al Franken being "free &amp; serving".  ur humility, attitude &amp; work. #CCOT #KellyFile Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @newcountry957 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @BloomingtonCVB RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/ZqpH2ZizBb #PJNET RT please. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @SecretsCity Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @smumn RT @edunbarMPR: Ag Secretary Tom Vilsack with Rep Collin Peterson and Sen Al Franken at U's St. Paul campus. http://t.co/7orxhjkrc4 RT @creepingsharia: ISIS Complicating Al Frankens #Dem Reelection Bid in Minnesota http://t.co/nVZ5OXB1n4  #tcot #a4a #lnyhbt How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @dc4DFL RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. Minnesotans, its TIME to fight for continued strong prosperous economic growth. Get the early vote send McFadden packing! Vote 4 Al Franken! How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @KSAX_News Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @readersdigest RT @nielslesniewski: Fundraising mailer to "Alan Franken" from Bachmann seen here http://t.co/zyC3YxfTbZ #mnsen http://t.co/eOHSIihHK9 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/2ssvlMUA5H @NBCDFW How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @Starbucks RT @WintheSenate: Obama Yes-Man, Al Franken, too afraid to debate #GOP @MikeforMN, RT if you are tired of liberals running scared #TCOT htt How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @WillmarChamber Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @newsnorthfield RT @daninava: @Vinncent @MSavarese Jesse Ventura, Al Franken Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @93XRadio #93xradio RT @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/uBLnd2LcGD RT @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/uBLnd2LcGD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @FreebornGOP Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @forestlaketimes @joelengel @DanJoseph78 Wait, you're saying Al Franken had a comedic peak? ...that he was once funny? RT @NotFunnyFranken: Over 110,000 views already! Don't miss our new ad exposing Al Franken's Obamacare lie. #MNSen WATCH:
https://t.co/FHrL How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @SunSentinel RT @PJKirk9: BREAKING - Suddenly Democrat Senator Al Franken in Minnesota Becomes Very Vulnerable as Obama Shoots Him in the Foot  http://t Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @FresnoBee Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @chicagotribune Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @GlobeUniversity Al Franken on @tptAlmanac start the Ah Counting. Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @NicolletCty_GOP Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @DandC Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @rockcountyfair How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @1500ESPNJudd @Al Gore, #Targeted Individual @Al Franken: More in common than first name http://t.co/Ohes8Irgjv via @examinercom Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @pbpost RT @PJKirk9: BREAKING - Suddenly Democrat Senator Al Franken in Minnesota Becomes Very Vulnerable as Obama Shoots Him in the Foot  http://t Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @RadioK RT @mngop: Al Franken: Voting To Cut Our Military Budget, Putting Americans At Risk. http://t.co/dcXoymo2rJ #mngop #stribpol RT @BoolooBear: Minnesota elected Jesse Ventura and Al Franken. So do the voters go nuts when they see a washed up shit ass celebrity on th Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @altribune sharing #suaju Sen. Al Franken: Comcast buying Time Warner Cable could... - The Verge #internet #web http://t.co/yNLmDII8Wm Wait a minute! Al Franken-stein! Now that's funny! Get it? RT @Lileensvf1: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
#PJNE Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CarltonCountyMN @MNSunSailor Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @FOX47Roch ISIS Complicating Al Frankens Dem. Reelection Bid in Minnesota 
#tcot #pjnet http://t.co/SGPREPRmPQ via @creepingsharia How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ArkansasOnline RT @themillieneal: why is Al Franken running away from the record of Al Franken? Al, guess what, you are the insider! numbnuts #mnsen http: Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @WburyMag How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @RAMyersLibrary Al Franken has been edited http://t.co/k1UM9Lqx1F Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @StOlaf #saintolaf RT @lord_dottie: @ChuckNellis @DMashak @PatVPeters @ZookZangsten @JohnFromCranber  Barry's next choice for AG ~input from Al Franken &amp;.Al S #Join me in supporting Help us make a firewall around Al Franken and the U.S. Senate. via @actblue http://t.co/AhCs089cqC RT @whatalulu: Is there any tactic too "low" for liberal Al Franken &amp; his #biggovernment pals? Don't let them win: http://t.co/MNqIZta1L9  Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ScottCountyMN RT @lee_ritz: The early ballots will be found in Al Franken's trunk--&gt;Minnesotans Are Casting Ballots Already. Really. http://t.co/EGwAKwIj Its too bad I am not a MN resident. I would so vote for Al Franken just to get rid of this Mcfadden clown Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CrownCollege Randall,

See our endorsement of Al Franken and news of the latest polls in his race? -- Adam

Can you donate $3... http://t.co/QDRNSfVayn Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @NNCNOW Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @AugsburgCollege How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @KenyonLeader How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @PhillyInquirer Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mspmag RT @mncorn: From @alfranken: Minnesota needs federal action on railroads: http://t.co/1Np3Pl9sag Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @kumm_radio "Sen. Franken was correct. Citizens United is money laundering hidden behind a Supreme Court provided excuse of... http://t.co/fewBlJZHFS Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @SPNN Al Franken and his supporters are sinking to new lows: http://t.co/EIVTWv1oDL http://t.co/wg6vGEktkc Sen. Al Franken looks to the late Paul Wellstone for inspiration http://t.co/dK38fVzuwB RT @creepingsharia: ISIS Complicating Al Frankens Dem. Reelection Bid inMinnesota http://t.co/ZpJYo3tIJx How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Bemidji RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Choose_Metro How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @DMRegister RT @PJKirk9: BREAKING - Suddenly Democrat Senator Al Franken in Minnesota Becomes Very Vulnerable as Obama Shoots Him in the Foot  http://t RT @mngop: Al Franken promised Veterans would have access to quality healthcare for life, he broke his promise. http://t.co/jrGZPi366D #mng RT @HouseCracka: Orman gives money to Obama, Hillary, Reid, Franken. He is a Democrat in a costume. @mdcolli @Burdog7 @patRoberts2014 @Orma Orman gives money to Obama, Hillary, Reid, Franken. He is a Democrat in a costume. @mdcolli @Burdog7 @patRoberts2014 @OrmanForSenate RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/ZqpH2ZizBb #PJNET RT please. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TCNewsTalk Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @cspan Al Franken is the name of the scientist, his monster's name is The Bush Administration and seeing it typed out I realize this joke sucks RT @InverHillsCC: Sen. Amy Klobuchar and Sen. Al Franken with AVHS students at Uponor for DOL E3 STEM grant tour. http://t.co/nD0uWH1BAI Al Franken has been edited http://t.co/f4lGcWmU1B How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @duluthnews #duluthnews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/2ssvlMUA5H @1041JackFM RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KSTP #KSTP How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @journalsentinel How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @GrandMaraisMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC  @AP @CNN @CBS @PBS @NPR @wsj Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @sherbdfl Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @kool108radio #kool108 RT @shawnpisteySC: @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/97MQ0jm0ua #tcot ISIS Complicating Al Frankens Dem. Reelection Bid in Minnesota: via How ISIS Is Complicating ... http://t.co/uhtOFgqE8R #teaparty Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @SaintPaul RT @al_luttschwager: "I don't know what it is, but Al Franken looks like a piece of cauliflower." -Abby How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @mlcknights Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @azcentral Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @StribBiz Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @kvsc881fm RT @RepubAbroadHK: More pro #FATCA Senate Dems:
5. Mary Landrieu (D-IL)
6. Al Franken (D-MN)
7. Kay Hagan (D-NC)
8. Jeanne Shaheen (D-NH)
@ Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mercnews RT @washdcnews: Michele Bachmann Asks Al Franken to Help Defeat Al Franken http://t.co/B6ka6UY0Gw RT @eph4_15: Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT At 11, Senate candidate @MikeForMN joins me on the @DailyCircuit. Your Qs welcome. http://t.co/7rxJRhKrub http://t.co/BVAmWx62ru RT @TunaCharlie: .@Reince: Obama's radical agenda depends on Al Franken. http://t.co/t0Ld1JwRtX Fire him &amp; Stop... agenda. #MNSen http://t RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @usatoday #usatoday How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @OakHillsCollege RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @OWHnews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @indystar Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @OtterTailCounty How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @millelacs Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KSAX_News RT @yoshpoint0: "Net neutrality is no laughing matter" -me to al franken http://t.co/6lvQmlCqyJ How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @redwoodhistory RT @Sarah__Reynolds: Al Franken won MN Senate race in 08 by 312votes of 2.4MILLION Mn votes cast. He was deciding O'care vote. http://t.co/ RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
#PJNET #Sinister6 RT @LifeNewsHQ: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MplsTVNetwork How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @PEcom_news Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Hennepin #Hennepincounty RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. RT @MrPaulotics: 2-3 hours of work. Who would have thought firing Franken would be so hard. #fireFranken Vote @MikeForMN http://t.co/Tq0pV0 Only when it's convenient...... RT @MrPaulotics: Liberal Colin Peterson hanging out with his buddy Al Franken. #mn07 http://t.co/cW0Ur7UamK RT @timeboat56: #IslamicState Complicating Al Frankens Dem. Reelection Bid in Minnesotastan @DNC @OFA #Islam #TCOT http://t.co/EwB0Xv3GBT RT @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/uBLnd2LcGD A revision of my Franken painting from this morning, my own interpretation and extrapolation http://t.co/k6zuJM0H9X Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @sacbee_news RT @lee_ritz: The early ballots will be found in Al Franken's trunk--&gt;Minnesotans Are Casting Ballots Already. Really. http://t.co/EGwAKwIj RT @BDayspring: Is raising political $$$ off Sandy Hook murders/tragedy ok? Al Franken thinks it is. http://t.co/lhf5LMcnSm   #MNsen RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ApostolicBible Liberals panic over defeat of Al Franken http://t.co/rKRgiiCUez http://t.co/FKpLblWwDk Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @BrownMNGOP How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @OwatonnaNews How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @UtneReader Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PhillyInquirer @ReaganGuy A vote for Al Franken is a vote for rigged elections. @Katzekraus @alfranken @MNCD7GOP How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MSUMoorhead Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TheBuffaloNews RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @proctorjournal How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn #state @statestate Jeremiah was a bullfrog, was a good friend of Al Franken. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Concordia_MN RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @perfectduluth RT @TNTweetersTX: Re-Elect SEN AL FRANKEN @alfranken #MN #StayBlue #TNTweeters #CIR #OFA Keep Democratic Senate Majority! #TNTweeters http Michele Bachmann Asks Al Franken to Help Defeat Al Franken http://t.co/oqY8uG631N Meanwhile, @MicheleBachmann's political machine remains a real crack operation. http://t.co/FtcHAMANNK via @nielslesniewski How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MNCOG RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Suntimes ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/xwo8fNbVdT via @creepingsharia RT @LifeNewsHQ: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen RT @SangyeH: RT @BubbaAndThem: Sen Al Franken breaks down on Senate floor as he discusses violence agnst homeless women http://t.co/Kf1QulK #stribpol #mn2014 #ap #teaparty #nytimes #washpost Duluth News Tribune, Chamber, violate Equal Time federal law to help Al Franken win Michele Bachman Asks Al Franken to Help Defeat ... Al Franken http://t.co/YanjWXCR50 via @nielslesniewski RT @rollcall: You wont believe who Michele Bachmann sent a campaign fundraising mailer to http://t.co/YanjWXCR50 via @nielslesniewski RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @fcdfl RT @eph4_15: Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Patriots it time to remove Al Franken from Congress https://t.co/ZqpH2ZizBb #PJNET RT please. Minnesota Senator Al Franken releasing this statement after reports a Minnesota veteran died waiting for care... http://t.co/oQunFIqNii Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Mlive Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/2ssvlMUA5H @DandC RT @cd5762: Contribute Today
Al Frankens grassroots team is coming up against their final FEC quarter deadline of this election https://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @GlobeMetro RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @DispatchAlerts RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @canishoopus How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @mspmag RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. RT @lee_ritz: The early ballots will be found in Al Franken's trunk--&gt;Minnesotans Are Casting Ballots Already. Really. http://t.co/EGwAKwIj How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @1280ThePatriot sharing #suaju Sen. Al Franken Warns That Comcast, TWC Merger Could Threaten Open Internet - Va.. #internet #web http://t.co/GfpkKiec5w RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. .@CatRichert Best part of the whole article was hearing that wealthy celebrity Al Franken is trying to depict McFadden as rich &amp; famous. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @EdinaMag How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @1500ESPN_Reusse Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @CityHallScoop RT @mngop: Al Franken was the decisive vote for #Obamacare, and is responsible for the mess we are in. #mngop #mnsure http://t.co/iZC9CXDn2c Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @UMMorris #morris Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @kfaiFMradio #kfai RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. Jon Henschen writes an opinion in the StPaul Pioneer Press today about the laughable Al Franken's position on inner-city education failures. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @HamlineOracle How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @CityMinneapolis RT @nielslesniewski: If you're just catching up on weird politics news, Michele Bachmann asked Al Franken for campaign cash: http://t.co/zy Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TheLineMag Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @AsburyParkPress From @alfranken: Minnesota needs federal action on railroads: http://t.co/1Np3Pl9sag Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @WCCO Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @My29tv Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PilotNews How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @WinonaStateNews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @kfaiFMradio #kfai RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @AnokaCounty How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT @Browns Al Franken addressing the delegation at the MN AFL-CIO convention #mnaflcio14 @MNAFLCIO http://t.co/K3EAyG9LT0 @tessagratton I got an anti-Franken ad  "Al Franken voted 97% with Obama!" #stribpol #mn2014 #ap #teaparty #nytimes #washpost With all that $$$ why isn't Al Franken running his ads on Vikings football and Thurs nite Minnesota Senator Al Franken releasing this statement after reports a Minnesota veteran died waiting for care through Minnesota's... Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @SFGate RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. RT @AlexisinJax: Did I wake up in the middle of Idiocracy or is Al Franken actually a Senator? #tcot How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @CrossrdsCollege Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @themacweekly RT @TCJewfolk: "Pop Parsha: Al Franken and Nitzavim" - http://t.co/a3BNC0nW (Read. Enjoy. RT.) RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MayoClinic #MayoClinic RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @Chanhassennow How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @WildRiceCouncil RT @NumbersMuncher: In Minnesota, the GOP leads generic ballot by 2 but Franken leads by 9. Difference? GOP leads Indys by 21 on generic, j Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @NewsdayOpinion Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @powerlineblog How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @UMDBulldogs #umd RT @AlexisinJax: Did I wake up in the middle of Idiocracy or is Al Franken actually a Senator? #tcot Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @caledoniaargus RT @creepingsharia: ISIS Complicating Al Frankens #Dem Reelection Bid in Minnesota http://t.co/nVZ5OXB1n4  #tcot #a4a #lnyhbt Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @dallasnews How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @McLeodGOP How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MiamiHerald Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @BUZN1029 #buzn1029 Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ThePlainDealer How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @rclreads How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/rG96uRACvF @TCNewsTalk Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @stribmoney RT @Assoc7: BREAKING, 6 Democrat Senators Voted For Amnesty TODAY: Udall-CO, Franken-MN, Durbin-IL,Begich-AK, Merkely-OR,Udall-NM http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ladailynews RT @GENOlukolade: about doing stories that are easy to cover.~ Al Franken /2 How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @KTIS #ktis Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Shakopee RT @LloydMarcus: Liberals panic over defeat of Al Franken http://t.co/rKRgiiCUez @ConservativeCCC #tcot #teaparty RT @LifeNewsHQ: RT  @ProLifePolitics Minnesota begins early voting today! Get out and vote to send Al Franken home! #mnsen RT @RepubAbroadHK: More pro #FATCA Senate Dems:
5. Mary Landrieu (D-IL)
6. Al Franken (D-MN)
7. Kay Hagan (D-NC)
8. Jeanne Shaheen (D-NH)
@ Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @kvsc881fm RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @RiceCountyFair RT @quiet888: Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/5oFT6QpcGR via @politicususa RT @LloydMarcus: Al Franken and his supporters are sinking to new lows: http://t.co/EIVTWv1oDL http://t.co/wg6vGEktkc RT @eph4_15: Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PolAnimal RT @lee_ritz: The early ballots will be found in Al Franken's trunk--&gt;Minnesotans Are Casting Ballots Already. Really. http://t.co/EGwAKwIj Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @LookTrueNorth RT @DclareDiane: REMINDER: Al Franken, Amy Klobuchar, &amp; 44 other Democrats Voted to Cede Your Gun Rights to the U.N. http://t.co/Hx1UMeXBns Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MSUReporter @sportstalksc @BeatClem Al Franken as Dabo...  http://t.co/9c64FbDHf0 How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @TECHdotMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Macalester #macalestercollege RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. RT @4_God_Country: Minneapolis Star Tribune Surprisingly Critical of Al Franken: The Minneapolis Star Tribune is known for its li... http:/ Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/2ssvlMUA5H @NNCNOW Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @dchsmn RT @nielslesniewski: Michele Bachmann wants Al Franken's help to defeat, um, Al Franken http://t.co/zyC3YxfTbZ Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @alzMNND Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @FinancialTimes How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @keyc Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @manitoumess Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @tulsaworld RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @denverpost How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @CatholicSpirit Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @SFGate RT @bridgetbhc: That awkward moment when you ask a senator to donate to the candidate trying to oust him... http://t.co/SgZcmwus1q via @nie Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ItascaHabitat Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @insightnews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TheBuffaloNews How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @schoolchoicewk How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @GlobeUniversity Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/z8NeQLpXOF Obama Yes-Man, Al Franken, too afraid to debate #GOP @MikeforMN, RT if you are tired of liberals running scared #TCOT http://t.co/66n2yF9tun Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KSAX_News Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @GlobeUniversity RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. RT @GregoryLewis22: #StopRush #UniteBlue Check out this Amazon deal: Rush Limbaugh Is a Big Fat Idiot by Al Franken http://t.co/rCgK5LgSVV  RT @Faye0226: Patriots it time to remove Al Franken from Congress https://t.co/o7SYexnynP #PJNET RT please. RT @eph4_15: Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT RT @joelengel: At his comedic peak, Al Franken was never as funny intentionally as Joe Biden is unintentionally. RT @Progress2day: Al Franken Drops a Truth Bomb On The Senate: Citizens United Is Money Laundering http://t.co/O7CsjL7NOW #wiunion #twister Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @HuffingtonPost #HuffingtonPost Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @stribmoney Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @cityofduluth So did Erik Paulsen &amp; John Kline @MrPaulotics: Al Franken voted to arm syrian rebels with your money!! #mnsen @alfranken @MikeForMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @AugsburgCollege Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mowergop How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @1041JackFM Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KCStar @breane_lyga Al Franken's hair though. Damn impressive. RT @alfranken: "Al has the audacity to fight for the people...So obviously, special interests think Al must go. http://t.co/HQqcFlbudD Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @HoustonChron RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Tennessean RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @fergusfjournal Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ApostolicBible How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @WasecaNews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MinnPost RT @jjliberty: ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/cE4E3Tzt14 How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @RedwoodCtyFair Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @UMNews #UMNews RT @TNTweetersTX: Re-Elect SEN AL FRANKEN @alfranken #MN #StayBlue #TNTweeters #CIR #OFA Keep Democratic Senate Majority! #TNTweeters http How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @TCBmag Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ocregister How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. https://t.co/6XgS0P03vT #stribpol #mn2014 #dfl RT @Lileensvf1: % voted WITH bHo:  
Mark Begich 97% 
Mary Landrieu 97% 
Al Franken 98%
Kay Hagan 96% 
Mark Pryor 90%
Bruce Braley 87%
#PJNE Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MowerCoHistory ISIS Complicating Al Franken's Dem. Reelection Bid in Minnesota http://t.co/295bkipVgQ via @creepingsharia How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @DetroitLakesMN Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @BostonGlobe Minneapolis Star Tribune Surprisingly Critical of Al Franken #Ccot #tcot #pjnet http://t.co/bddsLfRP4c RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/cGALeUf0Lq How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @StScholastica Did I wake up in the middle of Idiocracy or is Al Franken actually a Senator? #tcot Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Chanhassennow sharing #suaju Sen. Al Franken: Comcast buying Time Warner Cable could... - The Verge #internet #web http://t.co/RV9bnAJuj4 RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @readersdigest RT @NumbersMuncher: In Minnesota, the GOP leads generic ballot by 2 but Franken leads by 9. Difference? GOP leads Indys by 21 on generic, j How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @JCPilot How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @DispatchAlerts Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @thenewstribune Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PilotNews How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @SFGate Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @ArtsOrbit RT @InverHillsCC: Sen. Amy Klobuchar and Sen. Al Franken with AVHS students at Uponor for DOL E3 STEM grant tour. http://t.co/nD0uWH1BAI RT @eph4_15: Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @prmotefaribault How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ExcelSchools RT @SpryGuy: If you haven't read the book "Rush Limbaugh Is a Big Fat Idiot" by Al Franken, you owe yourself: http://t.co/8BIGIplyCV #StopR Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @AsburyParkPress How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @StarAdvertiser How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @MinnEcon RT @newsbusters: Minneapolis Star Tribune Surprisingly Critical of Al Franken http://t.co/uBLnd2LcGD How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/rG96uRACvF @mytalk1071 #mytalk How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @ajc .@AAPSonline Al Franken helped http://t.co/QaCWW3HJhf Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @stltoday Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @KSTPbrk @GOP  Local Issues, Ground game, and trunks full of extra votes just in case. Just ask Al Franken. ISIS Complicating Al Franken's Re-Election Bid  http://t.co/yOymdAvWFP MN-Sen: Al Franken (D) Introduces The Surveillance Transparency Act of 2013 http://t.co/PVUl2HO4MG via @dailykos RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC #CBS @CBS #abc @abc @nbc #nbc Al Franken Mum on Latest IRS Scandal, But Takes Campaign Contributions From IRS Union - http://t.co/sfqXeyENHD   #PJNET #CCOT RT @GOP: Early voting has started in #MN. It's easy: http://t.co/pY5BQEXLrM Retweet &amp; Kick out Al Franken! #MNSen http://t.co/gorrmK4oYn RT @edunbarMPR: Ag Secretary Tom Vilsack with Rep Collin Peterson and Sen Al Franken at U's St. Paul campus. http://t.co/7orxhjkrc4 RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Liberals panic over defeat of Al Franken http://t.co/qkOnHEhMBG http://t.co/WW13nhE51U #tcot #teaparty #resist44 #tyranny #MakeDCListen Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @BusinessMN RT @bridgetbhc: That awkward moment when you ask a senator to donate to the candidate trying to oust him... http://t.co/SgZcmwus1q via @nie Al Franken (D) refuses to more debates with Mike McFadden (R), limiting the number to just 3 debates. http://t.co/xtYFD5bHth Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @usatoday #usatoday Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @PEcom_news RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. Al Franken version http://t.co/fTAfSoGyLo RT @DanFosterType: under my thumb How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @UMMorris #morris If my kid had stitches, Id just take him to the dr to remove them b/c Im not a fucking monster. - The Only Rebuttal Al Franken Needs RT @LloydMarcus: Liberals panic over defeat of Al Franken http://t.co/rKRgiiCUez @ConservativeCCC #tcot #teaparty RT @AlexisinJax: Did I wake up in the middle of Idiocracy or is Al Franken actually a Senator? #tcot RT @STPCityGOP: Al Franken on @tptAlmanac start the Ah Counting. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @EdenPrairieNews RT @bjs5555: Re-Elect SENATOR AL FRANKEN @alfranken #MN #StayBlue DEFEAT (R) Challenger Mike McFadden!  Keep Dem Senate Majority! http://t. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @manitoumess How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @WasecaChamber How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @mndailynews #mndaily How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @CCTimes Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @mntoday Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @detroitnews Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @MeekerGOP So you know? Then still granted that interview? @GENOlukolade: about doing stories that are easy to cover.~ Al Franken /2" Mike McFadden is running the campaign that everyone imagined non-serious Al Franken running in '08. @McPhersonHall fact: bipartisan support, important mn issue, ineffective Al Franken has failed MN. Objectively true. Admit it. RT @Assoc7: BREAKING, 5 Democrat Senators in IRS Scandal UP in NOV: Franken-MN, Durbin-IL, Shaheen-NH, Merkley-Oregon &amp; Tom UDALL http://t. Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @TheJI Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @RamseyCounty RT @TeaPartyOrg: Al Franken Opponent: Hes Been Invisible As A Senator http://t.co/MtxcM9hflO #tcot How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @KAXE Can't Wait to Debate Ad by Steve Carlson challenges Al Franken, Mike McFadden http://t.co/DiZcBh8aoC @Enquirer How the hell did MN GOP not manage to find strong candidate? I know it leans blue but C'MON! We're talking goddamn Al Franken here. How is IP excluded from broadcast debates with TV personality Sen. Al Franken? Here's how. http://t.co/PVUhwY3fnn @AlbanyEditor