 RT @HouseCracka: Kansas is being duped. Greg Orman is a BIG Democrat Donor. Here is just one of his donations to:
Obama for America. http:/ RT @kaysm522: @MikeLoBurgio Unlike Pat Roberts, Greg Orman is from Kansas.  He's smart, thoughtful, and tough. He will be a fresh, sane. vo Alternate title: Dems backing the 1%er...good times: Greg Orman discloses assets, investments worth millions | http://t.co/zfz5uGbWRV MT @Timodc: Congrats to top-notch Dem, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Greg Orman. If elected, Greg Orman of Kansas would be among richest U.S. senators: http://t.co/hR8BZQoau4 Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? - Hot Air http://t.co/TrKrwCYUSv I LIKE THE INDEPENDENT RT @dhellingkc: Greg Orman claims assets worth between $21.53 million and $85.96 million in first disclosure; annual income btwn $917,290 a RT @HouseCracka: Former Goldman Sachs Board Member, in prison, appointed Greg Orman as to serve as his representative on the two-member boa RT @TeaPartyNevada: UPDATE: Sarah Palin says Greg Orman trying to "snooker" Kansas voters in Senate race vs Pat Roberts http://t.co/UeDePO2 RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not Independent Candidate Alarms Republicans: Greg Orman -  http://t.co/sxH4JVm8f3 Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? http://t.co/662EwhlVkV @hotairblog RT @bktx24051: Meet Greg Orman; running as an Independent in Kansas. Wolf in sheep's clothing. 
http://t.co/vng0MF2ZSz RT @JessicaTaylor: .@mollyesque has a great look at who Greg Orman is and why he just might win #KSSen  http://t.co/7lf4ADStKt RT @TheFastPitch: Greg Orman is really rich http://t.co/CfYhettolA RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not WOLF COULD BACK ORMAN IN KANSAS SENATE RACE  HAGANS HUSBAND TOOK IN STIMULUS MONEY  HOLDER IS GONE.BUT CONGRESS http://t.co/62qvQAmrxQ RT @darlene09465021: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts... http://t.co/LEoecSJeFb Orman-Wolf meeting canceled: An insider says Wolf won't support Orman. http://t.co/QZmxvDDT3N #tcot #ccot #pjnet RT @nrlc: Clear contrast between @PatRoberts2014 and Greg Orman in the #KSSen race! #WeVoteProLife http://t.co/alfPexJ17Z RT @GOP: Greg Orman: Staffed by Democrats, funded by Democrats, has donated to Democrats, is the de facto Democrat. http://t.co/NFoCy7Y9KL  RT @blakehounshell: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts http://t.co/1N2yTcfczq Sources: Wolf weighs Orman nod - The tea party candidate is considering some political payback by endorsing the Ka... http://t.co/rHIZ1bADSK We stand with @PatRoberts2014 in the #KSSen race! Greg Orman would be another pro-abortion vote for Obama and Reid: http://t.co/mDRy2iT96O RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @Vision4USA: RT: Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http: Could they not nominate Greg Orman? RT @TPM: Kobach and Kansas Dems now in new standoff in Senate drama http://t.co/sjCtXG35aQ #KSSen Slam:  "Im Bob Dole, and I can tell you that Greg Orman is not Bob Dole."  #lsgop  #ksleg http://t.co/VO9acPac2Z Fate of US Senate might rest with this guy http://t.co/wViBTxwU8m "The Orman Factor" RT @OpenSecretsDC: If he wins, @OrmanForSenate could become one of the richest Senators in Congress, notes @KWCH12, citing our data: http:/ RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  What the Dems great white hope in Kansas actually stands for: http://t.co/rOT1fm8nya #kssen @SarahPalinUSA This Reagan Pubbie, since 1976, supports Greg Orman for the KS Senate seat.

https://t.co/1WABnNeEiP RT @kansasdotcom: Pat Roberts releases documents tied to Greg Orman's role in 2012 trial of business associate http://t.co/9rGXi0aLmL (@Bry Greg Orman @iuubob RT @HouseCracka: Sarah Palin says Greg Orman trying to snooker Kansas voters | The Wichita Eagle - http://t.co/maWaAOOws2 Independent Senate Candidate Greg Orman In Kansas Hires Veteran Democratic Aide http://t.co/Op9uqhxCxn via @dailycaller RT @politico: Orman-Wolf meeting canceled: http://t.co/busOLLvIfB #KSSen RT @Vision4USA: Greg Orman is a Trojan Horse for the Democrats. He is a not an Independent. Vote for Roberts! #KSsen #tcot http://t.co/8R3H .@GarrettHaake breaks down Senate candidate Greg Ormans personal finance report at 5:51 a.m. on #kctoday. http://t.co/SLFrzNvr7n Will Dems go all-out to beat Sen. Pat Roberts now? http://t.co/k0pFPtrrDf RT @RussOnPolitics: Afraid of losing the Senate seat in their home state, the Koch brothers are on the air against Greg Orman. http://t.co/ In Kansas, Pat Roberts Losing to Independent Greg Orman http://t.co/pV9u1rXrY4 via @usnews Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? http://t.co/bgxBNQ9WUP Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? http://t.co/eJAj7RIqyR RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not RT @Taniel: The tough math: If Democrats lose Pryor and Begich, as PPP suggests they will, they pretty much need Greg Orman to get to 50 se RT @TPM: What exactly are Democrats getting with Kansas independent Greg Orman? http://t.co/q9JyQgukna #KSSen http://t.co/xZQQnlJa4F RT @KansasGOP: Media Release:  KS Sen Candidate Greg Orman's Staff Reveals His Liberal Agenda #ksgop http://t.co/C2oOiiYtD8 RT @blakehounshell: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts http://t.co/1N2yTcfczq John McCain campaigns with Pat Roberts, says independent Senate candidate Greg Orman looks like a Democrat: http://t.co/Z2CE6UQIMR RT @kjon: "A vote for Greg Orman is a vote for @BarackObama" - Great new ad from Freedom Partners #KSsen https://t.co/NigPvV49Fc RT @HouseCracka: Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSA RT @KStatePatriot: Remember, Greg Orman is "Independent". cc @APjdhanna @ajjaffe @raginkansan @stevekraske
http://t.co/vCrUt9SDFM #kssen ht WOLF COULD BACK ORMAN IN KANSAS SENATE RACE  HAGANS HUSBAND TOOK IN STIMULUS MONEY  HOLDER IS GONE.BUT CON... http://t.co/aGcwfuC9rY Douchebag Milton Wolf exposes himself as the nihilist he is.

Seriously Tea Party people!!! Pick better... http://t.co/7JtTIv47b9 Kansas takes center stage: Sen. Pat Roberts is facing an unexpectedly strong challenge from independent Greg O... http://t.co/6En3hVZhwc "Independent" Greg Orman ran as Dem in 2008, and contributed to both Harry Reid and Barack Obama. He will caucus with Dems. 
#KSsen RT @jameshohmann: The Orman-Wolf meeting was canceled after @politico reported it was happening. Update by @mkraju &amp; @politicoalex: http:// @taniel Imagine that poll... "Will you vote for Pat Roberts, Pat Roberts, or Greg Orman?" Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star http://t.co/nGMu459hlu RT @politico: Milton Wolf may endorse Kansas independent Greg Orman, if Orman caucus with the Senate GOP http://t.co/CEZiDFAbEh .@dylanlscott tries to get a sense of what Greg Orman actually believes (if anything, that is): http://t.co/X3U18U7WmO #KSSen RT @Taniel: The tough math: If Democrats lose Pryor and Begich, as PPP suggests they will, they pretty much need Greg Orman to get to 50 se Greg Orman contributed $4,600 to Barack Obama.  He contributed $9,400 to the Kansas Democrat Party.  Twitter won't let me post the link. RT @joshtpm: What Exactly Are Dems Getting With Kansas Independent Greg Orman? @TPM http://t.co/7lLGtIwHC9 RT @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/eeXAyD4qwv Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO) - http://t.co/OaUG2n8NSR: Kansas.comSarah... http://t.co/uXTv41gEBo RT @ThePlumLineGS: RT @DrewMTips: Greg Orman might be in trouble. The NRSC has decided to treat him like he's a conservative. 

http://t.co RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems. Don't be f RT @charlieNPR: Greg Orman, painfully above the fold in Kansas capital paper. Meanwhile, Roberts hasnt polled over 42 since primary http:// Probably not tho RT @bennyjohnson: OUCH: Milton Wolf to endorse @SenPatRoberts opponent http://t.co/xRn08l5nl4 Senator Pat Roberts' vanquished GOP primary opponent may endorse Greg Orman...but there's strings attached. http://t.co/gX7Om9iY1R #KSsen RT @bjs5555: In #KS, for strategic reasons, our (D) candidate dropped out of the Senate race to BACK Ind Greg Orman to beat Tea Sen Roberts Greg Orman worth between $20-$86 million, filing shows. http://t.co/q0omHMmTAZ  #kssen @kcur RT @rubycramer: in an interview on the @CBSEveningNews, Greg Orman (@OrmanForSenate) says he'd caucus with whichever party has the majority Wow. George Will on Fox News All-Star discussion just said KS Senate race is "Orman's to lose."  #kssen WOLF COULD BACK ORMAN IN KANSAS SENATE RACE  HAGANS HUSBAND TOOK IN STIMULUS MONEY  HOL via http://t.co/eWYxOMAdIT http://t.co/zyXu5MQb8s Greg Orman donated $1000 to Harry Reid, $4600 to Obama $4600 to Hillary $9400 to KS Dem Committee #kssen #kansas #ksleg #ksgop RT @michaelpfalcone: Bob Dole calls Greg Orman "a Democrat masquerading as an Independent" in intvu w/ @alex_mallin http://t.co/r6NqC9lK4E Another #KSsen poll gives Greg Orman the lead over Senator Pat Roberts. Rasmussen has Orman ahead, 45%-40%. http://t.co/8bJSVYtWjb FreeRepublic: Sources: Milton Wolf weighs Greg Orman endorsement http://t.co/17A6aKmDHp #tcot RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t LOL Thats rich RT @PatRoberts2014: No public events for Greg Orman again todayWhere is he hiding? #WheresOrman RT @ThaBigPurn: Greg Orman for Senate. Get Ole man Roberts out of here. #Kansas RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic Milton Wolf lost his primary in KS, yet he may control whether GOP captures Senate or not --&gt; http://t.co/CmyEbYrrVb Orman-Wolf meeting canceled: A meeting between former tea party Senate hopeful Milton Wolf a... http://t.co/vEevsJeyBe #News #Azerbaijan RT @UpshotNYT: Greg Orman has a real path to victory in Kansas after last night's court decision. This isn't Kentucky. http://t.co/7utVyt5H RT @BryanLowry3: Greg Orman discloses personal finances, millions in real estate investments http://t.co/8urfqSrHIP #ksleg #kseln #kssen In Kansas, Democratic donors invest in uncertainty: Greg Orman, the independent U.S. Senate candidate from Kan... http://t.co/uSjRBKGjCQ RT @PatRoberts2014: .@OrmanForSenate has a problem being honest with KS. Tell him its time to tell the truth!  http://t.co/S65iG1RTO7 http RT @blakehounshell: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts http://t.co/1N2yTcfczq RT @lachlan: Pat Roberts' failed tea party challenger may endorse Greg Orman if he agrees to caucus with the GOP http://t.co/b72MdaZE0k RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C Lost my vote. They suck MT @willrahn: Greg Orman, the Indy who may take out Pat Roberts in Kansas, is a fan of Nickleback RT @instapundit: OH, PLEASE DONT:  Sources: Milton Wolf weighs Greg Orman endorsement.  I can understand a gr... http://t.co/3NQMOccAgK vi RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C RT @blakehounshell: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts http://t.co/1N2yTcfczq Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to ind... http://t.co/uyid3WsIg4 If KS news media would do jobs instead of playing water boy to Sen. cand. Greg Orman, race would be different. Oh, but I dream RT @charlieNPR: Greg Orman, painfully above the fold in Kansas capital paper. Meanwhile, Roberts hasnt polled over 42 since primary http:// RT @APjdhanna: Independent Senate candidate Greg Orman discloses owning between $21.5M and $86M in assets. http://t.co/aZwiTUM8zW #kssen #k RT @nrlc: We stand with @PatRoberts2014 in the #KSSen race! Greg Orman would be another pro-abortion vote for Obama and Reid: http://t.co/m Sources: Wolf weighs Orman endorsement http://t.co/4tbMto4R1R RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Kansas City Business Report: Orman's wealth exceeds $21M - Independent Senate candidate Greg Orman is doing OK f... http://t.co/PGaC1hhRCC RT @charlieNPR: Greg Orman, painfully above the fold in Kansas capital paper. Meanwhile, Roberts hasnt polled over 42 since primary http:// Though the ads I've seen of Greg Orman's tell what he wants to do and don't attack his opponent like ads normally do. So that's a plus. RT @rollcall: Kansas overseas election ballots will be sent out without listing a Democratic Senate nominee http://t.co/Gbh9u719Um via @ale NEWSFLASH!!! RICH WHITE #guy RUNNIN FOR CONGRESS!!! GREG ORMAN HAS GOT WAY MORE $ THAN U!!!  #GregOrman #news #wife RT @BDayspring: Things national press ignoring: Greg Orman Spox @mikephillips1 a fmr senior staffer for @DSCC Chair Michael Bennet &amp; @guyce Latest News: Orman's link to jailed investor deeper than portrayed: U.S. Senate front-runner Greg Orman plans ... http://t.co/5USqHuSXEr Pat Roberts's primary opponent would endorse Orman if Orman pledges to caucus with GOP. #KSSen http://t.co/C2014nQMdg RT @fairvote: "We have an electoral system that creates strange incentives"-- Exec Director Rob Richie in @CBSNews piece on #kssen http://t RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @ClaireDaviss_FV: Why is ranked choice voting valuable? It would avoid this messy political strategizing. #FairVote http://t.co/XMjefRzN RT @EchelonInsights: Adding #KSSEN to #InsightsOnAir Senate track. Greg Orman has 55% of the spots slated to air in next 3 weeks. http://t. Independent Senate Candidate Draws Scant Democratic Support http://t.co/aiq3uWwHu4 RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http #Congress #Control #Race John McCain joins Pat Roberts in #Kansas to say independent ... http://t.co/yrwSNeN24K Sources: Milton Wolf weighs Greg Orman endorsement http://t.co/HWyZe0MrVu via @POLITICO #voteks RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic RT @irin: Both sitting KS Senators have 100% ratings from National Right to Life. Here's Greg Orman's position: http://t.co/m99kktYUVQ RT @KStatePatriot: Hey @HouseCracka, ICYMI Greg Orman's New Silks company has ties with George Soros.

#KSSen http://t.co/HDdzEOK9eZ Could Independent Candidate Greg Orman Decide Who Controls the Senate? http://t.co/3KixYQnH23 RT @IstUngeheuer: Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? - Hot Air http://t.co/FkmXJQdHwL #tco RT @politico: Orman-Wolf meeting canceled: http://t.co/busOLLvIfB #KSSen Greg Orman releases his financials; net worth in the millions @KWCHMelissa looks at the numbers http://t.co/0NazEjRCF9 #kssen #ksleg #kwch12 RT @mkraju: #KSSEN news: Milton Wolf may endorse Orman if he caucuses with GOP; two will meet Friday. w/@politicoalex. http://t.co/E69qTdZR #finance #financenews Pat Roberts and Greg Orman see several issues differently in the U.S. Senate   Kansas Ci... http://t.co/RkBmCeqmPP RT @cynthia4877: GOP desperately trying 2 save KS Senate seat. Polls show Independent Greg Orman leading GOP Pat Roberts.

http://t.co/iUq RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t Kansas takes center stage http://t.co/T4b31bLZQW RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems.  Don't be  "In Kansas, Roberts fights for his seat  and the Senate" http://t.co/wIm5TO1Oos #msnbcdiscuss RT @Vision4USA: Greg Orman is a Trojan Horse for the Democrats. He is a not an Independent. Vote for Roberts! #KSsen #tcot http://t.co/8R3H Lexington: Stormin Orman http://t.co/BGtfHH1NN2 #finance #financenews Pat Roberts and Greg Orman see several issues differently in the U.S. Senate   Kansas Ci... http://t.co/lJGjxy7nwq RT @rickhasen: In a matter of weeks Greg Orman could be one of the most important people in American politics. #KSSEN RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @HouseCracka: To get elected in November, Democrats are running Independents like in Kansas. 

Greg Orman is a Democrat. Don't let them  A meeting between two men in Kansas who have never held elected office before could determine control of the Senate: http://t.co/cAuoC1ZdnU RT @TheFastPitch: New poll has Greg Orman stretching out a 7 point lead over Pat Roberts http://t.co/YSidofhxPd Greg Orman: Pat Roberts "not representing" Kansas interests #NewsVideos http://t.co/a8noVYTPiI If elected, Orman would be one of the 10 richest senators. http://t.co/Ajj7Ob7gEE http://t.co/giv1rBSJbQ Idiotic. RT @bennyjohnson: OUCH: Milton Wolf to endorse @SenPatRoberts opponent http://t.co/Wr0utNK2ER RT @jeffzeleny: FF @ABC's @alex_mallin for @KSSEN: Bob Dole on Greg Orman: "The guy is a Democrat masquerading as an Independent." http://t RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/8B5qZKlCPT GOP is planning a scorched-earth offensive to frame independent candidate Greg Orman as a shady businessman. http://t.co/z7cP5vEowr #KSsen RT @KrisKetzKMBC: If elected, Greg Orman of Kansas would be among richest U.S. senators http://t.co/dP9WqbwgcF Sources: Wolf weighs Orman endorsement - The tea party candidate is considering some political payback by endorsin... http://t.co/2yjYcMqeyo RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t Independent Senate Candidate Shown Little Love http://t.co/sMmoyfwpgT RT @KansasGOP: Get the latest on liberal Greg Orman:

http://t.co/fjCwpt6tgy http://t.co/XmbzeilMfv Greg Orman says he will caucus with whoever has clear majority. (1/2) RT @LaCivitaC: Greg Orman, call your office:   http://t.co/1r3XTl8Kn7 RT @mjbeckel: Independent Greg Orman lures left-leaning donors in #KSSEN despite uncertainty about whether he'll caucus with Dems http://t. Kansas Ballots Will be Mailed Without Democratic Senate Nominee http://t.co/7Sg9YkvXSf via @RollCall Greg Orman's ties to former Goldman Sachs exec convicted of insider trading go deeper than previously thought. http://t.co/RpqNp8T5uf #KSSen Meet Greg Orman, the Most Interesting Man inPolitics http://t.co/7B8ajlMGR4 In Kansas, Republican Sen.Pat Roberts fights for his seat  and the Senate  http://t.co/4EWfz4mJZw RT @kjon: "A vote for Greg Orman is a vote for @BarackObama" - Great new ad from Freedom Partners #KSsen https://t.co/NigPvV49Fc RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http Pat Roberts releases Greg Orman court documents http://t.co/kn1DNHODdc

KS voters love an issues-based campaign -- jobs &amp; equal rights. RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @CBSNews: Independent in Kansas race for U.S. Senate appears to have decent shot at winning http://t.co/8ZRjiRo8NM http://t.co/fIu9LSkVNQ After ad blitz, could Greg Orman caucus with GOP? #kssen http://t.co/0f3WHPysPs RT @mjbeckel: Independent Greg Orman lures left-leaning donors in #KSSEN despite uncertainty about whether he'll caucus with Dems http://t. If he joins the GOP caucus. Big caveat there. RT @bennyjohnson: OUCH: Milton Wolf to endorse @SenPatRoberts opponent http://t.co/h0Rc7FTCfL RT @SarahPalinLinks: Greg Orman contributed $4,600 to Barack Obama.  He contributed $9,400 to the Kansas Democrat Party.  Twitter won't let RT @FollowPalin: Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO http://t.co/exOUsgXBBB #palin #teaparty KS twist
"Wolf will endorse Orman if the Senate candidate promises to caucus with Republicans before he is elected."
http://t.co/cWXktoY7kp Keep Greg Orman out of the Senate https://t.co/BlmEEZ5hfl #ksgop #kssen #tcot RT @amyewalter: Greg Orman been on msg for a while. At Princeton ('91) he quotes Ross Perot, didn't join eating club, college GOPer http:// Kansas Ballots Will Be Mailed Without Democratic Senate #kssen http://t.co/2v5Y3GOn3i RT @rubycramer: in an interview on the @CBSEveningNews, Greg Orman (@OrmanForSenate) says he'd caucus with whichever party has the majority RT @ericdondero: Some liberal #Democrats now questioning their alignment with Ind. #GregOrman in #Kansas http://t.co/vvWCKlGbzX #partyswitc Finally, the Eagle clarifies today that Greg Orman does support abortion and same sex marriage. Who would he caucus with if elected? RT @HouseCracka: Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSA RT @GroverNorquist: Greg Orman is running for Senate in Kansas because Nevada needs another Senator.      Greg Orman: Harry Reid's other vo Is Pat Roberts conservative primary challenger in Kansas going to back GregOrman? http://t.co/iWr8t1xOwi @kprkoranda RT @blakehounshell Nate Silver is giving independent Greg Orman a 61% chance of beating Pat Roberts http://t.co/c7Inw9Ild0  RT @Vision4USA: Greg Orman is a Trojan Horse for the Democrats. He is a not an Independent. Vote for Roberts! #KSsen #tcot http://t.co/8R3H RT @darlene09465021: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts... http://t.co/LEoecSJeFb RT @HouseCracka: Kansas is being duped. Greg Orman is a BIG Democrat Donor. Here is just one of his donations to:
Obama for America. http:/ Sources: Wolf weighs Orman endorsement http://t.co/b2ebqeaVvC HuffPost Pollster gives an 11.6% chance that Greg Orman will decide which party controls the Senate http://t.co/OiQ67EOdJc #News: Kansas takes center stage: Sen. Pat Roberts is facing an unexpectedly strong challenge... http://t.co/UFVdPYITPR via @TheNewsHype RT @bloggingheads: The Senate kingmaker? @billscher &amp; @mattklewis on the potential power wielded by independent KS candidate Greg Orman. ht RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr RT @HouseCracka: Greg Orman maintains professional ties with ex-Goldman Sachs board member in prison. 

http://t.co/caT5TcrO3T

#ksgop #kss Will Dems go all-out to beat Roberts? http://t.co/EiaerbmAHE Top 5 Things About Kansas 'nonpartisan' 'independent' Greg Orman, Democrat, Democrat, Democrat, Democrat, CORRUPT  https://t.co/uwzBREeMhu Kansas Ballots Will Be Mailed Without Democratic Senate Nominee http://t.co/sAjAPCbgoP RT @jmartNYT: Milton Wolf, M.D., is having some fun getting even for stores about his Facebook habits http://t.co/55FZHxHjzC RT @willrahn: Greg Orman, the Indy who may take out Pat Roberts in Kansas, is a fan of both Coldplay and Nickleback https://t.co/4HIG046hM2 Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star http://t.co/Jw5zGMgHlD #money #jobs Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/8B5qZKlCPT Greg Orman, "Democratic candidate for U.S. senate in Kansas" likes Nickelback per Veoh profile http://t.co/wAqtaDhwIf http://t.co/xFHHUhpnda RT @ivn: Politics is not something that was intended to take over your life..." - @OrmanForSenate http://t.co/2mobdxAl7a RT @KStatePatriot: #Bombshell - Washington Post writes: "Greg Orman hiring of former @DSCC hand highlights personnel predicament" 

#Kssen RT @EchelonInsights: Adding #KSSEN to #InsightsOnAir Senate track. Greg Orman has 55% of the spots slated to air in next 3 weeks. http://t. RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @TeaPartyNevada: UPDATE: Sarah Palin says Greg Orman trying to "snooker" Kansas voters in Senate race vs Pat Roberts http://t.co/UeDePO2 RT @blakehounshell: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts http://t.co/1N2yTcfczq RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @nrlc: We stand with @PatRoberts2014 in the #KSSen race! Greg Orman would be another pro-abortion vote for Obama and Reid: http://t.co/m RT @nrlc: Clear contrast between @PatRoberts2014 and Greg Orman in the #KSSen race! #WeVoteProLife http://t.co/alfPexJ17Z @GOP Alaska, Alaska, Alaska. If not, then we need Iowa or Colorado. If we get one of those three, it's Greg Orman's choice. Two, we win. RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems. Don't be f Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star http://t.co/jEnPQZMyiA RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @dylanlscott: Wanna know why Greg Orman doesn't need party support? He's worth more than $21 million: http://t.co/53NGBmrG9O #KSSen RT @politico: Milton Wolf may endorse Kansas independent Greg Orman, if Orman caucus with the Senate GOP http://t.co/CEZiDFAbEh RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C Greg Orman maintains professional ties with ex-Goldman Sachs board member in prison. 

http://t.co/caT5TcrO3T

#ksgop #kssen #kansas #hello @jmf9527 Wouldn't It Be Even Funnier If That Was Greg Orman Under The Mask?! @PhilipRucker Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO http://t.co/1H25wzuOfT #palin #teaparty RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @MichaelLaRosaDC: Kansas Ballots Will be Mailed Without Democratic Senate Nominee http://t.co/LelNutab3N via @rollcall #KSSEN RT @CentProj: Greg Orman is "the most interesting man in politics." Help spread the word about this campaign! #kssen #CenterStands http://t RT @BDayspring: Peeling back the curtain: Democrat Greg Orman's ties to convicted investor run deep http://t.co/ijzYNmeP7d #KSsen #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/GM8m9nwNQc #alert New post: "Sources: Wolf weighs Orman endorsement" http://t.co/Kn4T9uCskj RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not RT @Drew_FV: Increase in 3+ candidate races highlights need for #RCV http://t.co/PDKkugWycP via @cbsnews Absolute must-read from @mollyesque: "I went to Kansas to see what this Greg Orman character is all about" http://t.co/V4nSUPBFxX RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t Is Pat Roberts' conservative primary challenger in Kansas going to back Greg Orman?  http://t.co/GmPy42BFSE Every Democrat Senate candidate (including Greg Orman, Democrat from Kansas) would vote for Harry Reid as Senate Majority Leader. RT @bjs5555: In #KS, for strategic reasons, our (D) candidate dropped out of the Senate race to BACK Ind Greg Orman to beat Tea Sen Roberts RT @shiracenter: #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/JMbAjDmVTl #alert RT @amyewalter: Greg Orman been on msg for a while. At Princeton ('91) he quotes Ross Perot, didn't join eating club, college GOPer http:// RT @KansasGOP: Slam:  "Im Bob Dole, and I can tell you that Greg Orman is not Bob Dole."  #lsgop  #ksleg http://t.co/VO9acPac2Z Orman would be among wealthiest senators, financial disclosure shows:  Greg Orman, the polit... http://t.co/oZuwJ0XWGl - @washingtonpost RT @bjs5555: In #KS, for strategic reasons, our (D) candidate dropped out of the Senate race to BACK Ind Greg Orman to beat Tea Sen Roberts RT @Vision4USA: RT: Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http: RT @lachlan: Greg Orman is trying to keep up a nonpartisan image, but he's getting assists from national and KS Dems http://t.co/gPZ9xksbQd RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems. Don't be f Independent Senate Candidate Shown Little Love: Independent Senate candidate Greg Orman of Kansas ha... http://t.co/WoHkxPw0mc @dizining RT @KStatePatriot: Remember, Greg Orman is "Independent". cc @APjdhanna @ajjaffe @raginkansan @stevekraske
http://t.co/vCrUt9SDFM #kssen ht RT @HouseCracka: Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSA RT @AoSHQDD: New #KSSEN Poll: Orman (I)* 45%, Roberts (R) 40% http://t.co/SvspVY5Ew0 RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @nrlc: #KSSen: Greg Orman would be one more pro-abortion, anti-life Democrat http://t.co/y0S2knYslm #prolife http://t.co/w0GIYhCUdw RT @cynthia4877: GOP desperately trying 2 save KS Senate seat. Polls show Independent Greg Orman leading GOP Pat Roberts.

http://t.co/iUq RT @peggyllowe: Greg Orman worth between $20-$86 million, filing shows. http://t.co/q0omHMmTAZ  #kssen @kcur RT @mollyesque: I went to Kansas to see what this Greg Orman character is all about http://t.co/i0qEEVrSbq Greg Orman's net worth would place him among wealthiest senators if elected: http://t.co/KVN0HY1S32 RT @jonathanweisman: Wait, if Greg Orman, Tom Cotton &amp; Ben Sasse win, there will be 3 McKinsey connections in Senate (Sasse is adjacent) ht RT @lachlan: Greg Orman is trying to keep up a nonpartisan image, but he's getting assists from national and KS Dems http://t.co/gPZ9xksbQd UPDATE: Sarah Palin says Greg Orman trying to 'snooker' Kansas voters http://t.co/Cp6tNN3CQB #palin #teaparty RT @mjbeckel: Independent Greg Orman lures left-leaning donors in #KSSEN despite uncertainty about whether he'll caucus with Dems http://t. POLITICO REPORTING TEA PARTY'S MILTON WOLF TO ENDORSE GREG ORMAN FOR US SENATE IN KANSAS OVER PAT ROBERTS... http://t.co/k532UQRGy8 RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @HarrierCat: @delong @PhilipRucker @daveweigel Roberts &amp; constituents are old west KS farmers &amp; retired. Most KS pop is east &amp; suburban, RT @UpshotNYT: Greg Orman has a real path to victory in Kansas after last night's court decision. This isn't Kentucky. http://t.co/7utVyt5H What Exactly Are Dems Getting With Kansas Independent Greg Orman?: Whether they'll admit it or... http://t.co/WYCC5o2mqQ #politics #news RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @CabPolitical: Prediction Map moves to Dems 46 (w/2 Indys who caucus w/them) - GOP 48 - Remaining are Toss-Ups or Orman(I) in KS http:// RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic Sources: Wolf weighs Orman nod http://t.co/9IvDyFGsw1 RT @LeonoraInterssa: Sources: Wolf weighs Orman endorsement  via @josephjett #politics http://t.co/p3t8FiyEKO Why You Should Hope Greg Orman Wins http://t.co/DTzeHbSM6P - Balkinization RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http Greg Orman's net worth isn't a story only because he's not a rich Republican. He's just a wealthy "Independent". RT @TeaPartyNevada: UPDATE: Sarah Palin says Greg Orman trying to "snooker" Kansas voters in Senate race vs Pat Roberts http://t.co/UeDePO2 RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @Vision4USA: RT Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http:/ RT @EMC_Square2: With a two-man Kansas Senate race looking certain, GOPs are planning to frame Greg Orman as a shady businessman http://t.c BREAKING: Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... ... http://t.co/K0jxQIWQfj #Khaatumo #Khatumo RT @LPDonovan: Greg Orman's new DSCC handlers scrub Veoh account, try to whitewash his liberal, Nickelback-loving past #neverforget http:// RT @peggyllowe: Orman and Wolf meeting is off, apparently, and Wolf won't endorse Sen. Roberts' opponent. http://t.co/YUOVpqTeS2 #kssen RT @OldHydePark: N8 Silvr has Greg Orman favord 2 win #Kansas sen8 seat  #chance #NateSilver RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  An ad attacking Kansas Senate candidate Greg Orman highlights his past support for the nationa... http://t.co/ubG2FjxA9y via @Freebeacon Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO) http://t.co/7toAxzH4De RT @GEGOPS: Even MSNBC is calling Greg Orman a Democrat. https://t.co/LTfcLPSWpx #kssen #ksleg Vote Pat Roberts. #kansas Milton Wolf may endorse Kansas independent Greg Orman, if Orman caucus with the Senate GOP http://t.co/CEZiDFAbEh RT @PhilipRucker: Pat Roberts, Palin at his side, is feisty and energetic, ripping into Orman: "He is NOT an independent." #kssen RT @nrlc #KSSen: Greg Orman would be one more pro-abortion, anti-life Democrat http://t.co/zdPd8NeBfv  #prolife RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to both Harry Reid and Barack Obama. He will caucus with Dems. 
 "A vote for Greg Orman is a vote for @BarackObama" - Great new ad from Freedom Partners #KSsen https://t.co/NigPvV49Fc RT @jameshohmann: The Orman-Wolf meeting was canceled after @politico reported it was happening. Update by @mkraju &amp; @politicoalex: http:// Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO http://t.co/VyzqldOGxx #palin #teaparty RT @OldHydePark: #DemocraticSen #Going #PublicWorksCommittee If Greg Orman should win in #Kansas, he ... http://t.co/tbgIBykYjB RT @Vision4USA: RT: Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http: UPDATE: Sarah Palin says Greg Orman trying to 'snooker' Kansas voters http://t.co/FmXJ2YSiq0 #palin #teaparty Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO http://t.co/KG63Bvxjrp #palin #teaparty OH, PLEASE DONT:  Sources: Milton Wolf weighs Greg Orman endorsement.  I can understand a grudge af http://t.co/RkY8R5zX5Q Orman-Wolf meeting canceled http://t.co/UMdqjPuYuX #Politics #News Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? - Hot Air http://t.co/Jmk987l2d9 A win by Greg Orman in Kansas senate race would give him some leverage in Washington. http://t.co/spr61MzUVr RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @BryanLowry3: Greg Orman discloses personal finances, millions in real estate investments http://t.co/8urfqSrHIP #ksleg #kseln #kssen Orman-Wolf meeting canceled http://t.co/62Orwas5Yu http://t.co/uk51vgW97t RT @SarahPalinLinks: Greg Orman contributed $4,600 to Barack Obama.  He contributed $9,400 to the Kansas Democrat Party.  Twitter won't let RT @michaelpfalcone: Bob Dole calls Greg Orman "a Democrat masquerading as an Independent" in intvu w/ @alex_mallin http://t.co/r6NqC9lK4E OH FOR FUCKS SAKE RT @EdB_Ohio: @RBPundit At least she's in Roberts' (KS) corner. Look what's happening there. http://t.co/cxoOtDdkWb What Exactly Are Dems Getting With Kansas Independent Greg Orman? @TPM http://t.co/cfMImX85nP Nate Silver has Orman favored to win KS Senate seat http://t.co/zdycKpehkY #kssen RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C Kansas would be nuts to not vote for Independent #Orman they can wind up with the most powerful Senator in Washington. RT @mjbeckel: Among indy Greg Orman's campaign donors? A lawyer &amp; former Obama bundler who has represented @LadyGaga &amp; @U2 http://t.co/EWly Is Pat Roberts conservative primary challenger in Kansas going to back GregOrman? http://t.co/cjNjxoJUKn RT @FollowPalin: Sarah Palin says Greg Orman trying to 'snooker' Kansas voters - http://t.co/RNSEUyvXAP http://t.co/qw98LuAGAT #palin #tea RT @jameshohmann: The Orman-Wolf meeting was canceled after @politico reported it was happening. Update by @mkraju &amp; @politicoalex: http:// Greg Orman: Staffed by Democrats, funded by Democrats, has donated to Democrats, is the de facto Democrat. http://t.co/NFoCy7Y9KL #KSSen Orman must come clean about ties to felons, investments in Cayman Islands &amp; Middle East &amp; positions on issues b4 Nov https://t.co/BF6SuMzAy6 RT @bjs5555: In #KS, for strategic reasons, our (D) candidate dropped out of the Senate race to BACK Ind Greg Orman to beat Tea Sen Roberts RT @Cam_RollCall: RT @rollcall: #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/g0zk831Mot GCSN presents Challenge Coin from Gen. David Petraeus to BHS NJROTC Unit in honor of Greg Orman's father, a WWII Vet. http://t.co/Eh343OVYv9 RT @EMC_Square2: With a two-man Kansas Senate race looking certain, GOPs are planning to frame Greg Orman as a shady businessman http://t.c RT @willrahn: Greg Orman, the Indy who may take out Pat Roberts in Kansas, is a fan of both Coldplay and Nickleback https://t.co/4HIG046hM2 If independent candidate Greg Orman wins in #Kansas, he could determine the balance of power in the U.S. Senate http://t.co/PHKJOG47Bd RT @nrlc: We stand with @PatRoberts2014 in the #KSSen race! Greg Orman would be another pro-abortion vote for Obama and Reid: http://t.co/m Orman? v Roberts? I think there is sneaky Dem politics occurring here with Orman! &gt; Kansas May Decide Senate Control http://t.co/83MfMge7uO Not Pat Roberts, which is kind of the entire point. RT @TPM What exactly are Democrats getting with Kansas independent Greg Orman? #kssen i hope this isn't true... http://t.co/Uv0O7V00Fy #kssen RT @nrlc: We stand with @PatRoberts2014 in the #KSSen race! Greg Orman would be another pro-abortion vote for Obama and Reid: http://t.co/m Milton Wolf, the TP who battled Pat Roberts in bitter GOP primary, considers political payback: Endorse Greg Orman http://t.co/Z14guc5orO Will Dems go all-out to beat Sen. Pat Roberts now? http://t.co/ItPztmgb1F via @POLITICO RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Will Dems go all-out to beat Sen. Pat Roberts now? http://t.co/rJE0bhQRqE via @POLITICO RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http Greg Orman discloses assets, investments worth millions http://t.co/2EQgdNNvrD #kssen #kseln #ksvote http://t.co/g5NAG56GKZ Sources: Wolf weighs Orman endorsement: The tea party candidate is considering some political payback by endor... http://t.co/51w58FKuZB Suck on this GOP Establishment. Only problem is, you know Orman will welsh: http://t.co/taloreHSbM RT @kansansforlife: Kansas Gov. Brownback &amp; Sen. Roberts are pro-life. Opponents Paul Davis &amp; Greg Orman are not. http://t.co/6ElOyfDDcP #p RT @mkraju: #KSSEN news: Milton Wolf may endorse Orman if he caucuses with GOP; two will meet Friday. w/@politicoalex. http://t.co/E69qTdZR Greg Orman sounds like Democrat to me. 
GOP heavyweights flock to Kansas to boost Roberts after race shakeup |  http://t.co/C8m4lYh3ky RT @mundyspeaks: Kansas Ballots Will Be Mailed Without Democratic Senate Nominee http://t.co/HFF8WMzz7U via @rollcall ICYMI: overseas ballots for #kssen race to be mailed without Democratic nominee http://t.co/J3OVtjW5qx RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C RT @lheal: Dear #KSSen: Greg Orman is a liberal Democrat. He is not a conservative in any way. He will vote for Harry Reid as Majority Lead Sources: Wolf weighs Orman nod via @POLITICO for iOS http://t.co/nl2aGxElTS RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @Vision4USA: RT: Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http: RT @jeffzeleny: FF @ABC's @alex_mallin for @KSSEN: Bob Dole on Greg Orman: "The guy is a Democrat masquerading as an Independent." http://t Greg Orman can run from his Dem past all he wants, but Kansans won't forget his pro-Nickelback Senate platform in '08 http://t.co/xFHHUhpnda RT @ivn: Politics is not something that was intended to take over your life..." - @OrmanForSenate http://t.co/2mobdxAl7a RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t Sources: Milton Wolf Would Endorse Greg Orman if He Caucuses with GOP http://t.co/8Pwnwll9tc RT @bloggingheads: The Senate kingmaker? @billscher &amp; @mattklewis on the potential power wielded by independent KS candidate Greg Orman. ht RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @CentProj: Greg Orman is "the most interesting man in politics." Help spread the word about this campaign! #kssen #CenterStands http://t RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t High stakes in Kansas: SHAWNEE, Kan. --Tacked to the wall of Greg Orman's campaign office is a print of a John... http://t.co/pspB1qh53u RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/8B5qZKlCPT RT @blakehounshell: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts http://t.co/1N2yTcfczq RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http Report: Kansas Senate candidate's ties to convicted investor run deep: Candidate Greg Orman represented Rajat ... http://t.co/Nlndk4d2rn RT @JimmyPrinceton: Wolf needs to fall in line, now. RT @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/HKs If elected, Greg Orman of Kansas would be among richest U.S. senators http://t.co/dP9WqbwgcF RT @Vision4USA: RT Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http:/ Greg Orman Epic Douche Bag http://t.co/1aRRERlhWB #kc #joco @joec_esquire Though should also say that Greg Orman isn't guaranteed to caucus with Democrats. If the GOP wins a strong majority while... OH, PLEASE DONT:  Sources: Milton Wolf weighs Greg Orman endorsement.  I can understand a grudge af http://t.co/tiGLvCYi8a RT @baseballcrank: Milton Wolf mulls going full Dick Lugar. Never go full Dick Lugar. http://t.co/OEfdh8vysC #ProLife RT @nrlc: Clear contrast between @PatRoberts2014 and Greg Orman in the #KSSen race! #WeVoteProLife http://t.co/9o2GGS3yzr RT @rubycramer: in an interview on the @CBSEveningNews, Greg Orman (@OrmanForSenate) says he'd caucus with whichever party has the majority How much of the millions Greg Orman is spending on his campaign can be tied to shared investments &amp; work with imprisoned Gupta? #kssen Kansas takes center stage http://t.co/3O6FVw0K3m RT @WannabeAnglican: I have the feeling Greg Orman is a big #BaitAndSwitch - a Democrat in "independent" clothing. Why else are Democrats s Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star #investments Kansas Senate candidate Greg Orman discloses assets, investments worth ... - Bellingham Herald http://t.co/G3aacWawyy Kansas takes center stage http://t.co/U5bbvbkptv Pat Roberts / Greg Orman Debate, Hutchinson KS Part 1: http://t.co/uYe2agkDo7 via @YouTube Election*Projection on Greg Orman and the Kansas US Senate Racehttp://t.co/lmoQ5Tra8j RT @willrahn: Greg Orman, the Indy who may take out Pat Roberts in Kansas, is a fan of both Coldplay and Nickleback https://t.co/4HIG046hM2 RT @rollcall: #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/Gbh9u719Um #alert Greg Orman closer linked to convicted felon - http://t.co/hufPYt0fv1 RT @Cam_RollCall: RT @rollcall: #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/g0zk831Mot RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @WPNMS: Staking the Senate on Kansas? - SHAWNEE, Kan. Tacked to the wall of Greg Ormans campaign office is a print of a J... http://t.c @OrmanForSenate wish you were running here MO! Want a Greg Orman for Senate t-shirt lol I really hope you win RT @KansasGOP: Media Release:  KS Sen Candidate Greg Orman's Staff Reveals His Liberal Agenda #ksgop http://t.co/C2oOiiYtD8 Orman and Wolf meeting is off, apparently, and Wolf won't endorse Sen. Roberts' opponent. http://t.co/YUOVpqTeS2 #kssen RT @YaelTAbouhalkah: Milton Wolf criticizes Kansas GOP for attacking Greg Orman on behalf of Pat Roberts. http://t.co/5F7JExp0ns Greg Orman is really rich: With Democrat Chad Taylor's name now off the ballot, independent candidate Greg Orman,... http://t.co/8mKNXhw2pL RT @BDayspring: Peeling back the curtain: Democrat Greg Orman's ties to convicted investor run deep http://t.co/ijzYNmeP7d #KSsen RT @wbdamron: Wow. George Will on Fox News All-Star discussion just said KS Senate race is "Orman's to lose."  #kssen Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to ind... http://t.co/sCMROdEUUw Sources: Wolf weighs Orman endorsement: The tea party candidate is considering some politic... http://t.co/hOsuvGSAaM #tcot #ccot #pjnet Kan. Senate hopeful Greg Orman could be the newest multimillionaire in Congress (via @KCBizJournal) http://t.co/gFIkBmp7p4 RT @kasie: On the road in Kansas, it's clear Pat Roberts could lose. Our in-depth look at his uphill battle http://t.co/iJMyvh3bMQ w @bendm #News: Orman-Wolf meeting canceled: An insider says Wolf won't support Orman. http://t.co/EwUOSChpUU via .@TheNewsHype UNION/LABOR NEWS: "In Kansas, Roberts fights for his seat  and the Senate" http://t.co/oAjlkK8U8k #msnbcdiscuss Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? http://t.co/zu9yCiihZg Pat Roberts releases Greg Orman court documents: http://t.co/KD1kXg4vII Independent Senate Hopeful Shown Little Love http://t.co/0uILaAbMPo John McCain joins Pat Roberts in #Kansas 2 say independent Sen8 candid8 Greg Orman looks lk a Democrat  #Congress #control #race RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http To get elected in November, Democrats are running Independents like in Kansas. 

Greg Orman is a Democrat. Don't let them fool you! #kssen RT @dylanlscott: Wanna know why Greg Orman doesn't need party support? He's worth more than $21 million: http://t.co/53NGBmrG9O #KSSen RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http George Will on Greg Orman #kssen http://t.co/Ng1znJ6N2T RT @Politics1com: KS USSEN (Rasmussen): Greg Orman (I) 45%, Pat Roberts (R) 40%. With a two-man Kansas Senate race looking certain, GOPs are planning to frame Greg Orman as a shady businessman http://t.co/8id7HEqXA7 You know, all Greg Orman has to do at this point is say "is that what you want in Washington?" And point at Roberts or the Democrats. RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre @ThePlumLineGS @StevenTDennis Orman can say he stands w/KS on raising min wage, univ. background checks &amp; strengthening SS &amp; Medicare RT @Publici: U.S. Senate Candidate Greg Orman of Kansas has pledged to be an independent [who] wont answer to either party.  http://t.co Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas ... - http://t.co/tDbQkBGaMf RT @rubycramer: in an interview on the @CBSEveningNews, Greg Orman (@OrmanForSenate) says he'd caucus with whichever party has the majority RT @PatRoberts2014: Senator Bob Dole on Greg Orman to ABC News: "The guy is a Democrat masquerading as an Independent" #kssen RT @nrlc: We stand with @PatRoberts2014 in the #KSSen race! Greg Orman would be another pro-abortion vote for Obama and Reid: http://t.co/m RT @GEGOPS: Even MSNBC is calling Greg Orman a Democrat. https://t.co/LTfcLPSWpx #kssen #ksleg Vote Pat Roberts. #kansas Meet Greg Orman, the Most Interesting Man in Politics http://t.co/s0zpzI2BiQ #KSSen: Greg Orman would be one more pro-abortion, anti-life Democrat http://t.co/y0S2knYslm #prolife http://t.co/w0GIYhCUdw @JohnAltevogt @OrmanForSenate #kssen Just so we're clear, Tom Davis has nothing to do with Greg Orman. But the principle is the same. 1/2 @PatrickRuffini Greg Orman is using a bunch of it. His ad came up on 3 of my apps. Koch Brothers Tag Kansas Indy Senate Candidate As Closet Dem http://t.co/tZEbsoIIZp Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? - Hot Air http://t.co/ogkhVg0PPv RT @Croatansound: #Kansas Greg Orman calls himself a (I) but takes $ from #Dems which in my book makes him a (D): #KSsen #Wichita #TCOT htt RT @ThePlumLineGS: If Greg Orman wins and caucuses with Ds, Ds can hold Senate by winning in NC and holding *either* in Alaska *or* in Iowa. RT @BLPrime: Googled a GOP Senator to confirm campaign website. First result? Greg Orman for Senate. One of these things is not like the ot RT @stevekraske: Turns out that KS Sen. @JerryMoran also has a lot riding on the Roberts-Orman race: http://t.co/nkP9WeCDDp case will decide if DEMOCRATS in Kansas MUST put a name on the ballot, or if it's just Pat Roberts VS. Greg Orman for the "big two" RT @KStatePatriot: Remember, Greg Orman is "Independent". cc @APjdhanna @ajjaffe @raginkansan @stevekraske
http://t.co/vCrUt9SDFM #kssen ht More on Greg Orman's financial disclosure report: http://t.co/r9E2upVwpD #kssen #kseln #ksleg Kansas Supreme Court ruling is a victory for Greg Orman and a defeat for Pat Roberts http://t.co/YbjO6FB49b RT @bloggingheads: The Senate kingmaker? @billscher &amp; @mattklewis on the potential power wielded by independent KS candidate Greg Orman. ht Kansas Supreme Court ruling is a victory for Greg Orman and a defeat for Pat Roberts http://t.co/Hhi30OxOli #Libusters https://t.co/KJY4GuPzst Kansas Ballots Will be Mailed Without Democratic Senate Nominee... http://t.co/CVGyT1ZxLY politico reporting tea party's milton wolf to endorse greg orman for us senate in kansas over http://t.co/DE6RmIerb3 http://t.co/uk51vgW97t RT @Taniel: The tough math: If Democrats lose Pryor and Begich, as PPP suggests they will, they pretty much need Greg Orman to get to 50 se I like Kansas Senate candidate Greg Orman because he's a Mark Ruffalo character. http://t.co/579fgVlLm9 Is Pat Roberts conservative primary challenger in Kansas going to back GregOrman? http://t.co/Jt0jUqDDhs RT @TheFix: RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endor NEWSFLASH!!! RICH WHITE GUY RUNNING FOR CONGRESS!!!: And so . . . RICH GUY GREG ORMAN IS YET ANOTHER ASPIRING ... http://t.co/GO3uUcxBw3 Independent Senate Candidate Draws Scant Democratic Support http://t.co/WmR23hnYOe #wheres ? RT @LaCivitaC: Another day another missing senate candidate and yet no one in the media asks..#wheres Greg orman? #kssen RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http Open Questions For Kansas Senate Candidate Greg Orman https://t.co/XRBxub4Jba RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @ForecasterEnten: If Orman said he caucuses with the GOP, then this gets one step closer to looking like CT 06 http://t.co/Fvsuenta4W (h RT @JessicaTaylor: .@mollyesque has a great look at who Greg Orman is and why he just might win #KSSen  http://t.co/7lf4ADStKt @JosephAshbyShow looks like kansans like the sheep in wolves clothing...greg orman. Kansas Senate Candidate Greg Orman Would be Just Another Pro-Abortion Democrat http://t.co/a8lQmZHSDP via @StevenErtelt RT @bjs5555: In #KS, for strategic reasons, our (D) candidate dropped out of the Senate race to BACK Ind Greg Orman to beat Tea Sen Roberts RT @PatRoberts2014: How much of the millions Greg Orman is spending on his campaign can be tied to shared investments &amp; work with imprisone RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @MichaelLaRosaDC: Kansas Ballots Will be Mailed Without Democratic Senate Nominee http://t.co/LelNutab3N via @rollcall #KSSEN RT @GOP: Greg Orman: Staffed by Democrats, funded by Democrats, has donated to Democrats, is the de facto Democrat. http://t.co/NFoCy7Y9KL  Greg Orman's (@OrmanForSenate) net worth would place him among wealthiest senators if elected via @KCStar http://t.co/EU71xVJxpY #kssen RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @LPDonovan: Greg Orman's new DSCC handlers scrub Veoh account, try to whitewash his liberal, Nickelback-loving past #neverforget http:// RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr #ModiMinistry Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? http://t.co/wD9g12heXi Greg Orman: Pat Roberts "not representing" Kansas interests: Greg Orman, an independent Senate candidate from ... http://t.co/YfOzffsKOO Greg Orman can say he would not vote for Harry Reid, but he would. The only reason he would not is if everyone else were not. Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Franken 
Impostor. Pat Roberts TV ad slams Greg Orman as a pretender (Video) #KSSen http://t.co/kDNygAMPZg Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman?: Kingmaker. 
The Republica... http://t.co/pi4OXhAJNl RT @JoLissa13: KS: "Freedom Partners" Group: Greg Orman Is A Vote For Obama http://t.co/SnJIuPHofV #KSSen #tcot Independent Senate Candidate Shown Little Love http://t.co/WrBFDs9Ahy Sources: Wolf weighs Orman endorsement http://t.co/m1YT2TUfiu RT @BDayspring: Peeling back the curtain: Democrat Greg Orman's ties to convicted investor run deep http://t.co/ijzYNmeP7d #KSsen RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre RT @CentProj: @OrmanForSenate "The most interesting man in politics" Spread the word about this campaign #kssen #CenterStands http://t.co/C RT @Taniel: The tough math: If Democrats lose Pryor and Begich, as PPP suggests they will, they pretty much need Greg Orman to get to 50 se RT @GOP: Greg Orman: Staffed by Democrats, funded by Democrats, has donated to Democrats, is the de facto Democrat. http://t.co/NFoCy7Y9KL  .@BDayspring @mikephillips1 @DSCC @guycecil 

Democrat, "Independent" Greg Orman. #kssen RT @BDayspring: In #KSsen Chad Taylor's lawyer was top DSCC lawyer. Greg Orman's spox a fmr top staffer to DSCC Chairman. Notice a trend? RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t Koch brothers tag Kansas independent Senate candidate as closet Democrat http://t.co/1V8DqQWOly #KSSen http://t.co/ux2f0liCcB Greg Orman, painfully above the fold in Kansas capital paper. Meanwhile, Roberts hasnt polled over 42 since primary http://t.co/FUYLR8kAfT RT @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/lt0J1KSiEC Documents add layer to bond of U.S. Senate candidate, felon | http://t.co/rjiUuAAqyD http://t.co/3rgiXcaW0V  Greg Orman - 'YOU"RE GONE'. RT @BDayspring: In #KSsen Chad Taylor's lawyer was top DSCC lawyer. Greg Orman's spox a fmr top staffer to DSCC Chairman. Notice a trend? Greg Orman: 5 Fast Facts You Need to Know - http://t.co/fmUJMppEPw http://t.co/yrd5Hh8JWi #wethepeople John McCain campaigns with Pat Roberts, says Greg Orman looks like a Democrat http://t.co/XNJ0bepzfP "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems. Don't be fooled! 
#KSsen RT @CBSNews: Independent in Kansas race for U.S. Senate appears to have decent shot at winning http://t.co/sssk0xv5D0 http://t.co/n11WLkwruf RT @BDayspring: Liberal Greg Orman Gets Backing from Dem Super PAC  http://t.co/ocIsbdqrvZ #KSsen @kcjas As an independent, I'm heavily on the Greg Orman bandwagon. Sources: Wolf weighs Orman endorsement http://t.co/ZjV3sjpxsf @OrmanForSenate Greg Orman, pro-war, anti-gun, anti-free speech, pro-government run healthcare, pro-corporate welfare... no thanks. Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO http://t.co/6AasqdOI8J #palin #teaparty RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t New poll shows growing momentum - and a lead - for @OrmanforSenate: http://t.co/6ldIpFaLj4 RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  "Kansans, who like limited government for other people, were startled when Mr Roberts voted against a farm bill" http://t.co/w7RlIaUorJ Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star http://t.co/9e0fsRl1Sx #YMDLU RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @KStatePatriot: #Bombshell - Washington Post writes: "Greg Orman hiring of former @DSCC hand highlights personnel predicament" 

#Kssen @MikeZooLoo @PatRoberts2014 @OrmanForSenate Where'd he lie? http://t.co/7tdQZLDjq6 And only VISITING "your state" 7 times in a year matters RT @bktx24051: Meet Greg Orman; running as an Independent in Kansas. Wolf in sheep's clothing. 
http://t.co/vng0MF2ZSz RT @JoLissa13: Greg Orman maintains professional ties with ex-Goldman Sachs board member convicted of securities fraud http://t.co/FrbWkDY2 RT @BDayspring: Peeling back the curtain: Democrat Greg Orman's ties to convicted investor run deep http://t.co/ijzYNmeP7d #KSsen RT @bjs5555: In #KS, for strategic reasons, our (D) candidate dropped out of the Senate race to BACK Ind Greg Orman to beat Tea Sen Roberts Orman's link to jailed investor deeper than portrayed: U.S. Senate front-runner Greg Orman plans to make public... http://t.co/UgMcgO1DHr RT @RussOnPolitics: Senator Pat Roberts' vanquished GOP primary opponent may endorse Greg Orman...but there's strings attached. http://t.co Greg Orman: 5 Fast Facts You Need to Know - http://t.co/fmUJMppEPw http://t.co/YZZIyltrD3 #wethepeople Meet Greg Orman, the Most Interesting Man in Politics http://t.co/R4nYfRMwJX RT @BDayspring: Liberal Greg Orman Gets Backing from Dem Super PAC  http://t.co/Zhe4g7PGQ8 #KSsen Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not Bob Dole" #kssen RT @alwaysonoffense: i hope this isn't true... http://t.co/Uv0O7V00Fy #kssen RT @politico: Orman-Wolf meeting canceled: http://t.co/busOLLvIfB #KSSen RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems.  Don't be  Greg Orman, centrist Senate candidate in Kansas, is "the most interesting man in politics."

http://t.co/WB8PNrxBlx RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not Sources: Wolf weighs Orman nod - The tea party candidate is considering some political payback by endorsing the Ka... http://t.co/QFZOoLGXbU RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not Sources: Wolf weighs Orman endorsement: The tea party candidate is considering some political payback by endor... http://t.co/rgJ9WKtv8y Greg Orman never says what his ideas are. Why? Because he is an Obama liberal trying too disguise himself as an independent. "Whether they'll admit it or not, Democrats have put all their eggs in Greg Orman's basket."

http://t.co/r3wZ0BTQoB #kssen RT @Epricity2: Senate candidate Greg Orman's business, political interests run wide - Kansas City Star http://t.co/vP7tildubV RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  "A vote for Greg Orman is a vote for @BarackObama" https://t.co/jtGrZEaAJP #kssen RT @lachlan: Pat Roberts' failed tea party challenger may endorse Greg Orman if he agrees to caucus with the GOP http://t.co/b72MdaZE0k RT @dhellingkc: Greg Orman claims assets worth between $21.53 million and $85.96 million in first disclosure; annual income btwn $917,290 a RT @dhellingkc: If elected, Greg Orman of Kansas would be among richest U.S. senators http://t.co/nrGGK4T0Iu RT @dylanlscott: Wanna know why Greg Orman doesn't need party support? He's worth more than $21 million: http://t.co/53NGBmrG9O #KSSen RT @LeonoraInterssa: WOLF COULD BACK ORMAN IN KANSAS SENATE RACE  HAGANS HUSBAND TOOK IN STIMULUS MONEY  via @josephjett #politics http: RT @lfletch: @CharlesMunn1  And for very good reason.  Roberts is a has-been.  Greg Orman is a passionate Independent that Kansas &amp; America Sarah Palin says Greg Orman trying to 'snooker' Kansas voters - http://t.co/RNSEUyvXAP http://t.co/9nEsZOamc2 #palin #teaparty RT @LaCivitaC: Greg Orman, call your office:   http://t.co/1r3XTl8Kn7 RT @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/eeXAyD4qwv RT @KStatePatriot: Remember, Greg Orman is "Independent". cc @APjdhanna @ajjaffe @raginkansan @stevekraske
http://t.co/vCrUt9SDFM #kssen ht Pat Roberts releases Greg Orman court documents http://t.co/Pz8PDHqcdk RT @rubycramer: in an interview on the @CBSEveningNews, Greg Orman (@OrmanForSenate) says he'd caucus with whichever party has the majority @s_geist: @KCStar: If elected, Greg Orman of Kansas would be among richest U.S. senators: http://t.co/2Q838sdFrR guys vote for Greg In #KS, for strategic reasons, our (D) candidate dropped out of the Senate race to BACK Ind Greg Orman to beat Tea Sen Roberts. VOTE Orman! If elected, which party would Greg Orman choose? http://t.co/Fg1SmSM17c @UniteBlueKS @dscc @OrmanForSenate http://t.co/URxvE13628 RT @lachlan: Greg Orman is trying to keep up a nonpartisan image, but he's getting assists from national and KS Dems http://t.co/gPZ9xksbQd RT @lheal: Every Democrat Senate candidate (including Greg Orman, Democrat from Kansas) would vote for Harry Reid as Senate Majority Leader. RT @wbdamron: Wow. George Will on Fox News All-Star discussion just said KS Senate race is "Orman's to lose."  #kssen RT @mikememoli: Palin, in Independence, KS, says Greg Orman isn't truly independent. He's "trying to schnooker you, Kansas." RT @blakehounshell: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts http://t.co/1N2yTcfczq Greg Orman wants to deny Pat Roberts a fourth Senate term, thereby ending a congressional career that began in 1981 http://t.co/0iqV41WBAl Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO http://t.co/SBuXMkryuw #palin #teaparty RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Max Ascari WOLF COULD BACK ORMAN IN KANSAS SENATE RACE  HAGANS HUSBAND TOOK IN STIMULUS MONEY  ... http://t.co/k5fBN3Jrp3 RT @BDayspring: Peeling back the curtain: Democrat Greg Orman's ties to convicted investor run deep http://t.co/ijzYNmeP7d #KSsen RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C Sources: Wolf weighs Orman endorsement http://t.co/Do2txI3ou1 #Politics #News RT @wbdamron: Wow. George Will on Fox News All-Star discussion just said KS Senate race is "Orman's to lose."  #kssen RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr Big swing on Greg Orman in the Kansas election, guess bettors liked the SC ruling on no Dem on ballot RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. Greg Orman: Pat Roberts "not representing" Kansas interests: Greg Orman, an independent Senate candidate from ...  http://t.co/ER7KUsDx1u Pat Roberts / Greg Orman Debate, Hutchinson KS Part 3: http://t.co/Pz6L7P7ak2 via @YouTube RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t Greg Ormans net worth would place him among wealthiest senators if elected http://t.co/RgfMjJYYTJ RT @nrlc: We stand with @PatRoberts2014 in the #KSSen race! Greg Orman would be another pro-abortion vote for Obama and Reid: http://t.co/m @KCStar: If elected, Greg Orman of Kansas would be among richest U.S. senators: http://t.co/DczVUyk0NU RT @stevethomma: Kansas now a 3-way: GOP Sen. Pat Roberts, independent Greg Orman, and Libertarian Randall Batson. RT @dhellingkc: Greg Orman claims assets worth between $21.53 million and $85.96 million in first disclosure; annual income btwn $917,290 a RT @politico: "There is no consideration of a Wolf endorsement for Orman," one source said. http://t.co/TnGvsS83Mx "Sarah Palin says Greg Orman trying to 'snooker' Kansas voters http://t.co/tBYJKkIfOb" Why is Tina Fey in a @KState shirt?! #patriot RT @amyewalter: Greg Orman been on msg for a while. At Princeton ('91) he quotes Ross Perot, didn't join eating club, college GOPer http:// RT @HouseCracka: Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSA @StoneColdChik millionaire greg orman is running for independent in KS, of course the dems don't really want him in there because of Sources: Milton Wolf would endorse Greg Orman if he joins GOP - http://t.co/Z78vaM8up3 http://t.co/FsxeJBT5pL Because @RNC can't inspire: Is Pat Roberts conservative primary challenger in KS going to back Greg Orman?  http://t.co/pvYonwODfO Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to independent and it running... RT @Vision4USA: RT: Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http: RT @politico: Milton Wolf may endorse Kansas independent Greg Orman, if Orman caucus with the Senate GOP http://t.co/CEZiDFAbEh RT @cynthia4877: GOP desperately trying 2 save KS Senate seat. Polls show Independent Greg Orman leading GOP Pat Roberts.

http://t.co/iUq RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr RT @HouseCracka: Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSA RT @rubycramer: in an interview on the @CBSEveningNews, Greg Orman (@OrmanForSenate) says he'd caucus with whichever party has the majority Starting to think #Kansas tourism industry is funding Orman campaign. Reporters traveling to KS from all over to cover contested races. RT @nrlc #KSSen: Greg Orman would be one more pro-abortion, anti-life Democrat http://t.co/8Jqe7NmW6i  #prolife RT @MikeLoBurgio: If Greg Orman should win in Kansas, he would hold leverage in Washington http://t.co/l5AsL5I5BD @OrmanForSenate #p2 http: What Exactly Are Dems Getting With Kansas Independent Greg Orman? http://t.co/2k6fte1zdi We DO in the KANSAS Senate Election WANT to VOTE for the Independent Greg Orman @OrmanForSenate to Defeat GOP/TEA Senator Pat Roberts! RT @msanchezcolumn: Attack ads miss the point about U.S. Senate candidate Greg Orman http://t.co/V216oT6Fyv RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Kansas Senate race overseas ballots will list Repub and Indie candidates only, possibly harming Repub incumbent. http://t.co/6eJkhKCix5 RT @kjon: "A vote for Greg Orman is a vote for @BarackObama" - Great new ad from Freedom Partners #KSsen https://t.co/NigPvV49Fc Milton Wolf criticizes Kansas GOP for attacking Greg Orman on behalf of Pat Roberts. http://t.co/5F7JExp0ns RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/jFRrJ7hMIl Orman would be among wealthiest senators, financial disclosure shows: Greg Orman, the political independent ch... http://t.co/pD5HYYeEqo Kansas Ballots Will Be Mailed Without Democratic Senate Nominee http://t.co/HFF8WMzz7U via @rollcall RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @ivn: Politics is not something that was intended to take over your life..." - @OrmanForSenate http://t.co/2mobdxAl7a If he wins, who will Greg Orman caucus with? http://t.co/cilK08QtJs Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... http://t.co/1CBiDzBj70 RT @rollcall: #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/g0zk831Mot Independent Candidate Alarms Republicans: Greg Orman http://t.co/QzKeLUzpHS #ArmedCitizens #2A #DTOM The official GOP message against Greg Orman: He's a closet Democrat. http://t.co/GkjBgvCFj7 #KSSen RT @ivn: "96% of Kansans say politicians should support good ideas, not just partisan ideas." http://t.co/8UeVCzXlWZ Pat Roberts and Greg Orman see several issues differently in the U.S. Senate   Kansas CityStar http://t.co/Qx9rGEPjnI Yeah, so maybe Greg Orman isn't a "true independent," (??) but @SenPatRoberts sure as hell isn't even a fake independent. RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C #BreakingNews OH, PLEASE DONT:  Sources: Milton Wolf weighs Greg Orman endorsement.  I can u... http://t.co/YyxLwE9oii Via @Instapundit What Exactly Are Dems Getting With Kansas Independent Greg Orman? http://t.co/E5IdyHplYV Sources: Milton Wolf Would Endorse Greg Orman if He Caucuses with GOP http://t.co/hd6rqlIEaP BOOM---&gt; "Im Bob Dole, and I can tell you that Greg Orman is not Bob Dole."  #kssen #ksleg  http://t.co/UROfwsQQvD RT @WaPoSean: "Dr. Wolf is not meeting with Greg Orman and there is no consideration of a Wolf endorsement." http://t.co/fHG9dB03AZ Sources: Wolf weighs Orman endorsement http://t.co/shf4yQSm1l #congress #tcot RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/jFRrJ7hMIl 3 bank shot.  "@NormanDeArmond: Sarah Palin says Greg Orman trying to snooker Kansas voters http://t.co/zcHJrV5v8j" Milton Wolf would endorse pro-abortion liberal like Orman as long as he caucuses w/ GOP. Because principles? http://t.co/KdWzMUbhdL #kssen RT @politico: Orman-Wolf meeting canceled: http://t.co/busOLLvIfB #KSSen Wolf weighs Orman nod  http://t.co/6tuNqos0VW RT @HouseCracka: Kansas you are being hoodwinked. Greg Orman gave money to Harry Reid too. Greg Orman is a Donkey in masquerade. http://t.c RT @moelane: #rsrh Democrats putting down down payment on Greg Orman in Kansas-SEN race.: http://t.co/w0aZE0JFyl RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic RT @kansansforlife: Kansas Gov. Brownback &amp; Sen. Roberts are pro-life. Opponents Paul Davis &amp; Greg Orman are not. http://t.co/6ElOyfDDcP #p Pat Roberts &amp; Greg Orman c several issues differently in the US Sen8 race in #Kansas  #gun #RepublicanParty RT @KCStar: Pat Roberts releases Greg Orman court documents: http://t.co/KD1kXg4vII RT @DUhockeyFan: MT @mikememoli: @SarahPalinUSA in Independence, KS, says Greg Orman isn't truly independent. He's "trying to schnooker you RT @BDayspring: Wow. MT @Timodc Congrats to DNC/DSCC operative @mikephillips1 on new role as spox for Democrat, "Independent" Greg  Greg Orman's ties to jailed financier Rajat Gupta increasingly at issue in key Kan. senate race. Via @jmartNYT http://t.co/KZ1rEbKkWk US NEWS Independent Senate Candidate Shown Little Love http://t.co/L96M2763z5 follow warren today First Republican "oppo research" smear story lands in Kansas. I'm told is there is more to come - aimed at Greg Orman http://t.co/kOI1gAXDvc Greg Orman maintains professional ties with ex-Goldman Sachs board member convicted of securities fraud http://t.co/FrbWkDY2DK #KSSen RT @BryanLowry3: Greg Orman discloses personal finances, millions in real estate investments http://t.co/8urfqSrHIP #ksleg #kseln #kssen This would be fabulous for people who want change in DC. Read along  http://t.co/k3zKuNOnK9 RT @GroverNorquist: Greg Orman is running for Senate in Kansas because Nevada needs another Senator.      Greg Orman: Harry Reid's other vo RT @HouseCracka: Kansas is being duped. Greg Orman is a BIG Democrat Donor. Here is just one of his donations to:
Obama for America. http:/ RT @GroverNorquist: Greg Orman is running for Senate in Kansas because Nevada needs another Senator.      Greg Orman: Harry Reid's other vo @MikeLoBurgio Unlike Pat Roberts, Greg Orman is from Kansas.  He's smart, thoughtful, and tough. He will be a fresh, sane. voice 4 Kansas Sarah Palin says Greg Orman trying to 'snooker' Kansas voters - http://t.co/Tl9tD6ltzU http://t.co/LRvi5GwaOu ''Gidelim Afet, bir orman kenarna gidelim... Her eyi brakalm... yle basit bir ev, ocakl bir oda... Hele ben bir iyi olaym da...'' RT @kasie: On the road in Kansas, it's clear Pat Roberts could lose. Our in-depth look at his uphill battle http://t.co/iJMyvh3bMQ w @bendm RT @HouseCracka: Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSA RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @CentProj: Greg Orman is "the most interesting man in politics." Help spread the word about this campaign! #kssen #CenterStands http://t RT @PatRoberts2014: Where is Orman hiding? First person to tweet photo of him at public event in KS will win a t-shirt. Use #WheresOrman. h RT @BDayspring: Peeling back the curtain: Democrat Greg Orman's ties to convicted investor run deep http://t.co/ijzYNmeP7d #KSsen RT @BDayspring: Peeling back the curtain: Democrat Greg Orman's ties to convicted investor run deep http://t.co/ijzYNmeP7d #KSsen RT @HouseCracka: Greg Orman in Kansas is huge Democrat Donor. @FoxNewsSunday covers up the lies. He is not an independent. He is a donkey. RT @DavidSeawright: He ran as one in 2008. RT @TPM: Koch brothers tag Kansas independent Senate candidate as closet Democrat http://t.co/HB RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO http://t.co/exOUsgXBBB #palin #teaparty RT @LaCivitaC: Greg Orman, call your office:   http://t.co/1r3XTl8Kn7 Oh that Greg Orman! https://t.co/3bXwgBfkGT MT @PhilipRucker man wears Bob Dole mask to pose w Dole &amp; @PatRoberts2014 http://t.co/pwBjPsvrHD Sarah Palin says Greg Orman trying to snooker Kansas voters
http://t.co/vc3Nw174YT You are either with Roberts, or with Harry Reid+Obama. Independent Senate Candidate Draws Scant Democratic Support http://t.co/7lGQK73H8L via @B4INFeatured: John McCain campaigns with Pat Roberts, says Greg Orman looks like a Democrat http://t.co/xTGvJJmLoT #tcot RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C Kansas! The intrigue increases! Sources: Milton Wolf weighs Greg Orman endorsement http://t.co/Lsm67dDsjt RT @AoSHQDD: New #KSSEN Poll: Orman (I)* 45%, Roberts (R) 40% http://t.co/SvspVY5Ew0 Staking the Senate on Kansas? - SHAWNEE, Kan. Tacked to the wall of Greg Ormans campaign office is a print of a J... http://t.co/L1DrFWdOvK Love it! --&gt; @SenJohnMcCain on Greg Orman: "If he's independent, I'm an astronaut." http://t.co/joQlhJXNgK #kssen RT @PhilipRucker: Pat Roberts, Palin at his side, is feisty and energetic, ripping into Orman: "He is NOT an independent." #kssen Kansas you are being hoodwinked. Greg Orman gave money to Harry Reid too. Greg Orman is a Donkey in masquerade. http://t.co/RTcK4lUHkg #KS Sen. wannabe Greg Orman fascinates the Beltway crowd: http://t.co/WvbRUXJRJt RT @KansasGOP: Media Release:  KS Sen Candidate Greg Orman's Staff Reveals His Liberal Agenda #ksgop http://t.co/C2oOiiYtD8 Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to independent and it running... The tough math: If Democrats lose Pryor and Begich, as PPP suggests they will, they pretty much need Greg Orman to get to 50 seats. RT @ivn: "96% of Kansans say politicians should support good ideas, not just partisan ideas." http://t.co/8UeVCzXlWZ RT @Vision4USA: RT: Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http: RT @JimmyPrinceton: Wolf needs to fall in line, now. RT @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/HKs Sources: Wolf weighs Orman nod - The tea party candidate is considering some political payback by endorsing the Ka... http://t.co/KzY6iNzzkr RT @HouseCracka: Kansas you are being hoodwinked. Greg Orman gave money to Harry Reid too. Greg Orman is a Donkey in masquerade. http://t.c RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @amylutz4: The hell? RT @AoSHQDD: New #KSSEN Poll: Orman (I)* 45%, Roberts (R) 40% http://t.co/h4RDtdrh6N RT @lachlan: Pat Roberts' failed tea party challenger may endorse Greg Orman if he agrees to caucus with the GOP http://t.co/b72MdaZE0k RT @bloggingheads: The Senate kingmaker? @billscher &amp; @mattklewis on the potential power wielded by independent KS candidate Greg Orman. ht RT @ForecasterEnten: If Orman said he caucuses with the GOP, then this gets one step closer to looking like CT 06 http://t.co/Fvsuenta4W (h RT @GEGOPS: Greg Orman donated $1000 to Harry Reid, $4600 to Obama $4600 to Hillary $9400 to KS Dem Committee #kssen #kansas #ksleg #ksgop Sarah Palin says Greg Orman trying to 'snooker' KS voters http://t.co/sZp4tecmHP

@SenPatRoberts campaigning with this nat'l embarassment??! RT @bjs5555: We DO in the KANSAS Senate Election WANT to VOTE for the Independent Greg Orman @OrmanForSenate to Defeat GOP/TEA Senator Pat  "it's simple" Vote 4 Kansas Greg Orman is Vote 4 Obama  http://t.co/4NSTxNUnlr Hmm didn't Palin endorsements stop being useful a few years ago? If she's really going to #KSSen for Roberts, welcome Greg Orman (I-KS). RT @Vision4USA: Greg Orman is a Trojan Horse for the Democrats. He is a not an Independent. Vote for Roberts! #KSsen #tcot http://t.co/8R3H RT @lheal: Every Democrat Senate candidate (including Greg Orman, Democrat from Kansas) would vote for Harry Reid as Senate Majority Leader. Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? http://t.co/sUk5x6CAqG #tcot #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/JMbAjDmVTl #alert RT @EchelonInsights: Adding #KSSEN to #InsightsOnAir Senate track. Greg Orman has 55% of the spots slated to air in next 3 weeks. http://t. Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to independent and it running... RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @cynthia4877: GOP desperately trying 2 save KS Senate seat. Polls show Independent Greg Orman leading GOP Pat Roberts.

http://t.co/iUq RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems.  Don't be  RT @politico: Milton Wolf may endorse Kansas independent Greg Orman, if Orman caucus with the Senate GOP http://t.co/CEZiDFAbEh RT @nrlc: Greg Orman has the same extreme abortion position as Barack Obama. - @CarolTobias1 #kssen #prolife http://t.co/EX2Zw2bXC7 RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Rove throws the gauntlet down on Greg Orman knowing #PatRoberts is so despised and hated in #Kansas only chance is to destroy opponent. #FNS Kansas Senate Candidate Greg Orman, is as Democratic as Barack Obama. #kssen #orman #patroberts #kansas http://t.co/OoedpuPSpg Independent Senate candidate Greg Orman's wealth exceeds $21 million (and may be as high as $85 million). http://t.co/m0f31aLy5R #Kansas #KS Why you want #GregOrman to win #Kansas Defeat #GOP #PatRoberts http://t.co/m052VVg0EW Another day another missing senate candidate and yet no one in the media asks..#wheres Greg orman? Will Dems go all-out to beat Sen. Pat Roberts now? http://t.co/mvuyp7wufS via @POLITICO #Libusters RT @rickhasen: In a matter of weeks Greg Orman could be one of the most important people in American politics. #KSSEN RT @willrahn: Greg Orman, the Indy who may take out Pat Roberts in Kansas, is a fan of both Coldplay and Nickleback https://t.co/4HIG046hM2 RT @LPDonovan: Greg Orman's new DSCC handlers scrub Veoh account, try to whitewash his liberal, Nickelback-loving past #neverforget http:// RT @WichitaCindy: From @bluebarnstormer: Go ahead and celebrate! Greg Orman is a fine choice for Kansas Dems! http://t.co/pd8RK4R5Sl #orman RT @rollcall: #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/Gbh9u719Um #alert RT @kjon: "A vote for Greg Orman is a vote for @BarackObama" - Great new ad from Freedom Partners #KSsen https://t.co/NigPvV49Fc RT @bjs5555: In #KS, for strategic reasons, our (D) candidate dropped out of the Senate race to BACK Ind Greg Orman to beat Tea Sen Roberts Sarah Palin says Greg Orman trying to 'snooker' #Kansas voters http://t.co/m6e9IPo6WH Vote Repub #teaparty. Don't shoot country in foot RT @Morning_Joe: In Kansas, Sen. Pat Roberts is fighting the reelection race of his life. MORE: http://t.co/8Zulh3wGDg Greg Orman discloses assets, investments worth millions http://t.co/0H1uWrcD3P RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http Greg Orman lures left-leaning donors despite uncertainty about whether he'll caucus with Democrats http://t.co/8V556CNiMD #KSSEN RT @willrahn: Greg Orman, the Indy who may take out Pat Roberts in Kansas, is a fan of both Coldplay and Nickleback https://t.co/4HIG046hM2 In Kansas, Democratic donors invest in uncertainty; Independent Senate candidate Greg Orman coy with c http://t.co/zHnaKS22Q9 RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @georgewillf: Greg Orman wants to deny Pat Roberts a fourth Senate term, thereby ending a congressional career that began in 1981 http:/ Nate Silver has Greg Orman favored to win Kansas senate seat - Kansas City Star (blog) http://t.co/ZBPBNru8t1 Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to ind... http://t.co/8XrOWS1w28 RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr RT @EconUS: It's more than 80 years since an independent politician last turned heads in Kansas @DSORennie http://t.co/OZm9maODC4 RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http @gsiskind Is voting for a independent in this race disenfranchisement? http://t.co/XmSunG3QXM Will Dems go all-out to beat Roberts now? via @POLITICO for iOS http://t.co/Lz6B4y9aso RT @stuartpstevens: Sounds like Charlie Crist in '10, For whatever just elect me@ThePlumLineGS: Greg Orman says he will caucus with whoever Orman-Wolf meeting canceled http://t.co/EWLXKbC6Ow Kansas #Race. Check out Greg Orman @OrmanForSenate profile on our site: http://t.co/gFp5LZPFe0 http://t.co/UJKVI9FrQG Pat Roberts releases documents tied to Greg Orman's role in 2012 trial of business associate http://t.co/9rGXi0aLmL (@BryanLowry3) #kssen RT @HouseCracka: Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSA RT @georgewillf: Greg Orman wants to deny Pat Roberts a fourth Senate term, thereby ending a congressional career that began in 1981 http:/ RT @stevekraske: Turns out that KS Sen. @JerryMoran also has a lot riding on the Roberts-Orman race: http://t.co/nkP9WeCDDp RT @HouseCracka: Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSA Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to ind... http://t.co/YSsBjHAUc4 Sarah Palin says Greg Orman trying to snooker Kansas voters http://t.co/KB8cB1UuMo RT @charlieNPR: Greg Orman, painfully above the fold in Kansas capital paper. Meanwhile, Roberts hasnt polled over 42 since primary http:// Kansas takes center stage: Sen. Pat Roberts is facing an unexpectedly strong challenge from independent Greg O... http://t.co/x2GZ6UvaQm RT @GEGOPS: Even MSNBC is calling Greg Orman a Democrat. https://t.co/LTfcLPSWpx #kssen #ksleg Vote Pat Roberts. #kansas @Taniel Why do you assume Angus King and KS Orman will caucus with Dems? King has already said "GOP." Orman is a fmr. Reaganite. @upwithsteve Y do the Dems feel so sure that Greg Orman-KS will caucas w/ the Dems? He didn't support Obama although he ran as a Dem B4. RT @Nate_Cohn: Greg Orman has a real pathway to victory in Kansas after last night's court decision. This isn't Kentucky. http://t.co/s3d6g RT @LloydMarcus: Liberal Greg Orman's shameless effort to trick voters continues to be exposed.  The latest?  He hired as his... http://t.c RT @jameshohmann: The Orman-Wolf meeting was canceled after @politico reported it was happening. Update by @mkraju &amp; @politicoalex: http:// OH, PLEASE DONT: Sources: Milton Wolf weighs Greg Orman endorsement. I can understand a grudge af http://t.co/p0hqiDlfFX "In Kansas, Roberts fights for his seat  and the Senate" http://t.co/17qqnJ3hAZ #msnbcdiscuss RT @JessicaTaylor: .@mollyesque has a great look at who Greg Orman is and why he just might win #KSSen  http://t.co/7lf4ADStKt RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http GOP desperately trying 2 save KS Senate seat. Polls show Independent Greg Orman leading GOP Pat Roberts.

http://t.co/iUqedQ3ttO RT @BryanLowry3: @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/7vNm45UYfm really needed an insider to s RT @willrahn: Greg Orman, the Indy who may take out Pat Roberts in Kansas, is a fan of both Coldplay and Nickleback https://t.co/4HIG046hM2 RT @OpenSecretsDC: If he wins, @OrmanForSenate could become one of the richest Senators in Congress, notes @KWCH12, citing our data: http:/ RT @PatRoberts2014: Senator Bob Dole on Greg Orman to ABC News: "The guy is a Democrat masquerading as an Independent" #kssen RT @GOP: Greg Orman: Staffed by Democrats, funded by Democrats, has donated to Democrats, is the de facto Democrat. http://t.co/NFoCy7Y9KL  KS Dems told Chad Taylor 'he could have bright future in the party' if he withdrew. Democrat, "Independent" Greg Orman. 

#kssen #DemocraticSen #Going #PublicWorksCommittee If Greg Orman should win in #Kansas, he ... http://t.co/tbgIBykYjB RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @UpshotNYT: Greg Orman has a real path to victory in Kansas after last night's court decision. This isn't Kentucky. http://t.co/7utVyt5H John McCain campaigns with Pat Roberts, says Greg Orman looks like aDemocrat http://t.co/rhNrOVYATG Greg Orman in ICT this a.m. Talking issues and ideas, and not mentioning his opponent. Where's my shirt? #WheresOrman http://t.co/5fDZiFD457 RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not Sources: Milton Wolf weighs Greg Orman endorsement http://t.co/R2kBOFDH1N via @POLITICO Good @mollyesque story on the enigmatic Greg Orman and the most interesting Senate race in the country: http://t.co/EusshiQyah RT @bktx24051: Meet Greg Orman; running as an Independent in Kansas. Wolf in sheep's clothing. 
http://t.co/vng0MF2ZSz RT @HouseCracka: Greg Orman maintains professional ties with ex-Goldman Sachs board member in prison. 

http://t.co/caT5TcrO3T

#ksgop #kss Mary Sanchez column: Attack ads miss the point about U.S. Senate candidate Greg Orman http://t.co/LQDpohYduj RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http Greg Orman might be in trouble. The NRSC has decided to treat him like he's a conservative. 

http://t.co/GE1pkAEsw3 Sources: Wolf weighs Orman endorsement http://t.co/2zHNCqBJ11 #UniteBlue RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @dylanlscott: Wanna know why Greg Orman doesn't need party support? He's worth more than $21 million: http://t.co/53NGBmrG9O #KSSen WHO IS GREG ORMAN? http://t.co/DGty5tcLkY RT @fairvote: "We have an electoral system that creates strange incentives"-- Exec Director Rob Richie in @CBSNews piece on #kssen http://t RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @Morning_Joe: In Kansas, Sen. Pat Roberts is fighting the reelection race of his life. MORE: http://t.co/8Zulh3wGDg RT @LJWorld: Greg Orman disclosed Monday that he owns assets worth between $21.5 million and $86 million http://t.co/8viDzBIpZS #KSSEN news: Milton Wolf may endorse Orman if he caucuses with GOP; two will meet Friday. w/@politicoalex. http://t.co/E69qTdZRUj RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http http://t.co/2QZoMaIk4P #news Pat Roberts and Greg Orman see several issues differently in the U.S http://t.co/CmxySQvnw0 RT @OldHydePark: #Chance #IndependentGregOrman #Kansas #NateSilver Nate Silver has Orman favored to ... http://t.co/1inWTOf0bQ Unbelievable RT @rollcallpols: #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/CyVOkASMns #alert Sources: Wolf weighs Orman endorsement http://t.co/zDhB3WJlIk Some liberal #Democrats now questioning their alignment with Ind. #GregOrman in #Kansas http://t.co/vvWCKlGbzX #partyswitch #caucuswithGOP RT @lheal: Greg Orman can say he would not vote for Harry Reid, but he would. The only reason he would not is if everyone else were not. Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to ind...  http://t.co/Vc385vcuPG RT @TPM: Koch brothers tag Kansas independent Senate candidate as closet Democrat http://t.co/1V8DqQWOly #KSSen http://t.co/ux2f0liCcB RT @nrlc: #KSSen: Greg Orman would be one more pro-abortion, anti-life Democrat http://t.co/y0S2knYslm #prolife http://t.co/w0GIYhCUdw RT @Politics1com: KS USSEN (Rasmussen): Greg Orman (I) 45%, Pat Roberts (R) 40%. Greg Orman was Democrat candidate for Senate in 2008. Now claims Independent.Won't say who he will caucus with if elected. RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t #Chance #IndependentGregOrman #NateSilver Nate Silver has Greg Orman favored to win ... http://t.co/dHcPlSntvS RT @TPM: Koch brothers tag Kansas independent Senate candidate as closet Democrat http://t.co/1V8DqQWOly #KSSen http://t.co/ux2f0liCcB Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star http://t.co/9MzlyAP9fv #news #world Greg Orman (I) 48%, Pat Roberts (R) 42% new Fox News Kansas Senate 2014 poll. http://t.co/rlU4tDg0R0 Politico &gt; Sources: Wolf weighs Orman endorsement http://t.co/UZchJMpKzi #photojournalism RT @fairvote: "We have an electoral system that creates strange incentives"-- Exec Director Rob Richie in @CBSNews piece on #kssen http://t Based on his FEC donations I would say Greg Orman is a cross dressing Democrat. He is NOT an Independent by any stretch. #kssen WOLF COULD BACK ORMAN IN KANSAS SENATE RACE  HAGANS HUSBAND TOOK IN STIMULUS MONEY  HOLDER IS GONE.BUT CON... http://t.co/T2XsyxSX68 RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/8B5qZKlCPT RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre Roll Call Politics: Kansas Ballots Will Be Mailed Without Democratic Senate Nominee: Kansas Secretary of State... http://t.co/98y8Q5kTnZ Freedom Partners Action Fund, up on the air in #KSSen against Greg Orman: http://t.co/fZDHdjb1Kk http://t.co/UCTcFmcSBx RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not #finance #financenews Pat Roberts and Greg Orman see several issues differently in the U.S. Senate   Kansas Ci... http://t.co/RkBmCeqmPP Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman?: Kingmaker. 
The Republica... http://t.co/PRYKsBZoag Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? http://t.co/4sAif9lt5V Koch Brothers Tag Kansas Indy Sen Candidate As Closet Dem In Their Fiefdom #UniteBlue  http://t.co/Qq9uFY5Gpm Will Dems go all-out to beat Sen. Pat Roberts now? http://t.co/8B2kx9JWhU via @POLITICO Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star @mattkeelen offers his insight into the #Kansas #Senate race featuring Independent-candidate Greg Orman. #GOP #Nov4  
http://t.co/HftOrAz5Bd RT @BDayspring: In #KSsen Chad Taylor's lawyer was top DSCC lawyer. Greg Orman's spox a fmr top staffer to DSCC Chairman. Notice a trend? RT @CentProj: @OrmanForSenate "The most interesting man in politics" Spread the word about this campaign #kssen #CenterStands http://t.co/C Independent Greg Orman lures left-leaning donors in #KSSEN despite uncertainty about whether he'll caucus with Dems http://t.co/oxycKx0hYW RT @Vision4USA: RT: Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http: After dragging on for weeks, Kansas' U.S. Senate race drama results in head-to-head matchup between Orman and Roberts http://t.co/RfdUWevXQM man of principle MT @rubycramer on @CBSEveningNews, Greg Orman (@OrmanForSenate) says he'd caucus with whichever party has majority. #kssen Sources: Wolf weighs Orman nod http://t.co/4tbMto4R1R RT @jameshohmann: The Orman-Wolf meeting was canceled after @politico reported it was happening. Update by @mkraju &amp; @politicoalex: http:// RT @HouseCracka: Greg Orman in Kansas is huge Democrat Donor. @FoxNewsSunday covers up the lies. He is not an independent. He is a donkey. Fuck Pat Roberts, Greg Orman ftw #Politico WOLF COULD BACK ORMAN IN KANSAS SENATE RACE  HAGANS HUSBAND TOOK IN STIMULUS MONEY  HOLDER IS GON... http://t.co/lIeR3oLQSY #investments Kansas Senate candidate Greg Orman discloses assets, investments worth ... - Fresno Bee http://t.co/HMlWlTKgyY RT @GroverNorquist: Greg Orman is running for Senate in Kansas because Nevada needs another Senator.      Greg Orman: Harry Reid's other vo GOP heists it's leg on it's base &amp; then wonders why they don't get the support in the general election  http://t.co/V9WY0ZWWVw POLITICO: Sources: Wolf weighs Orman nod http://t.co/sZMkk5hCpN #tcot #ocra #ampat Politico: Orman-Wolf meeting canceled http://t.co/QxJDCLq9L4 Greg Orman's Candidacy Threatens Republican Hold in Kansas - Chinatopix http://t.co/6vNCErhLs0 #palin #teaparty RT @MLBOIG: KNEA and NEA have officially recommended Greg Orman (I) for US Senate.  http://t.co/bx4Hvcl9CM  #ksleg Is Pat Roberts' conservative primary challenger in Kansas going to back Greg Orman?  http://t.co/Ei6AweAFTL RT @HorseRacePoltix: Kansas Ballots Will Be Mailed Without Democratic Senate #kssen http://t.co/2v5Y3GOn3i what a headline to get... #KSSen RT @charlieNPR Greg Orman, painfully above the fold in Kansas capital paper. http://t.co/QomzbwGuMd RT @mollyesque: I went to Kansas to see what this Greg Orman character is all about http://t.co/i0qEEVrSbq Independent Senate candidate Greg Orman discloses owning between $21.5M and $86M in assets. http://t.co/aZwiTUM8zW #kssen #kseln #ksleg RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. Political Decisions 2014:  Kansans, don't be fooled by Greg Orman.  No such thing as an Independent.  An Independent is akin to a Chameleon. RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems. Don't be f RT @CJ_news: Latest News: Orman's link to jailed investor deeper than portrayed: U.S. Senate front-runner Greg Orman plans ... http://t.co/ Greg Orman releases his financials; net worth in the millions http://t.co/0NazEjRCF9 http://t.co/8yqHUsnNgt RT @UpshotNYT: Greg Orman has a real path to victory in Kansas after last night's court decision. This isn't Kentucky. http://t.co/7utVyt5H Sarah Palin says Greg Orman trying to 'snooker' Kansas voters - http://t.co/OaUG2n8NSR: Kansas.comSarah Palin s... http://t.co/j6s5a2VfTI RT @allahpundit: Sources: Milton Wolf may endorse Pat Robertss independent opponent http://t.co/Cie9hmVtCX RT @mmurraypolitics: Why Greg Orman in Kansas could be the most interesting man in politics this November http://t.co/NmFzcixSCj RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @BigGator5: #KSSen: @TheDemocrats Are Buying @OrmanForSenate Outright http://t.co/H6cnhpmYOF @moelane #tcot #p2 #kansas #election2014 Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO http://t.co/gGmgz5Jbk1 #palin #teaparty Redding News Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City St... http://t.co/Yf2pybwe6w Kansas overseas election ballots will be sent out without listing a Democratic Senate nominee http://t.co/Gbh9u719Um via @alexis_levinson Independent Greg Orman:  http://t.co/P6gzbCBIIY #GOP RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not Wow - could Milton Wolf guarantee a Greg Orman win? Fascinating, but skeptical Orman would go for it.
http://t.co/IhKI6WSPXi RT @GOP: Greg Orman: Staffed by Democrats, funded by Democrats, has donated to Democrats, is the de facto Democrat. http://t.co/NFoCy7Y9KL  RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @LaCivitaC: Another day another missing senate candidate and yet no one in the media asks..#wheres Greg orman? RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http No Greg Orman I will not vote for you because I am a Republican! RT @ivn: "96% of Kansans say politicians should support good ideas, not just partisan ideas." http://t.co/8UeVCzXlWZ RT @KCStar: Mary Sanchez column: Attack ads miss the point about U.S. Senate candidate Greg Orman http://t.co/LQDpohYduj Orman would be among wealthiest senators, financial disclosure shows:  Greg Orman, the political independent c... http://t.co/kwepoeUcLB RT @AlexPappas: Wow - could Milton Wolf guarantee a Greg Orman win? Fascinating, but skeptical Orman would go for it.
http://t.co/IhKI6WSPXi OH, PLEASE DONT:  Sources: Milton Wolf weighs Greg Orman endorsement.  I can understand a grudge af http://t.co/sNL0cymcNH RT @ivn: Politics is not something that was intended to take over your life..." - @OrmanForSenate http://t.co/2mobdxAl7a Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO http://t.co/C2XasHKkOM #palin #teaparty RT @AlexPappas: Wow - could Milton Wolf guarantee a Greg Orman win? Fascinating, but skeptical Orman would go for it.
http://t.co/IhKI6WSPXi RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Then-Dem Greg Orman raised $450k in first month of his 2008 challenge to Roberts, but abruptly dropped out in favor of ex-Rep. Slattery. RT @UpshotNYT: Greg Orman has a real path to victory in Kansas after last night's court decision. This isn't Kentucky. http://t.co/7utVyt5H RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/8B5qZKlCPT #Chance #IndependentGregOrman #Kansas #NateSilver Nate Silver has Orman favored to ... http://t.co/1inWTOf0bQ The fact that Greg Orman hasn't even mentioned Kobach's conspiracy against him is a sign that he should be our next Senator. #OrmanforSenate .@mollyesque has a great look at who Greg Orman is and why he just might win #KSSen  http://t.co/7lf4ADStKt RT @nrlc: Greg Orman has the same extreme abortion position as Barack Obama. - @CarolTobias1 #kssen #prolife http://t.co/EX2Zw2bXC7 RT @nrlc: #KSSen: Greg Orman would be one more pro-abortion, anti-life Democrat http://t.co/y0S2knYslm #prolife http://t.co/w0GIYhCUdw RT @Croatansound: #Kansas Greg Orman calls himself a (I) but takes $ from #Dems which in my book makes him a (D): #KSsen #Wichita #TCOT htt The Kansas City Star: 6 ways Pat Roberts and Greg Orman differ on important issues. Learn more about Greg Orman... http://t.co/GPmsMNhRsJ RT @politico: Milton Wolf may endorse Kansas independent Greg Orman, if Orman caucus with the Senate GOP http://t.co/CEZiDFAbEh RT @lheal: Dear #KSSen: Greg Orman is a liberal Democrat. He is not a conservative in any way. He will vote for Harry Reid as Majority Lead AYFKM?: Sources: Milton Wolf weighs Greg Orman endorsement http://t.co/purOOEM44F via @POLITICO #Republican women should have voted this guy out awhile ago now we are stuck with a 'good ol boy' until he... http://t.co/OmG7Qzzrks RT @politico: Milton Wolf may endorse Kansas independent Greg Orman, if Orman caucus with the Senate GOP http://t.co/CEZiDFAbEh RT @mjbeckel: Among indy Greg Orman's campaign donors? A lawyer &amp; former Obama bundler who has represented @LadyGaga &amp; @U2 http://t.co/EWly Orman would be among wealthiest senators, financial disclosure shows: Greg Orman, the political independent ch... http://t.co/JGC3gqVtD0 RT @dylanlscott: Wanna know why Greg Orman doesn't need party support? He's worth more than $21 million: http://t.co/53NGBmrG9O #KSSen RT @PaulLewis: First Republican "oppo research" smear story lands in Kansas. I'm told is there is more to come - aimed at Greg Orman http:/ #DmEdiison_21 Orman-Wolf meeting canceled: An insider says Wolf won't support Orman. http://t.co/ZLqxRRHfDA #DmEdiison_21 RT @nrlc: We stand with @PatRoberts2014 in the #KSSen race! Greg Orman would be another pro-abortion vote for Obama and Reid: http://t.co/m Democrat, "Independent" Greg Orman hired a former @dscc staffer as his new spokesman. (Wash Post).

http://t.co/QHENqJtXZm #kssen RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. We need @OrmanForSenate in Washington, solving problems. RT @WichitaCindy: Greg Orman in Wichita https://t.co/m8FmyGmLul #kssen #kseln Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not picking a side #KanSen RT @LloydMarcus: Liberal Greg Orman's shameless effort to trick voters continues to be exposed.  The latest?  He hired as his... http://t.c Sarah Palin says Greg Orman trying to 'snooker' Kansas voters

http://t.co/GeeQ78M5YC

#tcot
@SarahPalinUSA
@MarkLevinShow RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic Open Questions For Kansas Senate Candidate Greg Orman http://t.co/yUWrpezDRs RT @charlieNPR: Greg Orman, painfully above the fold in Kansas capital paper. Meanwhile, Roberts hasnt polled over 42 since primary http:// Sources: Wolf weighs Orman endorsement  via @josephjett #politics http://t.co/p3t8FiyEKO Independent candidate threatens to upset GOP hold in Kansas - Greg Orman, a former Democrat who switched to indepe... http://t.co/rblVs1Oym8 RT @SayNoToGOP: Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? - Hot Air http://t.co/lJgcfNL8et RT @BryanLowry3: @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/7vNm45UYfm really needed an insider to s RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/jFRrJ7hMIl Greg Orman once sued actress Debbie Reynolds over $1 million loan to museum http://t.co/BZzCn9u9TR RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @PatRoberts2014: No public events for Greg Orman again todayWhere is he hiding? Tweet photo of him at public event in KS &amp; win a t-shir Gotta give props to my wife!  She did a GREAT interview with Kansas Senate Candidate Greg Orman.
 http://t.co/hgH4mwx1Kp #Gunnews #guns Independent Candidate Alarms Republicans: Greg Orman http://t.co/JCMYvYSZEY RT @SamWangPhD: Absolute must-read from @mollyesque: "I went to Kansas to see what this Greg Orman character is all about" http://t.co/V4nS RT @Vision4USA: Greg Orman is a Trojan Horse for the Democrats. He is a not an Independent. Vote for Roberts! #KSsen #tcot http://t.co/8R3H Greg Orman is no independent. #kssen @PatRoberts2014 http://t.co/42KMjzByph Sources: Wolf weighs Orman endorsement http://t.co/h5RlLb7aKe RT @BaracksBackers: Rove throws the gauntlet down on Greg Orman knowing #PatRoberts is so despised and hated in #Kansas only chance is to d RT @nrlc: We stand with @PatRoberts2014 in the #KSSen race! Greg Orman would be another pro-abortion vote for Obama and Reid: http://t.co/m #msnbcNEWS Poll: Can Greg Orman defeat Sen. Pat Roberts?: It's a close race between independent Greg Orman and...  http://t.co/wIn3XUBwGH FIRING HARRY REID takes a Republican Majority in the Senate. We need Pat Roberts in the US Senate. Not Greg Orman.

#kssen Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star: Kansas Ci... http://t.co/p1fWbIo1Cb RT @KansasGOP: Media Release:  KS Sen Candidate Greg Orman's Staff Reveals His Liberal Agenda #ksgop http://t.co/C2oOiiYtD8 RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @WIBWNews: Wolf Scheduled To Meet With Orman Over Possible Endorsement #VoteKS http://t.co/GPbK5WGZxS RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  "Card Check" sop to GOP conspicuously absent from then-Dem Greg Orman's 2008 site- you know, back when it was a thing http://t.co/1tvRo5VFYW RT @mkraju: #KSSEN news: Milton Wolf may endorse Orman if he caucuses with GOP; two will meet Friday. w/@politicoalex. http://t.co/E69qTdZR RT @stevekraske: Turns out that KS Sen. @JerryMoran also has a lot riding on the Roberts-Orman race: http://t.co/nkP9WeCDDp @sdjacksondc I think another FFFUUU Milton Wolf is in order. http://t.co/3IjTXuvBjx RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. Kansas you need to keep Pat Roberts as your Senator to give Republicans control of the Senate Greg Orman will just vote with Obama RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C Greg Orman has the same extreme abortion position as Barack Obama. - @CarolTobias1 #kssen #prolife http://t.co/EX2Zw2bXC7 Sources: Wolf weighs Orman nod via @POLITICO for iOS http://t.co/KkoDz8Ik1J Greg Orman discloses personal finances, millions in real estate investments http://t.co/8urfqSrHIP #ksleg #kseln #kssen RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @mjbeckel: Independent Greg Orman lures left-leaning donors in #KSSEN despite uncertainty about whether he'll caucus with Dems http://t. RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/jFRrJ7hMIl RT @TheFastPitch: Greg Orman is really rich http://t.co/CfYhettolA RT @CentProj: Greg Orman is "the most interesting man in politics." Help spread the word about this campaign! #kssen #CenterStands http://t RT @michaelpfalcone: Bob Dole calls Greg Orman "a Democrat masquerading as an Independent" in intvu w/ @alex_mallin http://t.co/r6NqC9lK4E RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. If Greg Orman should win in Kansas, he would hold leverage in Washington: http://t.co/UHQsUbiHq1 http://t.co/eiTgykLNh8 Google News Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star http://t.co/GbCLcGEb27 RT @CharlesWheelan: Greg Orman, centrist Senate candidate in Kansas, is "the most interesting man in politics."

http://t.co/WB8PNrxBlx RT @ericdondero: Why wld #Kansas #liberals vote  #GregOrman? He's WS investor, Pro #Gun, Pro #BorderSecurity No #Obamacare
http://t.co/vvWC RT @ivn: Politics is not something that was intended to take over your life..." - @OrmanForSenate http://t.co/2mobdxAl7a RT @wbdamron: Wow. George Will on Fox News All-Star discussion just said KS Senate race is "Orman's to lose."  #kssen RT @bjs5555: We DO in the KANSAS Senate Election WANT to VOTE for the Independent Greg Orman @OrmanForSenate to Defeat GOP/TEA Senator Pat  MT @mikememoli: @SarahPalinUSA in Independence, KS, says Greg Orman isn't truly independent. He's "trying to schnooker you, Kansas." #KSsen Mmm hmmm MT @charlieNPR: Greg Orman, painfully above the fold in Kansas capital paper.  http://t.co/iTAUnn7XB1 "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems.  Don't be fooled! 
#KSsen Greg Orman releases his financials; net worth in the millions http://t.co/wMrFXMGOPt RT @lachlan: Pat Roberts' failed tea party challenger may endorse Greg Orman if he agrees to caucus with the GOP http://t.co/b72MdaZE0k A @GolfDigest article once said I would marry Ann Coulter. See what she says about @PatRoberts2014 and Greg Orman! http://t.co/l2cLEMV9we Wolf needs to fall in line, now. RT @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/HKs1moNp7A Sarah Palin says Greg Orman trying to snooker Kansas voters http://t.co/yviIlDIlfr Media Release:  KS Sen Candidate Greg Orman's Staff Reveals His Liberal Agenda #ksgop http://t.co/C2oOiiYtD8 Independent Senate Hopeful Shown Little Love http://t.co/VH45F4Zwoj Pat Roberts' failed tea party challenger may endorse Greg Orman if he agrees to caucus with the GOP http://t.co/b72MdaZE0k RT @jeffzeleny: FF @ABC's @alex_mallin for @KSSEN: Bob Dole on Greg Orman: "The guy is a Democrat masquerading as an Independent." http://t Democrat Greg Orman retains his partnership to jailed former Goldman Sachs Board Member. 

http://t.co/bekKMGbwqw
#kssen #ksgop RT @Vision4USA: RT: Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http: Greg Orman, the Indy who may take out Pat Roberts in Kansas, is a fan of both Coldplay and Nickleback https://t.co/4HIG046hM2 RT @JessicaTaylor: .@mollyesque has a great look at who Greg Orman is and why he just might win #KSSen  http://t.co/7lf4ADStKt RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Koch Brothers Tag Kansas Indy Senate Candidate As Closet Dem http://t.co/fFDh1ANSN1 Pat Roberts Ad Hammers Phony Independent Greg Orman; Highlights Ormans History as an Obama Democrat: Pretender http://t.co/ugOdckoqZB Greg Orman's net worth would place him among wealthiest senators if elected http://t.co/Tn7FHeutqG RT @Vision4USA: Greg Orman is a Trojan Horse for the Democrats. He is a not an Independent. Vote for Roberts! #KSsen #tcot http://t.co/8R3H RT @kansansforlife: Kansas Gov. Brownback &amp; Sen. Roberts are pro-life. Opponents Paul Davis &amp; Greg Orman are not. http://t.co/6ElOyfDDcP #p RT @RussOnPolitics: Afraid of losing the Senate seat in their home state, the Koch brothers are on the air against Greg Orman. http://t.co/ In Kansas, Roberts scrambles to keep his seat but Greg Orman, an independent is polling ahead of him. http://t.co/q0AW5HYEA5 RT @Phil_Mattingly: George Will on Greg Orman #kssen http://t.co/Ng1znJ6N2T RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t Greg Orman, big Democrat donor, business partner in prison, is not an Independent but a DNC plant. #kssen  http://t.co/9sP8nxLUJV RT @TPM: Koch brothers tag Kansas independent Senate candidate as closet Democrat http://t.co/1V8DqQWOly #KSSen http://t.co/ux2f0liCcB RT @TPM: What exactly are Democrats getting with Kansas independent Greg Orman? http://t.co/q9JyQgukna #KSSen http://t.co/xZQQnlJa4F Kansas Senate candidate Greg Orman discloses assets, investments worth millions:  http://t.co/6p9r3DPH15 RT @blakehounshell: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts http://t.co/1N2yTcfczq Liberal Greg Orman Gets Backing from Dem Super PAC  http://t.co/ocIsbdqrvZ #KSsen RT @BDayspring: In #KSsen Chad Taylor's lawyer was top DSCC lawyer. Greg Orman's spox a fmr top staffer to DSCC Chairman. Notice a trend? RT @HouseCracka: Kansas Wake Up! Greg Orman is BIG TIME Democrat Donor! He is NOT an Independent! Look at these donations! #kssen http://t. RT @willrahn: Greg Orman, the Indy who may take out Pat Roberts in Kansas, is a fan of both Coldplay and Nickleback https://t.co/4HIG046hM2 RT @stevekraske: Turns out that KS Sen. @JerryMoran also has a lot riding on the Roberts-Orman race: http://t.co/nkP9WeCDDp #DmEdiison_21 Sources: Wolf weighs Orman endorsement: The tea party candidate is considering som... http://t.co/l3xgT9FOCh #DmEdiison_21 RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr RT @jeffzeleny: FF @ABC's @alex_mallin for @KSSEN: Bob Dole on Greg Orman: "The guy is a Democrat masquerading as an Independent." http://t This new #KSsen Rasmussen poll confirms that Sen. Pat Roberts is in deep doo-doo. He trails Greg Orman, 45%-40%. http://t.co/mUsr8xYXvn What Exactly Are Dems Getting With Kansas Independent Greg Orman? http://t.co/CAdFYaer19 RT @rwneilljr: What Exactly Are Dems Getting With Kansas Independent Greg Orman?: Whether they'll admit it or... http://t.co/WYCC5o2mqQ #po KS: "Freedom Partners" Group: Greg Orman Is A Vote For Obama http://t.co/SnJIuPHofV #KSSen #tcot RT @nrlc: We stand with @PatRoberts2014 in the #KSSen race! Greg Orman would be another pro-abortion vote for Obama and Reid: http://t.co/m Lexington: Stormin Orman http://t.co/VJBCUmZvIy Pat Roberts and Greg Orman see several issues differently in the U.S. Senate race in Kansas: On the issues of ... http://t.co/KeoOvTn7ts A Republican, A Democrat, and an Independent walk into a bar. The bartender greets him saying, "Well hello Mr. Orman." #KsSen RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems.  Don't be  @KellyO @PatRoberts2014 @SarahPalinUSA no tweets today on Orman's schedule. Both KS Sen tweets re  republican activity. Meet Greg Orman, the Most Interesting Man in Politics  http://t.co/9mJIBAWVX1 Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman?: Kingmaker. 
The... http://t.co/qZQQtgxm1S #Twisters RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. Independent Candidate Alarms Republicans: Greg Orman: With less than two months remaining before the November ... http://t.co/r0xXZjBRNs Sarah Palin says Greg Orman trying to snooker Kansas voters http://t.co/sQ0HVWgqnB Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? - Hot Air http://t.co/26SIjg5Iad If Greg Orman should win in #Kansas he wud hold leverage in Washington  #DemocraticSen #going Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman?: Kingmaker. 
The Republica... http://t.co/kyGAHP2Q1V RT @charlieNPR: Greg Orman, painfully above the fold in Kansas capital paper. Meanwhile, Roberts hasnt polled over 42 since primary http:// Wanna know why Greg Orman doesn't need party support? He's worth more than $21 million: http://t.co/53NGBmrG9O #KSSen Why we lose RT @DrewMTips: Good RT @allahpundit: Sources: Milton Wolf may endorse Pat Robertss independent opponent http://t.co/BWb9a26Slt RT @rickhasen: In a matter of weeks Greg Orman could be one of the most important people in American politics. #KSSEN RT @LloydMarcus: Liberal Greg Orman's shameless effort to trick voters continues to be exposed.  The latest?  He hired as his... http://t.c Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Greg Orman. I"m waiting for the 3rd party ads in KS politics to put blackface on Davis and Orman as they try to tie them to Obama more and more. RT @jasonnobleDMR: Kansas! The intrigue increases! Sources: Milton Wolf weighs Greg Orman endorsement http://t.co/Lsm67dDsjt RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to both Harry Reid and Barack Obama. He will caucus with Dems. 
 RT @HarrierCat: @delong @PhilipRucker @daveweigel Roberts &amp; constituents are old west KS farmers &amp; retired. Most KS pop is east &amp; suburban, RT @HouseCracka: Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSA RT @nrlc: Greg Orman has the same extreme abortion position as Barack Obama. - @CarolTobias1 #kssen #prolife http://t.co/EX2Zw2bXC7 @lindsaywise has good take on how Greg Orman could be the most important person in the US Senate in Jan.:http://t.co/HBKSjfsQQL RT @georgewillf: Greg Orman wants to deny Pat Roberts a fourth Senate term, thereby ending a congressional career that began in 1981 http:/ RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Sources: Milton Wolf weighs Greg Orman endorsement http://t.co/DtNeCyNx8b #tcot BREAKING: Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... ... http://t.co/S1Cf0VdIrM #Khaatumo #Khatumo RT @adrian_gray: WaPo, 538, NYT, &amp; HuffpPo models all give GOP 58-65% chance of winning Senate (and Greg Orman single-handedly renders them RT @mjbeckel: Independent Greg Orman lures left-leaning donors in #KSSEN despite uncertainty about whether he'll caucus with Dems http://t. RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @BDayspring: Things national press ignoring: Greg Orman Spox @mikephillips1 a fmr senior staffer for @DSCC Chair Michael Bennet &amp; @guyce RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to both Harry Reid and Barack Obama. He will caucus with Dems. 
 RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @CJOnline: Latest News: Orman's link to jailed investor deeper than portrayed: U.S. Senate front-runner Greg Orman plans ... http://t.co If Greg Orman should win in Kansas, he would hold leverage in ...:  http://t.co/YMSCOlVZi4 #MittRomney @TPM: What are Democrats getting with Kansas independent Greg Orman? http://t.co/FIkmL0miA9 #KSSen http://t.co/emtS4s1NYifrost tips Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? http://t.co/VdQIs9rvuW #RWNJAlert Sounds like Charlie Crist in '10, For whatever just elect me@ThePlumLineGS: Greg Orman says he will caucus with whoever has clear majority. RT @KCStar: Mary Sanchez column: Attack ads miss the point about U.S. Senate candidate Greg Orman http://t.co/LQDpohYduj Milton Wolf, M.D., is having some fun getting even for stores about his Facebook habits http://t.co/55FZHxHjzC Democrat Greg Orman says he "only" invested a "modest" $50K in criminal enterprise. #KSSen http://t.co/V65JnZOwWK Independent Candidate Alarms Republicans: Greg Orman http://t.co/qgyNF4xk39 via @gunnewsonline RT @darlene09465021: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts... http://t.co/LEoecSJeFb RT @Vision4USA: RT Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http:/ RT @GOP: Greg Orman: Staffed by Democrats, funded by Democrats, has donated to Democrats, is the de facto Democrat. http://t.co/NFoCy7Y9KL  RT @brontyman: Greg Orman: The Most Interesting Man in Politics This November http://t.co/M4d1TAWkiZ via @NBCNews RT @LeonoraInterssa: Sources: Wolf weighs Orman endorsement  via @josephjett #politics http://t.co/p3t8FiyEKO Sources: Milton Wolf may endorse Pat Robertss independent opponent http://t.co/Cie9hmVtCX PALIN: "Independence has to be something tangible." Taking swings at Greg Orman for being "wishy washy" #kssen RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/8B5qZKlCPT RT @jeffzeleny: FF @ABC's @alex_mallin for @KSSEN: Bob Dole on Greg Orman: "The guy is a Democrat masquerading as an Independent." http://t Orman would be among wealthiest senators, financial disclosure shows:  Greg Orman, the political indep... http://t.co/FCof3yyUPf ((WAPO) U.S. Senate candidate Greg Orman, an independent from Olathe, has a net asset worth ranging from $21.5 million to... http://t.co/HoRP7rcDg0 RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @spiritof1973: @thecenterwins @OrmanForSenate Kansas isn't electing a liberal like Greg Orman. Greg Orman has not filed his personal financial disclosure to the U.S. Senate, having sought an exte http://t.co/AWXmBcgFiw Shady! "@CJOnline: Latest News: Greg Orman's link to jailed investor deeper than portrayed. http://t.co/9IofN1cUAZ" #kssen #ksleg RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @MikeLoBurgio: If Greg Orman should win in Kansas, he would hold leverage in Washington http://t.co/l5AsL5I5BD @OrmanForSenate #p2 http: At a coffee meet &amp; great with independent Senate candidate Greg Orman. Standing room only w/crowd of 50+. #kwch12 http://t.co/xXHN9zDAuN RT @lachlan Greg Orman is trying to keep up a nonpartisan image, but he's getting assists from national and KS Dems http://t.co/9EYKBGDYRL @delong Orman's a hard core left wing democrat party radical pretending to be "independent" to fool lowinfo voters @PhilipRucker @daveweigel RT @darlene09465021: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts... http://t.co/LEoecSJeFb An insider trading felon hand-picked Greg Orman to be on the board of his Cayman Islands firm. https://t.co/u5vUiDH7kc cc @mollyesque RT @politico: Milton Wolf may endorse Kansas independent Greg Orman, if Orman caucus with the Senate GOP http://t.co/CEZiDFAbEh RT @KansasGOP: Media Release:  KS Sen Candidate Greg Orman's Staff Reveals His Liberal Agenda #ksgop http://t.co/C2oOiiYtD8 Fix it! MT @EchelonInsights: Here's what ad spending has looked like in KS. Until recently, Orman uncontested on air. http://t.co/e7IpbtWKoO @PhilipRucker And I'm calling Greg Orman "Mr. Senator" RT @LaCivitaC: Greg Orman, call your office:   http://t.co/1r3XTl8Kn7 RT @TPM: Koch brothers tag Kansas independent Senate candidate as closet Democrat http://t.co/1V8DqQWOly #KSSen http://t.co/ux2f0liCcB Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star: Kansas Ci... http://t.co/xLaSWS6iek RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t Intriguing "Greg Orman, the man from Kansas who wants to reshape Washington" http://t.co/ngdvqEX6zH RT @adrian_gray: WaPo, 538, NYT, &amp; HuffpPo models all give GOP 58-65% chance of winning Senate (and Greg Orman single-handedly renders them RT @MichaelLaRosaDC: Kansas Ballots Will be Mailed Without Democratic Senate Nominee http://t.co/LelNutab3N via @rollcall #KSSEN Oh my,Greg Orman IS a #democrat, he's talking Obama's #BlankSlate &amp; that he may switch sides of an issue #NoIntegrity http://t.co/mdYCD7MunT Poll: Can Greg Orman defeat Sen. Pat Roberts? http://t.co/VknkDtuhqK RT @rollcall: #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/Gbh9u719Um #alert In a matter of weeks Greg Orman could be one of the most important people in American politics. #KSSEN Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? - Hot Air http://t.co/Czo1IssAJH RT @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/eeXAyD4qwv RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to ind... http://t.co/zi2KQKxz1h RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not @HowieCarrShow conservative) to win, Orman the "independent" is a registered D,ran as a D before and has given a ton of $$ to D's, he's rich If Greg Orman should win in Kansas, he would hold leverage in Washington http://t.co/l5AsL5I5BD @OrmanForSenate #p2 http://t.co/CIqL2BkBiZ Wait, if Greg Orman, Tom Cotton &amp; Ben Sasse win, there will be 3 McKinsey connections in Senate (Sasse is adjacent) http://t.co/4pRFwOeoyp #greg orman I cannot vote for you. You say u are independent, but it is the Dems backing you &amp; u will owe them your vote. I do not trust u. RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http "Polls show KS Senator Roberts running even or trailing."  I say no way 18-year incumbent Roberts loses  #TermLimits http://t.co/1jXNEmAixS RT @TPM: Koch brothers tag Kansas independent Senate candidate as closet Democrat http://t.co/1V8DqQWOly #KSSen http://t.co/ux2f0liCcB RT @TheFix: RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endor RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems.  Don't be  RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre RT @ThePlumLineGS: RT @DrewMTips: Greg Orman might be in trouble. The NRSC has decided to treat him like he's a conservative. 

http://t.co Just how fractured are Kansas GOPers? Milton Wolf toying with endorsing Orman - if he promises to caucus w GOP http://t.co/tIR5wlDijf Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO http://t.co/WzqLdIVnlh #palin #teaparty RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic RT @BDayspring: Peeling back the curtain: Democrat Greg Orman's ties to convicted investor run deep http://t.co/ijzYNmeP7d #KSsen Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSAS!

#kssen #ksgop He's a Democrat pretending not to be: Independent Candidate Draws Scant Support http://t.co/l479YaL92b Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts http://t.co/1N2yTcfczq RT @georgewillf: Greg Orman wants to deny Pat Roberts a fourth Senate term, thereby ending a congressional career that began in 1981 http:/ RT @Publici: U.S. Senate Candidate Greg Orman of Kansas has pledged to be an independent [who] wont answer to either party.  http://t.co Greg Orman releases his financials; net worth in the millions http://t.co/mmhLwZRQPF #KWCH12 RT @alex_mallin: Bob Dole on Greg Orman: "The guy is a Democrat masquerading as an Independent." #KSSen #Ksleg #14for14 http://t.co/rECRS0h RT @TPM: Koch brothers tag Kansas independent Senate candidate as closet Democrat http://t.co/1V8DqQWOly #KSSen http://t.co/ux2f0liCcB RT @GOP: Greg Orman: Staffed by Democrats, funded by Democrats, has donated to Democrats, is the de facto Democrat. http://t.co/NFoCy7Y9KL  RT @TPM: Koch brothers tag Kansas independent Senate candidate as closet Democrat http://t.co/1V8DqQWOly #KSSen http://t.co/ux2f0liCcB RT @Taniel: The tough math: If Democrats lose Pryor and Begich, as PPP suggests they will, they pretty much need Greg Orman to get to 50 se RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic RT @cynthia4877: GOP desperately trying 2 save KS Senate seat. Polls show Independent Greg Orman leading GOP Pat Roberts.

http://t.co/iUq RT @bjs5555: We DO in the KANSAS Senate Election WANT to VOTE for the Independent Greg Orman @OrmanForSenate to Defeat GOP/TEA Senator Pat  Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to ind... http://t.co/8v3BEqiMH5 Senator Bob Dole on Greg Orman to ABC News: "The guy is a Democrat masquerading as an Independent" #kssen Afraid of losing the Senate seat in their home state, the Koch brothers are on the air against Greg Orman. http://t.co/NBhfEVhSKm #KSsen Hey, there's an easy way for Greg Orman to PROVE that he's truly independent!

...Get Sarah Palin to stump for him. RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. Questions for Greg Orman -- https://t.co/ptxsjXbj3J #kssen Sources: Wolf weighs Orman endorsement: The tea party candidate is considering some politi... http://t.co/O7o6MolaIt #politics #dem #gop RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not Kansas Senate Candidate Greg Orman's Scam: A Democrat by any other name | Power Line http://t.co/VDjglFgraP Wikipedia page Greg Orman has possibly been vandalized. http://t.co/0kiCMVAW7d Which party would get Kansas independent Greg Orman's vote? #NewsVideos http://t.co/NpcTOjyI3B The face Harry Reid had when he heard Greg Orman will run as a "independent".

#KSSen http://t.co/nq9XYGdjQG Sources: Milton Wolf weighs Greg Orman endorsement http://t.co/NJnKr5iBrx via @POLITICO - would ruin Roberts, and Orman's I streak Koch Brothers Tag Kansas Indy Senate Candidate As Closet Dem http://t.co/Vfdl4WOvvb US SENATE  KANSAS (Rasmussen)
 Greg Orman (I) 45%
 Pat Roberts (R-inc) 40% One can only hope Vote #Democratic  RT POLITICO @politico  now
Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/ryaYiyEwVh RT @ivn: Politics is not something that was intended to take over your life..." - @OrmanForSenate http://t.co/2mobdxAl7a Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO http://t.co/TyTwD3eVF8 #palin #teaparty RT @politico: Orman-Wolf meeting canceled: http://t.co/busOLLvIfB #KSSen Koch Brothers Tag Kansas Indy Senate Candidate As Closet Dem: The Koch brothers are coming hom... http://t.co/FkCYdMnmzg #politics #news RT @darlene09465021: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts... http://t.co/LEoecSJeFb RT @irin: Both sitting KS Senators have 100% ratings from National Right to Life. Here's Greg Orman's position: http://t.co/m99kktYUVQ If he wins, @OrmanForSenate could become one of the richest Senators in Congress, notes @KWCH12, citing our data: http://t.co/F2L1dFchlK RT @nrlc: #KSSen: Greg Orman would be one more pro-abortion, anti-life Democrat http://t.co/y0S2knYslm #prolife http://t.co/w0GIYhCUdw Greg Orman's response to Pat Roberts' attack commercial, though. #OrmanforSenate #favoritepoliticianever Pat Roberts and Greg Orman see several issues differently in the U.S http://t.co/FHDoTwNEm4 | http://t.co/NoFij4iACl #news He ran as one in 2008. RT @TPM: Koch brothers tag Kansas independent Senate candidate as closet Democrat http://t.co/HBFx9lzHAH #KSSen John McCain campaigns with Pat Roberts, says Greg Orman looks like a Democrat http://t.co/9faezJj3tJ via @BeforeItsNews RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @APjdhanna: Independent Senate candidate Greg Orman discloses owning between $21.5M and $86M in assets. http://t.co/aZwiTUM8zW #kssen #k Googled a GOP Senator to confirm campaign website. First result? Greg Orman for Senate. One of these things is not like the otherrrr. #Kansas Greg Orman calls himself a (I) but takes $ from #Dems which in my book makes him a (D): #KSsen #KansasCity http://t.co/LOo48CirVg RT @charlieNPR: Greg Orman, painfully above the fold in Kansas capital paper. #kssen

http://t.co/NBVqE0ZF2e RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t Will: High stakes in Kansas Senate race: SHAWNEE, Kan. :  Tacked to the wall of Greg Orman's campaign office i... http://t.co/dbnyFbYuCA RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Kansas Ballots Will be Mailed Without Democratic Senate Nominee: Kansas Secretary of State... http://t.co/yY266ewONY #dem #gop #politics RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @allahpundit: Sources: Milton Wolf may endorse Pat Robertss independent opponent http://t.co/Cie9hmVtCX ok someone please explain KS to me?  the gop is backing greg orman the independent to take the incumbent down in a red state whats that pic? RT @politico: "There is no consideration of a Wolf endorsement for Orman," one source said. http://t.co/TnGvsS83Mx in an interview on the @CBSEveningNews, Greg Orman (@OrmanForSenate) says he'd caucus with whichever party has the majority. #kssen Where is Orman hiding? First person to tweet photo of him at public event in KS will win a t-shirt. Use #WheresOrman. http://t.co/PaifeU2os4 Kansas takes center stage: Sen. Pat Roberts is facing an unexpectedly strong challenge from independent Greg O... http://t.co/IiDsYT4CNQ Kansas Senate candidate would rank among richest in Washington if elected: Greg Ormans net worth between $21.... http://t.co/a1T6uwTgSN RT @LPDonovan: Greg Orman's new DSCC handlers scrub Veoh account, try to whitewash his liberal, Nickelback-loving past #neverforget http:// RT @EagleGraphs: "Greg Orman is not a Democrat" is the new "ISIS is not Islamic" - people in Kansas will not be fooled #KSSen Greg Orman is a Liberal,  working hard to deceive the people of Kansas.  A deceitful Leftist. How odd @OrmanForSenate Kansas takes center stage http://t.co/jeToNetvE7 "@politico: Orman-Wolf meeting canceled: http://t.co/whqisSSxlZ #KSSen" RT @HouseCracka: Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSA RT @LaCivitaC: Where is Greg orman hiding? And more importantly why?   #Cayman Islands baby.. RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Democratic candidate running for senate dropped out and now Dems. are hoping Greg Orman joins the party in the senate@LAHSAseniors Good RT @allahpundit: Sources: Milton Wolf may endorse Pat Robertss independent opponent http://t.co/wQzY1Kb0eH Report: Ormans assets top $21M: Greg Orman on Monday released a copy of the financial disclosure report that... http://t.co/PI1qDBPNs2 Sarah Palin says Greg Orman trying to 'snooker' Kansas voters - http://t.co/RNSEUyvXAP http://t.co/ZVvF7IuM2v #palin #teaparty .@KSAGOffice asks to join KS Senate ballot lawsuit #Roberts #Orman #Taylor #campaign2014 http://t.co/cc9T8AUY6K Independent Senate Candidate Draws Scant Democratic Support http://t.co/mh1IdSRms5 #PAID RT @TPM: Koch brothers tag Kansas independent Senate candidate as closet Democrat http://t.co/1V8DqQWOly #KSSen http://t.co/ux2f0liCcB Greg Orman: The Most Interesting Man in Politics This November http://t.co/M4d1TAWkiZ via @NBCNews Readers share thoughts on President Obama, Greg Orman and Metro North Mall - Kansas City Star http://t.co/7ymoOMwd0b Kansas Court Ruling Is a Victory for Greg Orman http://t.co/U2j7caQChs via @RCP_Articles RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/8B5qZKlCPT Kansas takes center stage http://t.co/G4QtuVfZs8 LOL MT @Timodc: Congrats to top-notch DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Greg Orman. RT @APjdhanna: Independent Senate candidate Greg Orman discloses owning between $21.5M and $86M in assets. http://t.co/aZwiTUM8zW #kssen #k RT @kansasdotcom: Pat Roberts releases documents tied to Greg Orman's role in 2012 trial of business associate http://t.co/9rGXi0aLmL (@Bry RT @shiracenter: #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/JMbAjDmVTl #alert RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C RT @Vision4USA: RT: Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http: Attack ads miss the point about U.S. Senate candidate Greg Orman http://t.co/2iZVnKGDFL #cosmo #women #VoteBlue except Kansas #vote #independent for Greg Orman Save the #senate #newhampshire reject #phony Scott Brown #DemWomen RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C #TopNews: Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star http://t.co/izV4wcl4Eq RT @TPM: Koch brothers tag Kansas independent Senate candidate as closet Democrat http://t.co/1V8DqQWOly #KSSen http://t.co/ux2f0liCcB RT @jameshohmann: The Orman-Wolf meeting was canceled after @politico reported it was happening. Update by @mkraju &amp; @politicoalex: http:// RT @HouseCracka: Sarah Palin says Greg Orman trying to snooker Kansas voters | The Wichita Eagle - http://t.co/maWaAOOws2 RT @MikeLoBurgio: Nate Silver has Greg Orman favored to win Kansas #senate seat http://t.co/ZJ8XoSZ05R @OrmanForSenate @GOP #ksleg #p2 http how can these people be for greg orman in KS, he is no Republican https://t.co/COo9Dw3Y6w RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr RT @nrlc: Clear contrast between @PatRoberts2014 and Greg Orman in the #KSSen race! #WeVoteProLife http://t.co/alfPexJ17Z RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/jFRrJ7hMIl RT @KStatePatriot: Hey @HouseCracka, ICYMI Greg Orman's New Silks company has ties with George Soros.

#KSSen http://t.co/HDdzEOK9eZ #investments Greg Orman discloses assets, investments worth millions - http://t.co/vk9mmQA76R http://t.co/saTEpT9Q5Y Pat Roberts and Greg Orman see several issues differently in the U.S. Senate   Kansas CityStar http://t.co/Rla5CXymTp RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems. Don't be f RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems. Don't be f RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to ind... http://t.co/ghRhFksQz8 Politico Sources: Wolf weighs Orman nod - The tea party candidate is considering some political payback by endorsi... http://t.co/rKu4xRQiYQ Orman-Wolf meeting canceled http://t.co/RzMTcYdgo7 #UniteBlue RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http Simple choice for Kansans: support a man who has been in DC since 1980 and doesn't even live in Kansas, or Greg Orman, the independent. A new Rasmussen survey in Kansas finds Greg Orman (I) leading Sen. Pat Roberts (R) for U.S. Senate, 45% to 40%. RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @GOP: Greg Orman: Staffed by Democrats, funded by Democrats, has donated to Democrats, is the de facto Democrat. http://t.co/NFoCy7Y9KL  RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. Orman-Wolf meeting canceled http://t.co/RIR3AkfknP via @POLITICO Sources: Wolf weighs Orman endorsement http://t.co/QxQd9Cjn9f RT @BDayspring: Wow. MT @Timodc Congrats to DNC/DSCC operative @mikephillips1 on new role as spox for Democrat, "Independent" Greg  RT @HouseCracka: Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSA Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to independent and it running... @SpecialReport What a slimey rich democrat Greg Orman is! Pretending to be 'independent'! Independents are just democrats in hiding! Beware! @WeWhoVote @EqualityRising_ pray independent Greg Orman, who Dems believe has a better shot at defeating Roberts than their own candidate. #News Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas C... http://t.co/sXfGTyHxWN Va @Google RT @rubycramer: in an interview on the @CBSEveningNews, Greg Orman (@OrmanForSenate) says he'd caucus with whichever party has the majority In #KSsen Chad Taylor's lawyer was top DSCC lawyer. Greg Orman's spox a fmr top staffer to DSCC Chairman. Notice a trend? Kansas takes center stage: Sen. Pat Roberts is facing an unexpectedly strong challenge from independent Greg O... http://t.co/lkLB0Jnout RT @mollyesque: I went to Kansas to see what this Greg Orman character is all about http://t.co/i0qEEVrSbq Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? http://t.co/xgYtrHuW0N via @feedly RT @KCStar: If elected, Greg Orman of Kansas would be among richest U.S. senators: http://t.co/hR8BZQoau4 Greg Orman is just another 0bama fluffer. RT @bktx24051: Meet Greg Orman; running as an Independent in Kansas. Wolf in sheep's clothing. 
http://t.co/vng0MF2ZSz Orman-Wolf meeting canceled: http://t.co/busOLLvIfB #KSSen RT @Ross_7_7: Pat Roberts / Greg Orman Debate, Hutchinson KS Part 2: http://t.co/zcBn0fbaNO via @YouTube Sarah Palin says Greg Orman trying to 'snooker' Kansas voters - http://t.co/RNSEUyvXAP http://t.co/5cofTyJpSb #palin #teaparty Tea Party guy running in Kansas Senate race could back Greg Orman
http://t.co/o80N2KwNvi RT @HouseCracka: Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSA Greg Orman is trying to keep up a nonpartisan image, but he's getting assists from national and KS Dems http://t.co/gPZ9xksbQd RT @CharlesWheelan: Greg Orman, centrist Senate candidate in Kansas, is "the most interesting man in politics."

http://t.co/WB8PNrxBlx On the road in Kansas, it's clear Pat Roberts could lose. Our in-depth look at his uphill battle http://t.co/iJMyvh3bMQ w @bendmayer RT @georgewillf: Greg Orman wants to deny Pat Roberts a fourth Senate term, thereby ending a congressional career that began in 1981 http:/ RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. Independent Senate Candidate Shown Little Love http://t.co/BdtdUxVQGX RT @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/lt0J1KSiEC Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2CKpI9 RT @BDayspring: Liberal Greg Orman Gets Backing from Dem Super PAC  http://t.co/ocIsbdqrvZ #KSsen Koch Brothers Tag Kansas Indy Senate Candidate As Closet Dem: The Koch brothers are coming hom... http://t.co/FkCYdMnmzg #politics #news "A vote for Greg Orman is a vote for Obama" HHAHhahahahaHhahh ?? RT @HouseCracka: Kansas Wake Up! Greg Orman is BIG TIME Democrat Donor! He is NOT an Independent! Look at these donations! #kssen http://t. RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Greg Orman, or 6th Romney son? RT @Vision4USA: RT: Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http: RT @BDayspring: In #KSsen Chad Taylor's lawyer was top DSCC lawyer. Greg Orman's spox a fmr top staffer to DSCC Chairman. Notice a trend? I really hope I see more Greg Orman promoted tweets on my TL Greg Orman: Pat Roberts "not representing" Kansas interests: Greg Orman, an independen... http://t.co/8ruLZHIfB1 #AJBlackston.com #Bombshell - Washington Post writes: "Greg Orman hiring of former @DSCC hand highlights personnel predicament" 

#Kssen OUCH: Milton Wolf to endorse @SenPatRoberts opponent http://t.co/6qekSL4bed RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic RT @mmurraypolitics: Why Greg Orman in Kansas could be the most interesting man in politics this November http://t.co/NmFzcixSCj MT@LACaldwellDC: Palin just applauded her husband for being a  independent then slammed Greg Orman...

Why does anyone care what she says? RT @dylanlscott: Wanna know why Greg Orman doesn't need party support? He's worth more than $21 million: http://t.co/53NGBmrG9O #KSSen RT @nrlc: We stand with @PatRoberts2014 in the #KSSen race! Greg Orman would be another pro-abortion vote for Obama and Reid: http://t.co/m BREAKING: Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... ... http://t.co/BI6HvnLzYv #Khaatumo #Khatumo RT @BDayspring: In #KSsen Chad Taylor's lawyer was top DSCC lawyer. Greg Orman's spox a fmr top staffer to DSCC Chairman. Notice a trend? Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? http://t.co/fbF9EByQcI http://t.co/lNcTdZ8XFR #travel #travelnews Pat Roberts and Greg Orman see several issues differently in the U.S. Senate   Kansas City Star http://t.co/kz8F2QVCjt RT @Drew_FV: Increase in 3+ candidate races highlights need for #RCV http://t.co/PDKkugWycP via @cbsnews If I lived in Kansas I would vote for Greg Orman. Better him than Roberts who is supported by McCain. RT @Taniel: what a headline to get... #KSSen RT @charlieNPR Greg Orman, painfully above the fold in Kansas capital paper. http://t.co/Qomzb RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @SarahPalinLinks: Greg Orman contributed $4,600 to Barack Obama.  He contributed $9,400 to the Kansas Democrat Party.  Twitter won't let Sarah Palin says Greg Orman trying to 'snooker' Kansas voters - http://t.co/RNSEUyvXAP http://t.co/qw98LuAGAT #palin #teaparty .@RobertJDole You said "Greg Orman is not Bob Dole", ok whatever, but guess what @PatRoberts2014 is not a Kansan anymore #kssen #ksleg Not that it's a huge factor, but Greg Orman's campaign website might be the best one I've ever seen, and it's 300x better than Roberts'. Tony's Kansas City: RICH WHITE GUY RUNNING FOR CONGRESS!!! GREG ORMAN HAS GOT WAY MORE MONEY THAN YOU!!! http://t.co/QoGkSrEAP5 via Is Pat Roberts' conservative primary challenger in Kansas going to back Greg Orman? ~via Hot Air #TCOT http://t.co/a3wE6dKxgF RT @rollcall: #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/Gbh9u719Um #alert If elected, Greg Orman would be one of the wealthiest members of the Senate. http://t.co/4bhV59b12v @Taniel @kkondik If Orman doesn't make the pledge, he will lose easily as state bites its lip &amp; sends a R back to the Senate, even this 1. Greg Orman you're a democrat stop claiming to be an independent  #sickofyourshit RT @LifeNewsHQ: RT @nrlc #KSSen: Greg Orman would be one more pro-abortion, anti-life Democrat http://t.co/8Jqe7NmW6i  #prolife RT @Politics1com: KS USSEN (Rasmussen): Greg Orman (I) 45%, Pat Roberts (R) 40%. RT @GroverNorquist: Greg Orman is running for Senate in Kansas because Nevada needs another Senator.      Greg Orman: Harry Reid's other vo RT @PsMartyFreeman5: Finally, the Eagle clarifies today that Greg Orman does support abortion and same sex marriage. Who would he caucus wi RT @CentProj: Greg Orman is "the most interesting man in politics." Help spread the word about this campaign! #kssen #CenterStands http://t Greg Orman is running for Senate in Kansas because Nevada needs another Senator.      Greg Orman: Harry Reid's other vote. Meet Greg Orman; running as an Independent in Kansas. Wolf in sheep's clothing. 
http://t.co/vng0MF2ZSz RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman?: Kingmaker. 
The Republica... http://t.co/eb1MJwqEF0 RT @mkraju: #KSSEN news: Milton Wolf may endorse Orman if he caucuses with GOP; two will meet Friday. w/@politicoalex. http://t.co/E69qTdZR RT @ThaBigPurn: Greg Orman for Senate. Get Ole man Roberts out of here. #Kansas Sources: Wolf weighs Orman endorsement: The tea party candidate is considering some political payback by... http://t.co/QNDyw7DXoO p #P2 RT @Croatansound: #Kansas Greg Orman calls himself a (I) but takes $ from #Dems which in my book makes him a (D): #KSsen #KansasCity http:/ @simhistory your man Greg Orman might be the first Independent senator to be elected to the Senate from the state of Kansas RT @KStatePatriot: #ProLife RT @nrlc: Clear contrast between @PatRoberts2014 and Greg Orman in the #KSSen race! #WeVoteProLife http://t.co/ Breaking the hearts of those odd conservatives who hope Dems hold the Senate, Wolf won't formally back Orman http://t.co/apKvPQLVM7 RT @lheal: Every Democrat Senate candidate (including Greg Orman, Democrat from Kansas) would vote for Harry Reid as Senate Majority Leader. Sarah Palin says Greg Orman trying to snooker Kansas voters | The Wichita Eagle - http://t.co/maWaAOOws2 RT @KCStar: Nate Silver has Greg Orman favored to win Kansas senate seat: http://t.co/8GcxwPadwQ Greg Orman is "the most interesting man in politics." Help spread the word about this campaign! #kssen #CenterStands http://t.co/CDbdqRUlKN RT @FollowPalin: Sarah Palin says Greg Orman trying to 'snooker' Kansas voters - http://t.co/RNSEUyvXAP http://t.co/qw98LuAGAT #palin #tea RT @LPDonovan: That's curious- "independent" Greg Orman shares a pollster with the DSCC (DCCC &amp; DNC.) Convenient backchannel for #s. http:/ RT @SarahPalinLinks: Greg Orman contributed $4,600 to Barack Obama.  He contributed $9,400 to the Kansas Democrat Party.  Twitter won't let greg orman looks so much like mark ruffalo it's a little distracting. RT @sherifffruitfly: RT @TPM What exactly are Democrats getting with Kansas independent Greg Orman? #KSSen 

// ability for Obama to get ju RT @Vision4USA: RT: Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http: RT @CentProj: Greg Orman is "the most interesting man in politics." Help spread the word about this campaign! #kssen #CenterStands http://t RT @RBPundit: OH FOR FUCKS SAKE RT @EdB_Ohio: @RBPundit At least she's in Roberts' (KS) corner. Look what's happening there. http://t.co/c RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C RT @rollcallpols: #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/GM8m9nwNQc #alert RT @themotheriam: Pat Roberts / Greg Orman Debate, Hutchinson KS Part 2: http://t.co/HqKRp1cMdF via @YouTube RT @kasie: On the road in Kansas, it's clear Pat Roberts could lose. Our in-depth look at his uphill battle http://t.co/iJMyvh3bMQ w @bendm RT @nrlc: We stand with @PatRoberts2014 in the #KSSen race! Greg Orman would be another pro-abortion vote for Obama and Reid: http://t.co/m RT @HouseCracka: Sarah Palin says Greg Orman trying to snooker Kansas voters | The Wichita Eagle - http://t.co/maWaAOOws2 RT @bjs5555: In #KS, for strategic reasons, our (D) candidate dropped out of the Senate race to BACK Ind Greg Orman to beat Tea Sen Roberts Who is Greg Orman? Just another yes vote for Obama's failed agenda. https://t.co/zh2ZAQmVHA #kssen #ksleg #kansas After a slew of pol ads from KS the winner is? Greg Orman. His was best. Speaks to camera effortlessly. Message is spot on for Independent. #finance #financenews Greg Orman: The Most Interesting Man in Politics This November  http://t.co/yLcXl5GZXh http://t.co/DJqaGAvShg RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  @miltonwolfmd Please help Republicans get rid of Harry Reid. Don't aid stealth Democrat Greg Orman. RT @rollcall: #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/Gbh9u719Um #alert Documents add layer to bond of U.S. Senate candidate Greg Orman &amp; felon
 http://t.co/SEgBXkOXUa RT @LeonoraInterssa: Sources: Wolf weighs Orman nod  via @josephjett #politics http://t.co/p3t8FiyEKO Kansas Ballots Will Be Mailed Without Democratic Senate Nominee http://t.co/TPqw1eo24T via @rollcall RT @Croatansound: #Kansas Greg Orman calls himself a (I) but takes $ from #Dems which in my book makes him a (D): #KSsen #Wichita #TCOT htt RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre RT @PoliScrutiny101: "In Kansas, Roberts fights for his seat  and the Senate" http://t.co/REURA6zbKt #msnbcdiscuss Is Pat Roberts conservative primary challenger in Kansas going to back GregOrman? http://t.co/ZIpnEYTOXJ Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? http://t.co/qeuoDKguSY Remember, Greg Orman is "Independent". cc @APjdhanna @ajjaffe @raginkansan @stevekraske
http://t.co/vCrUt9SDFM #kssen http://t.co/yztb8g2xkz Wolf and Orman scheduled to meet today but an endorsement will only come if Orman agrees to join Rs http://t.co/PJIt9xh8mU RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre RT @KCStar: If elected, Greg Orman of Kansas would be among richest U.S. senators: http://t.co/hR8BZQoau4 Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to ind... http://t.co/xxFOvq864p RT @AP_Politics: Kansas independent US Senate candidate Greg Orman discloses between $21.5 million and $86 million in assets. http://t.co/n RT @HouseCracka: Greg Orman in Kansas is huge Democrat Donor. @FoxNewsSunday covers up the lies. He is not an independent. He is a donkey. @Taniel If Greg Orman is seat number 50, Chad Tayor needs to be given some kind of award. RT @Ross_7_7: Pat Roberts / Greg Orman Debate, Hutchinson KS Part 3: http://t.co/S4u4dG9jpf via @YouTube RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic RT @bjs5555: In #KS, for strategic reasons, our (D) candidate dropped out of the Senate race to BACK Ind Greg Orman to beat Tea Sen Roberts RT @ivn: Politics is not something that was intended to take over your life..." - @OrmanForSenate http://t.co/2mobdxAl7a Greg Ormans net worth wud place him among wealthiest senators if electd  #CombatBrands #period #scrutiny #Sen Greg Orman maintains professional ties with ex-Goldman Sachs board member convicted of securities fraud http://t.co/FrbWkDY2DK #KSSen Term limits Hutchinson News In a sense, the Pat Roberts-Greg Orman U.S. Senate race is about term limits(#bbcQT . V http://t.co/0wplHra2Tc Does Greg Orman get most of his money from Democrat sources? #politi cs RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @dhellingkc: Greg Orman claims assets worth between $21.53 million and $85.96 million in first disclosure; annual income btwn $917,290 a Sarah Palin says Greg Orman trying to 'snooker' Kansas voters - http://t.co/RNSEUyvXAP http://t.co/diSgvt8Ael #palin #teaparty RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Meet Greg Orman, the Most Interesting Man in Politics http://t.co/mszObM1iNz Orman-Wolf meeting canceled http://t.co/6c9oGoLsVF Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? - Hot Air http://t.co/FkmXJQdHwL #tcot #oip #uniteblue RT @HouseCracka: Kansas is being duped. Greg Orman is a BIG Democrat Donor. Here is just one of his donations to:
Obama for America. http:/ RT @charlieNPR: Greg Orman, painfully above the fold in Kansas capital paper. Meanwhile, Roberts hasnt polled over 42 since primary http:// Here's what happens when TP candidates lose, they give credence to LIBS! http://t.co/heYLPtpPap Worth noting, @kyledcheney and @mkraju, that Jim Slattery was Pat Roberts' 2008 Democratic opponent. http://t.co/J2Xtdjgx5T #KSsen RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. The Senate kingmaker? @billscher &amp; @mattklewis on the potential power wielded by independent KS candidate Greg Orman. http://t.co/8Y9doIk4du Sources: Wolf weighs Orman endorsement: The tea party candidate is considering some political payback by endor... http://t.co/hixqb8JxRa RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @WoodyPfister: Greg Orman @OrmanForSenate is a Harry Reid/Nancy Pelosi #Democrat #kssen He'll vote to conf #EricHoldersNextJob to Suprem RT @ThePlumLineGS: Greg Orman says he will caucus with whoever has clear majority. (1/2) @Rogue_Beaver @BrianRoastbeef @politicobsessed In reference to this btw: http://t.co/D88m0rziGZ RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems.  Don't be  Nate Silver has Greg Orman favored to win Kansas senate seat: http://t.co/8GcxwPadwQ Why You Should Hope Greg Orman Wins http://t.co/HfEXyucMph RT @kansansforlife: Kansas Gov. Brownback &amp; Sen. Roberts are pro-life. Opponents Paul Davis &amp; Greg Orman are not. http://t.co/6ElOyfDDcP #p Pat Roberts releases documents related to Greg Ormans role in business associate's trial http://t.co/KkiKdvvpIL Dear Kansa: If you vote for Greg Orman you are voting for a democrat DONT DO IT HE IS MORE OF THE SAME OBAMACARE NIGHTMARE #tcot RT @JimmyPrinceton: Wolf needs to fall in line, now. RT @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/HKs RT @CarrieNBCNews: In today's @NBCFirstRead : Greg Orman: The most interesting man in politics this November. http://t.co/zNM9GRCLPD Greg Orman for Senate. Get Ole man Roberts out of here. #Kansas An insider says Wolf won't support Orman in #KSSen race: http://t.co/lt0J1KSiEC top news: Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star:... http://t.co/ft0gQdMnXE Even MSNBC is calling Greg Orman a Democrat. https://t.co/LTfcLPSWpx #kssen #ksleg Vote Pat Roberts. #kansas RT @darlene09465021: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts... http://t.co/LEoecSJeFb RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @KCStar: Nate Silver has Greg Orman favored to win Kansas senate seat: http://t.co/8GcxwPadwQ In Kansas, GOP Sen. Pat Roberts fights for his seat - and control of the US Senate: http://t.co/hthDeFzjEO RT @MichaelLaRosaDC: Kansas Ballots Will be Mailed Without Democratic Senate Nominee http://t.co/LelNutab3N via @rollcall #KSSEN RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t This article actually refers to independent candidate for #KSsen Greg Orman as the "front-runner." Under microscope.  http://t.co/vfrYg5Zlcd RT @mjbeckel: Independent Greg Orman lures left-leaning donors in #KSSEN despite uncertainty about whether he'll caucus with Dems http://t. The Senate kingmaker? @billscher &amp; @mattklewis on the potential power wielded by independent KS candidate Greg Orman. http://t.co/8Y9doIk4du Senate candidate Greg Orman's business, political interests run wide - Kansas City Star http://t.co/PlHuIjvAWg What Exactly Are Dems Getting With Kansas Independent Greg Orman? @TPM http://t.co/6kYU6DQIE2 RT @bjs5555: In #KS, for strategic reasons, our (D) candidate dropped out of the Senate race to BACK Ind Greg Orman to beat Tea Sen Roberts RT @dylanlscott: Wanna know why Greg Orman doesn't need party support? He's worth more than $21 million: http://t.co/53NGBmrG9O #KSSen RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre RT @KCStar: Greg Orman's net worth would place him among wealthiest senators if elected: http://t.co/KVN0HY1S32 RT @lheal: Every Democrat Senate candidate (including Greg Orman, Democrat from Kansas) would vote for Harry Reid as Senate Majority Leader. RT @CentProj: Greg Orman is "the most interesting man in politics." Help spread the word about this campaign! #kssen #CenterStands http://t RT @DrewMTips: Greg Orman might be in trouble. The NRSC has decided to treat him like he's a conservative. 

http://t.co/GE1pkAEsw3 Koch Brothers Tag Kansas Indy Senate Candidate As Closet Dem: The Koch brothers are coming hom... http://t.co/QX4YqKqyti #politics #news RT @CNMNewz: Is Pat Roberts conservative primary challenger in Kansas going to back GregOrman? http://t.co/Jt0jUqDDhs RT @jameshohmann: The Orman-Wolf meeting was canceled after @politico reported it was happening. Update by @mkraju &amp; @politicoalex: http:// Sarah Palin says Greg Orman trying to snooker Kansas voters http://t.co/YiryPfHUtr RT @wbdamron: Wow. George Will on Fox News All-Star discussion just said KS Senate race is "Orman's to lose."  #kssen RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  MT @alex_mallin: Who will Greg Orman caucus with? Same "?" was asked of @SenAngusKing in 2012. He didn't answer until a week after elected. RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @evarnado1: @Conserv_Report @RonPaul when did I say I support orman? I oppose the known liberal (Roberts) &amp; the suspected one (orman). B RT @BaracksBackers: Rove throws the gauntlet down on Greg Orman knowing #PatRoberts is so despised and hated in #Kansas only chance is to d RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr The hell? RT @AoSHQDD: New #KSSEN Poll: Orman (I)* 45%, Roberts (R) 40% http://t.co/h4RDtdrh6N RT @jmartNYT: Milton Wolf, M.D., is having some fun getting even for stores about his Facebook habits http://t.co/55FZHxHjzC RT @sherifffruitfly: RT @TPM What exactly are Democrats getting with Kansas independent Greg Orman? #KSSen 

// ability for Obama to get ju From @AmericaRising ... Open Questions For Kansas Senate Candidate Greg Orman https://t.co/xA8HE46Z98 RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C Milton Wolfe will endorse Greg Orman if he caucuses GOP. And I thought Wolfe's naivety couldn't surprise me any more. RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr RT @mkraju: #KSSEN news: Milton Wolf may endorse Orman if he caucuses with GOP; two will meet Friday. w/@politicoalex. http://t.co/E69qTdZR RT @KStatePatriot: It's ironic that Greg Orman associates himself w/ Senator Angus King, who caucuses with the Democrats. 

#kssen 
http:// cc @bennyjohnson MT @miltonwolfmd:Sorry to disappoint media theres no meeting with Greg Orman and I dont have plans to make an endorsement RT @lheal: Every Democrat Senate candidate (including Greg Orman, Democrat from Kansas) would vote for Harry Reid as Senate Majority Leader. RT @GEGOPS: Greg Orman donated $1000 to Harry Reid, $4600 to Obama $4600 to Hillary $9400 to KS Dem Committee #kssen #kansas #ksleg #ksgop Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? - Hot Air http://t.co/jm4m2LVt19 #tcot Sources: Wolf weighs Orman endorsement http://t.co/iFHDCc6DEK via @politico RT @EchelonInsights: Adding #KSSEN to #InsightsOnAir Senate track. Greg Orman has 55% of the spots slated to air in next 3 weeks. http://t. RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star: Kansas Ci... http://t.co/UkkQfG8Mqz U.S. Senate Candidate Greg Orman of Kansas has pledged to be an independent [who] wont answer to either party.  http://t.co/rQyNycuTIe RT @rollcall: Kansas overseas election ballots will be sent out without listing a Democratic Senate nominee http://t.co/Gbh9u719Um via @ale George Will weighs in on enigma  of Greg Orman in #Kansas Senate race. Seems impressed, if wary. http://t.co/D3SD1c1xE2 RT @mikeparanzino: Conservatives should rally around KS Sen Pat Roberts against Harry Reid-vote dishonest Democrat Greg Orman http://t.co/y Its not that the democrats have a few ideas; Its just a question of Honesty. As Stealth Democrat Kansas senator I.C. Greg Orman demonstrates RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @Vision4USA: RT: Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http: RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/jFRrJ7hMIl RT @DrewMTips: Greg Orman might be in trouble. The NRSC has decided to treat him like he's a conservative. 

http://t.co/dHial0dDqC John McCain claims that independent candidate Greg Orman is a Democrat who wont admit it.  Many say the same of McCain. #tlot #Tcot #p2 RT @TeaPartyNevada: UPDATE: Sarah Palin says Greg Orman trying to "snooker" Kansas voters in Senate race vs Pat Roberts http://t.co/UeDePO2 Pat Roberts / Greg Orman Debate, Hutchinson KS Part 1: http://t.co/tA2ZhgDjoj via @YouTube #KSSen candidate Greg Orman claiming he's independent, yet has hired a veteran Democrat aide to be his spokesperson.  http://t.co/NQTGFdtQz9 RT @partmax: After a slew of pol ads from KS the winner is? Greg Orman. His was best. Speaks to camera effortlessly. Message is spot on for RT @GroverNorquist: Greg Orman is running for Senate in Kansas because Nevada needs another Senator.      Greg Orman: Harry Reid's other vo RT @PatRoberts2014: Read the truth about Greg Orman: http://t.co/NiNc50Vees #kssen RT @CentProj: Greg Orman is "the most interesting man in politics." Help spread the word about this campaign! #kssen #CenterStands http://t RT @USRealityCheck: Sources: Wolf weighs Orman endorsement: The tea party candidate is considering some political payback by... http://t.co RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems. Don't be f Ich habe ein @YouTube-Video positiv bewertet: http://t.co/sDZRWbqviI Pat Roberts / Greg Orman Debate, Hutchinson KS Part 1 30 min interview w/Greg Orman now airing on KTWU-PBS show, IGA (was filmed on Sep 17th). Interesting. @TheFix RT @kckansascity: Attack ads miss the point about U.S. Senate candidate Greg Orman http://t.co/2iZVnKGDFL RT @joshtpm: What Exactly Are Dems Getting With Kansas Independent Greg Orman? @TPM http://t.co/7lLGtIwHC9 Greg Orman is whoever you want him to be! RT @adrian_gray: WaPo, 538, NYT, &amp; HuffpPo models all give GOP 58-65% chance of winning Senate (and Greg Orman single-handedly renders them Greg Orman is really rich http://t.co/CfYhettolA RT @peggyllowe: Orman and Wolf meeting is off, apparently, and Wolf won't endorse Sen. Roberts' opponent. http://t.co/YUOVpqTeS2 #kssen RT @KWCHLauren: Greg Orman releases his financials; net worth in the millions http://t.co/mmhLwZRQPF #KWCH12 Greg Orman's new DSCC handlers scrub Veoh account, try to whitewash his liberal, Nickelback-loving past #neverforget http://t.co/lZj9xQxho3 RT @charlieNPR: Greg Orman, painfully above the fold in Kansas capital paper. Meanwhile, Roberts hasnt polled over 42 since primary http:// An insider says Wolf won't support Orman in #KSSen race: http://t.co/eeXAyD4qwv If elected, Greg Orman of Kansas would be among richest U.S. senators http://t.co/nrGGK4T0Iu RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre Interesting: Greg Orman's campaign blasts out a George Will column. RT @nrlc: Clear contrast between @PatRoberts2014 and Greg Orman in the #KSSen race! #WeVoteProLife http://t.co/alfPexJ17Z Who will Greg Orman caucus with? Same question was asked of @SenAngusKing in 2012. He didn't answer until a week after being elected. RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http Senate Prediction Map back to Dems 47 - GOP 47 - Orman(I-KS) 1; Toss-Ups 5 http://t.co/O3nkQUbfnI RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @msnbc: In Kansas, GOP Sen. Pat Roberts fights for his seat - and control of the US Senate: http://t.co/hthDeFzjEO RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @ProLifePolitics: Milton Wolf would endorse pro-abortion liberal like Orman as long as he caucuses w/ GOP. Because principles? http://t. RT @UpshotNYT: Greg Orman has a real path to victory in Kansas after last night's court decision. This isn't Kentucky. http://t.co/7utVyt5H "96% of Kansans say politicians should support good ideas, not just partisan ideas." http://t.co/8UeVCzXlWZ .@politico @miltonwolfmd sending the #WolfPac to the Independent Kansan  http://t.co/Xpgp8DPaTQ   #ksleg #kssen #kseln Freedom's Lighthouse  Pat Roberts Ad Hammers Phony Independent Greg Orman; Highlights Ormans... http://t.co/TSViG1ySbz RT @bjs5555: In #KS, for strategic reasons, our (D) candidate dropped out of the Senate race to BACK Ind Greg Orman to beat Tea Sen Roberts RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @lheal: Every Democrat Senate candidate (including Greg Orman, Democrat from Kansas) would vote for Harry Reid as Senate Majority Leader. Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star http://t.co/2FcAB9q7hv RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. PAC with ties to Koch brothers launches TV ad attacking Orman in US Senate race in Kansas - http://t.co/ikLj2TUtyS http://t.co/6bIptFXevZ Orman-Wolf meeting canceled http://t.co/ETOcdJfn6U Greg Orman is a DEMOCRAT. When the DEMOCRAT Party is pushing Hard for him, HE IS A DEMOCRAT. Duh RT @Vision4USA: RT: Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http: RT @nrlc: Greg Orman has the same extreme abortion position as Barack Obama. - @CarolTobias1 #kssen #prolife http://t.co/EX2Zw2bXC7 RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre Sources: Milton Wolf weighs Greg Orman endorsement http://t.co/rSjL0eaKYq via @POLITICO George Will on Greg Orman. http://t.co/Q9CnbqHWRS Is Pat Roberts conservative primary challenger in Kansas going to back GregOrman? http://t.co/zSSEanCnCk High Stakes in Kansas - Shawnee, KansasTacked to the wall of Greg Ormans campaign office is a print of a John Ste... http://t.co/NoCGc1RhNH RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @UpshotNYT: Greg Orman has a real path to victory in Kansas after last night's court decision. This isn't Kentucky. http://t.co/7utVyt5H RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @BDayspring: Liberal Greg Orman Gets Backing from Dem Super PAC  http://t.co/ocIsbdqrvZ #KSsen Kansas Ballots Will Be Mailed Without Democratic Senate Nominee http://t.co/Qmz6NznxLQ http://t.co/PXB9JzRQXA #capitolhill RT @ivn: "96% of Kansans say politicians should support good ideas, not just partisan ideas." http://t.co/8UeVCzXlWZ Not as a Roberts man but as a #GOP man, if Wolf endorses anyone but Roberts the term traitor comes to mind. #OneParty
http://t.co/TfVM73PQej Tea Party Milton Wolf to endorse Ind. Greg Orman for Sen KS? http://t.co/4wxejSRdFe @jimgeraghty @johnfund @DanRiehl @rsmccain @EdMorrissey RT @BDayspring: Liberal Greg Orman Gets Backing from Dem Super PAC  http://t.co/ocIsbdqrvZ #KSsen Sources: Wolf weighs Orman endorsement: The tea party candidate is considering some pol... http://t.co/aZTQLQ83a2 http://t.co/5MZ3MJM1CQ Goldman Sachs : Link to jailed investor probed ; Greg Orman set to release financial report  http://t.co/6hMjnMlYQQ $GS RT @GOP: Greg Orman: Staffed by Democrats, funded by Democrats, has donated to Democrats, is the de facto Democrat. http://t.co/NFoCy7Y9KL  Koch Brothers Tag Kansas Indy Senate Candidate As Closet Dem http://t.co/rgxpc3rA8F RT @Toupsfamily: #Kansas Senate Candidate Greg Orman Would be Just Another Pro-Abortion Democrat

#prolife

 http://t.co/r44rhR5veV via @ UPDATE: Sarah Palin says Greg Orman trying to "snooker" Kansas voters in Senate race vs Pat Roberts http://t.co/UeDePO2cGr For the first time, my model now has Sullivan over Begich in #AKsen. Majority would come down to Orman (I-KS) who's still favored. RT @PatrickRuffini: Greg Orman, or 6th Romney son? #Unit3 #minorparties Lexington: Stormin Orman | The Economist http://t.co/FMHCJtNgrd RT @OldHydePark: #DemocraticSen #Going #PublicWorksCommittee If Greg Orman should win in #Kansas, he ... http://t.co/tbgIBykYjB RT @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/eeXAyD4qwv Kansas Ballots Will Be Mailed Without Democratic Senate Nominee | Roll Call | http://t.co/p3VfTNoDAY RT @PsMartyFreeman5: Finally, the Eagle clarifies today that Greg Orman does support abortion and same sex marriage. Who would he caucus wi Listening to Candidate Orman on KTWU-PBS right now it's perfectly clear that Orman is an independent centrist. BTW, Roberts invited, refused Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas ... http://t.co/bz1ykLpVcr #breakingnews #news RT @WoodyPfister: Greg Orman @OrmanForSenate is a Harry Reid/Nancy Pelosi #Democrat #kssen He'll vote to conf #EricHoldersNextJob to Suprem RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. Kansas Wake Up! Greg Orman is BIG TIME Democrat Donor! He is NOT an Independent! Look at these donations! #kssen http://t.co/eYyDhUvpaG Reading: WOLF COULD BACK ORMAN IN KANSAS SENATE RACE HAGANS HUSBAND ... - Politico: WOLF COULD BACK... http://t.co/BqYYgkh4jK @TweetMeMe RT @CabPolitical: The "force me to push the Toss-Ups" prediction now moves to GOP Control: Dems 48 - GOP 51 - Orman(KS) 1 http://t.co/O3nkQ RT @politico: Orman-Wolf meeting canceled: http://t.co/busOLLvIfB #KSSen The Pitch - Greg Orman is really rich - With Democrat Chad Taylor's name now off the ballot, independent candida... http://t.co/sIDoVLilUG RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic RT @ClaireDaviss_FV: Why is ranked choice voting valuable? It would avoid this messy political strategizing. #FairVote http://t.co/XMjefRzN #CombatBrands #Period #Scrutiny #Sen Greg Orman's net worth would place him among ... http://t.co/ECJVBRjtZu RT @Politics1com: KS USSEN (Rasmussen): Greg Orman (I) 45%, Pat Roberts (R) 40%. NyL0.4 Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman?:... http://t.co/7htM6TH6lm #SwaggerDominicano RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems. Don't be f Brownback = broke KS government + higher property taxes. Virginian Roberts wonders who Kansan Orman is? Roberts might know if he lived here. RT @kasie: On the road in Kansas, it's clear Pat Roberts could lose. Our in-depth look at his uphill battle http://t.co/iJMyvh3bMQ w @bendm Sep23 Greg Orman Discloses his Assets http://t.co/NfYwehSkD4 RT @UniteBlueKS: Senate candidate Greg Orman proposes reforms for campaign finance laws http://t.co/wmwPTWKUrc #UniteBlue #kssen RT @CentProj: Greg Orman is "the most interesting man in politics." Help spread the word about this campaign! #kssen #CenterStands http://t Attack ads miss the point about U.S. Senate candidate Greg Orman http://t.co/V216oT6Fyv Kansas independent US Senate candidate Greg Orman discloses between $21.5 million and $86 million in assets. http://t.co/nmRNdEVrv7 U.S. Senate candidate Greg Orman in Wichita today speaking to the African American community. I don't believe... http://t.co/VfNP9uuY07 OH, PLEASE DONT:  Sources: Milton Wolf weighs Greg Orman endorsement.  I can understand a gr... http://t.co/3NQMOccAgK via @instapundit RT @kjon: "A vote for Greg Orman is a vote for @BarackObama" - Great new ad from Freedom Partners #KSsen https://t.co/NigPvV49Fc RT @bktx24051: Meet Greg Orman; running as an Independent in Kansas. Wolf in sheep's clothing. 
http://t.co/vng0MF2ZSz RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic If Greg Orman should win in Kansas, he would hold leverage in Washington - Kansas City Star http://t.co/St57ogkHor #washington RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t Orman-Wolf meeting canceled: An insider says Wolf won't support Orman. http://t.co/PAdkL1qwb4 http://t.co/5MZ3MJM1CQ That's curious- "independent" Greg Orman shares a pollster with the DSCC (DCCC &amp; DNC.) Convenient backchannel for #s. http://t.co/2VEy0p6rdr RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @HouseCracka: Sarah Palin says Greg Orman trying to snooker Kansas voters | The Wichita Eagle - http://t.co/maWaAOOws2 RT @CabPolitical: Senate Prediction Map back to Dems 47 - GOP 47 - Orman(I-KS) 1; Toss-Ups 5 http://t.co/O3nkQUbfnI RT @CentProj: Greg Orman is "the most interesting man in politics." Help spread the word about this campaign! #kssen #CenterStands http://t RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr RT @michaelpfalcone: Bob Dole calls Greg Orman "a Democrat masquerading as an Independent" in intvu w/ @alex_mallin http://t.co/r6NqC9lK4E Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star RT @rickhasen: In a matter of weeks Greg Orman could be one of the most important people in American politics. #KSSEN RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/8B5qZKlCPT RT @wbdamron: Wow. George Will on Fox News All-Star discussion just said KS Senate race is "Orman's to lose."  #kssen RT @TPM: What exactly are Democrats getting with Kansas independent Greg Orman? http://t.co/q9JyQgukna #KSSen http://t.co/xZQQnlJa4F Will Dems go all-out to beat Sen. Pat Roberts now? http://t.co/igEIm1jbW0 via @POLITICO RT @ThePlumLineGS: Greg Orman says he will caucus with whoever has clear majority. (1/2) I love watching straws being grasped at. RT @KCStar: Pat Roberts releases Greg Orman court documents: http://t.co/Hcb9mjrsms @YahooScreen In case there was any doubt, Greg Orman is a Democrat trying to pretend he's not. What Exactly Are Dems Getting With Kansas Independent Greg Orman? http://t.co/f65WXlQ4jC Kansas Senate candidate Greg Orman discloses assets, investments worth millions http://t.co/k4defVY2Oz What Exactly Are Dems Getting With Kansas Independent Greg Orman? @TPM http://t.co/yvSWWobNah Greg Orman was a Ross Perot-quoting college Republican: he has decades of experience to keep us guessing. https://t.co/THzKbz7OgC Goldman Sachs : Link to jailed investor probed ; Greg Orman set to release financial report http://t.co/XWJ8AaqBue via @ForTraders #KSSen RT @PatRoberts2014: Read the truth about Greg Orman: http://t.co/NiNc50Vees #kssen George F. Will Virtually Endorses Greg Orman, Independent in Kansas: George F. Wills September 24 column conc... http://t.co/CoxQgP1cEQ #News: Sources: Wolf weighs Orman endorsement: The tea party candidate is considering some p... http://t.co/GC82GHwDZs via .@TheNewsHype RT @HouseCracka: Former Goldman Sachs Board Member, in prison, appointed Greg Orman as to serve as his representative on the two-member boa RT @lindsaywise: Nate Silver has Greg Orman favored to win #Kansas senate seat http://t.co/qGej4Ahrpx RT @ThePlumLineGS: Greg Orman says he will caucus with whoever has clear majority. (1/2) No public events for Greg Orman again todayWhere is he hiding? Tweet photo of him at public event in KS &amp; win a t-shirt. Use #WheresOrman Open Questions For Kansas Senate Candidate Greg Orman https://t.co/Fg2j5mJKQV Nate Silver has Greg Orman favored to win #Kansas senate seat http://t.co/qGej4Ahrpx RT @GEGOPS: Greg Orman donated $1000 to Harry Reid, $4600 to Obama $4600 to Hillary $9400 to KS Dem Committee #kssen #kansas #ksleg #ksgop @TristanLejeune @thehill @SenPatRoberts @ajjaffe Is it a scorched-earth strategy or is it rational criticism of Greg Orman's far left views? If elected, Greg Orman of Kansas would be among richest U.S. senators - Kansas City Star http://t.co/wW4fOG1ZYV #washington RT @rollcallpols: #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/GM8m9nwNQc #alert RT @lachlan: Greg Orman is trying to keep up a nonpartisan image, but he's getting assists from national and KS Dems http://t.co/gPZ9xksbQd RT @amyewalter: Greg Orman been on msg for a while. At Princeton ('91) he quotes Ross Perot, didn't join eating club, college GOPer http:// RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not RT @nrlc: Clear contrast between @PatRoberts2014 and Greg Orman in the #KSSen race! #WeVoteProLife http://t.co/alfPexJ17Z RT @BDayspring: Liberal Greg Orman Gets Backing from Dem Super PAC  http://t.co/ocIsbdqrvZ #KSsen RT @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/lt0J1KSiEC Democrats Pin Senate Hopes on a Kansan: Senator Pat Roberts, left, a Republican, and Greg Orman, the independe... http://t.co/wlMPMkAhcD RT @JumpVote: I guess the establishment will go without blame again. // Greg Orman leads Pat Roberts in Kansas http://t.co/cnFHt96QtS .@PatRoberts2014 did a great job on @IngrahamAngle show this morning. Greg Orman is Pro-Amnesty. We need to close our borders!

#kssen RT @HouseCracka: Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSA #Greg Orman's Candidacy Threatens Republican Hold in Kansas http://t.co/f3zyauLSEW RT @BDayspring: Things national press ignoring: Greg Orman Spox @mikephillips1 a fmr senior staffer for @DSCC Chair Michael Bennet &amp; @guyce RT @Publici: U.S. Senate Candidate Greg Orman of Kansas has pledged to be an independent [who] wont answer to either party.  http://t.co Adding #KSSEN to #InsightsOnAir Senate track. Greg Orman has 55% of the spots slated to air in next 3 weeks. http://t.co/DP8oUl2DP2 RT @KCStar: Pat Roberts releases Greg Orman court documents: http://t.co/KD1kXg4vII @delong @PhilipRucker @daveweigel Remember, primary turnout was 15-20%. Orman has blanketed airways. KS Sens assume "R" is enough to win. RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not RT @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/lt0J1KSiEC RT @kansasdotcom: Greg Orman discloses assets, investments worth millions http://t.co/2EQgdNNvrD #kssen #kseln #ksvote http://t.co/g5NAG56G Sources: Wolf weighs Orman nod  via @josephjett #politics http://t.co/p3t8FiyEKO Candidate Greg Orman explains his decision to run for US Senate against Pat Roberts... as a Democrat (circa 2008)  http://t.co/L1G4Dtroj1 @delong @PhilipRucker @daveweigel Roberts &amp; constituents are old west KS farmers &amp; retired. Most KS pop is east &amp; suburban, as is Orman. Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to ind...  http://t.co/0yZmsIQ6mD RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  #congress: Sources: Wolf weighs Orman endorsement - The tea party candidate is considering some political payback ... http://t.co/U7Sfrhgqqd RT @ThePlumLineGS: Greg Orman says he will caucus with whoever has clear majority. (1/2) RT @KStatePatriot: #ProLife RT @nrlc: Clear contrast between @PatRoberts2014 and Greg Orman in the #KSSen race! #WeVoteProLife http://t.co/ RT @SayNoToGOP: Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? - Hot Air http://t.co/lJgcfNL8et Commentary: High stakes in Kansas election: SHAWNEE, Kansas  Tacked to the wall of Greg Ormans campaign offi... http://t.co/A3GlsjcUnm RT @HouseCracka: Sarah Palin says Greg Orman trying to snooker Kansas voters | The Wichita Eagle - http://t.co/maWaAOOws2 RT @nrlc: We stand with @PatRoberts2014 in the #KSSen race! Greg Orman would be another pro-abortion vote for Obama and Reid: http://t.co/m RT @EmmetONealIII: @miltonwolfmd Please help Republicans get rid of Harry Reid. Don't aid stealth Democrat Greg Orman. RT @ivn: Politics is not something that was intended to take over your life..." - @OrmanForSenate http://t.co/2mobdxAl7a "Independent" Greg Orman hires well-traveled Democratic handler. RT @HouseCracka: Greg Orman "Independent" gave thousands of dollars to Barack Obama, Hillary Clinton, Harry Reid, Al Franken, Kansas Democr RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @mmurraypolitics: Why Greg Orman in Kansas could be the most interesting man in politics this November http://t.co/NmFzcixSCj Poll: Can Greg Orman defeat Sen. Pat Roberts?: It's a close race between independent Greg Orman and r... http://t.co/DRnKJAsUw4 @TeamLOA RT @dhellingkc: If elected, Greg Orman of Kansas would be among richest U.S. senators http://t.co/nrGGK4T0Iu "In Kansas, Roberts fights for his seat  and the Senate" http://t.co/REURA6zbKt #msnbcdiscuss RT @Women4KS: We need @OrmanForSenate in Washington, solving problems. RT @WichitaCindy: Greg Orman in Wichita https://t.co/m8FmyGmLul #kss RT @AdelsteinListon: New poll shows growing momentum - and a lead - for @OrmanforSenate: http://t.co/6ldIpFaLj4 "There is no consideration of a Wolf endorsement for Orman," one source said. http://t.co/TnGvsS83Mx #rsrh Democrats putting down down payment on Greg Orman in Kansas-SEN race.: http://t.co/w0aZE0JFyl @CharlesMunn1  And for very good reason.  Roberts is a has-been.  Greg Orman is a passionate Independent that Kansas &amp; America needs badly. #YokelChang Sources: Wolf weighs Orman endorsement: The tea party candidate is considering some political payb... http://t.co/BuAe0UnA29 Meet Greg Orman, the Most Interesting Man in Politics http://t.co/LA85WRIbYL #sanfrancisco It's ironic that Greg Orman associates himself w/ Senator Angus King, who caucuses with the Democrats. 

#kssen 
http://t.co/MotUMbmeY3 RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/jFRrJ7hMIl RT @georgewillf: Greg Orman wants to deny Pat Roberts a fourth Senate term, thereby ending a congressional career that began in 1981 http:/ RT @LaCivitaC: Greg Orman, call your office:   http://t.co/1r3XTl8Kn7 RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http Sarah Palin says Greg Orman trying to 'snooker' Kansas voters - http://t.co/0w1eTKkhnw http://t.co/VUKiFLuoMq RT @stevekraske: Turns out that KS Sen. @JerryMoran also has a lot riding on the Roberts-Orman race: http://t.co/nkP9WeCDDp RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic N8 Silvr has Greg Orman favord 2 win #Kansas sen8 seat  #chance #NateSilver @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/KCAiiVRfWI #ksleg Pat Roberts and Greg Orman see several issues differently in the U.S. Senate http://t.co/7DNOV9W0eS #news Will Dems go all-out to beat Sen. Pat Roberts now? http://t.co/Vhi5A1FFrw via @POLITICO RT @dylanlscott: Wanna know why Greg Orman doesn't need party support? He's worth more than $21 million: http://t.co/53NGBmrG9O #KSSen RT @Vision4USA: RT: Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http: #Politics  Orman would be among wealthiest senators, financial disclosure shows:  Greg Orman, the political i... http://t.co/YbY761YeBE RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @charlieNPR: Greg Orman, painfully above the fold in Kansas capital paper. Meanwhile, Roberts hasnt polled over 42 since primary http:// Here are your choices for US Senator, Kansas. Go, Greg Orman (on the right). Incumbent on the left. #KS #Senate2014 http://t.co/dufFkG1NDj RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Im Bob Dole, and I can tell you that Greg Orman is not Bob Dole. #kssen http://t.co/ocEzeQCaiM Kansas Supreme Court ruling is a victory for Greg Orman and a defeat for Pat Roberts http://t.co/DqwzIHK3Lt RT @mkraju: #KSSEN news: Milton Wolf may endorse Orman if he caucuses with GOP; two will meet Friday. w/@politicoalex. http://t.co/E69qTdZR RT @nrlc: Greg Orman has the same extreme abortion position as Barack Obama. - @CarolTobias1 #kssen #prolife http://t.co/EX2Zw2bXC7 RT @Timodc: An insider trading felon hand-picked Greg Orman to be on the board of his Cayman Islands firm. https://t.co/u5vUiDH7kc cc @moll RT @bloggingheads: The Senate kingmaker? @billscher &amp; @mattklewis on the potential power wielded by independent KS candidate Greg Orman. ht @saramikaila Nope, gonna narrowly hold it. 50/51 seats including Orman in KS RT @HouseCracka: Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSA RT @bjs5555: In #KS, for strategic reasons, our (D) candidate dropped out of the Senate race to BACK Ind Greg Orman to beat Tea Sen Roberts RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t Meet Greg Orman, the Most Interesting Man in Politics: Republican Pat Roberts looks even more vulner... http://t.co/3HjHkKl47b #oladeile @Elizabeth_Calo Who is Greg Orman and what are his political motivations? For instance, where does he stand on national socialism? Greg Orman in Wichita https://t.co/kIfkvqPTAd #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/Gbh9u719Um #alert RT @ThePlumLineGS: RT @DrewMTips: Greg Orman might be in trouble. The NRSC has decided to treat him like he's a conservative. 

http://t.co Kansas takes center stage http://t.co/TdDwwyTcHQ RT @kjon: "A vote for Greg Orman is a vote for @BarackObama" - Great new ad from Freedom Partners #KSsen https://t.co/NigPvV49Fc RT @michaelpfalcone: Bob Dole calls Greg Orman "a Democrat masquerading as an Independent" in intvu w/ @alex_mallin http://t.co/r6NqC9lK4E RT @ivn: Politics is not something that was intended to take over your life..." - @OrmanForSenate http://t.co/2mobdxAl7a RT @HouseCracka: Greg Orman, big Democrat donor, business partner in prison, is not an Independent but a DNC plant. #kssen  http://t.co/9sP Will Dems go all out to beat Roberts in Kansas?   http://t.co/pcoaVDrIYz via @POLITICO for Android RT @msnbc: In Kansas, GOP Sen. Pat Roberts fights for his seat - and control of the US Senate: http://t.co/hthDeFzjEO RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr RT @kansasdotcom: Greg Orman discloses relationship w former Goldman Sachs member convicted of securities fraud 
http://t.co/ynJs8QATaw htt In Kansas, Sen. Pat Roberts is fighting the reelection race of his life. MORE: http://t.co/8Zulh3wGDg RT @ivn: Politics is not something that was intended to take over your life..." - @OrmanForSenate http://t.co/2mobdxAl7a RT @JumpVote: I guess the establishment will go without blame again. // Greg Orman leads Pat Roberts in Kansas http://t.co/cnFHt96QtS Get the latest on liberal Greg Orman:

http://t.co/fjCwpt6tgy http://t.co/XmbzeilMfv Greg Orman wears extra-pink Mary Kay lip-gloss. RT @willrahn: Greg Orman, the Indy who may take out Pat Roberts in Kansas, is a fan of both Coldplay and Nickleback https://t.co/4HIG046hM2 Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? http://t.co/0VlrQkevCT Sources: Milton Wolf weighs Greg Orman endorsement (Politico) http://t.co/ySNyb1uH53 http://t.co/RhXpfKOggH Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman?: Kingmaker. 
The Republica... http://t.co/GnKQn4yK6h Salt Lake Tribune - Will: High stakes in Kansas Senate race - SHAWNEE, Kan. :  Tacked to the wall of Greg Orman's ... http://t.co/7YqSU9Ckso Reading @TPM article about Greg Orman, I get feeling he's the kind of (I)  that really ought to pop up more often http://t.co/fgTHjolBXU Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO) - http://t.co/XZqw5Wuske http://t.co/6xpMdkZ5GX Sources: Milton Wolf weighs Greg Orman endorsement http://t.co/A8tPuDXkcq via @POLITICO RT @amyewalter: Greg Orman been on msg for a while. At Princeton ('91) he quotes Ross Perot, didn't join eating club, college GOPer http:// RT @darlene09465021: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts... http://t.co/LEoecSJeFb RT @mjbeckel: Independent Greg Orman lures left-leaning donors in #KSSEN despite uncertainty about whether he'll caucus with Dems http://t. RT @HouseCracka: Greg Orman maintains professional ties with ex-Goldman Sachs board member in prison. 

http://t.co/caT5TcrO3T

#ksgop #kss RT @OpenSecretsDC: If he wins, @OrmanForSenate could become one of the richest Senators in Congress, notes @KWCH12, citing our data: http:/ RT @AoSHQDD: New #KSSEN Poll: Orman (I)* 45%, Roberts (R) 40% http://t.co/SvspVY5Ew0 re: Pat Roberts and Greg Orman's assets. 

 http://t.co/jqyQugN591 RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @alex_mallin: Who will Greg Orman caucus with? Same question was asked of @SenAngusKing in 2012. He didn't answer until a week after bei Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star http://t.co/Z0DxObcHZi WaPo, 538, NYT, &amp; HuffpPo models all give GOP 58-65% chance of winning Senate (and Greg Orman single-handedly renders them all crap). Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO) - http://t.co/cg4mLvdbSi http://t.co/Vsg7v5455N RT @KWCHLauren: Greg Orman releases his financials; net worth in the millions http://t.co/mmhLwZRQPF #KWCH12 Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO http://t.co/kDP0guNRxx #palin #teaparty RT @Publici: U.S. Senate Candidate Greg Orman of Kansas has pledged to be an independent [who] wont answer to either party.  http://t.co RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @kansasdotcom: Greg Orman discloses assets, investments worth millions http://t.co/2EQgdNNvrD #kssen #kseln #ksvote http://t.co/g5NAG56G RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @politico: "There is no consideration of a Wolf endorsement for Orman," one source said. http://t.co/TnGvsS83Mx What Exactly Are Dems Getting With Kansas Independent Greg Orman? @TPM http://t.co/wbde2WJAiY RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @KStatePatriot: #Bombshell - Washington Post writes: "Greg Orman hiring of former @DSCC hand highlights personnel predicament" 

#Kssen RT @Vision4USA: RT Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http:/ RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic @RBPundit At least she's in Roberts' (KS) corner. Look what's happening there. http://t.co/t5cNAvOU4z Kansas "Independent" Greg Orman prev. ran as Democrat.  Wolf in sheeps clothing. I hope if Greg Orman (Independent) wins in Kansas, he helps toss Harry Reid. RT @zimmerdale: Greg Orman in ICT this a.m. Talking issues and ideas, and not mentioning his opponent. Where's my shirt? #WheresOrman http: RT @SamWangPhD: Absolute must-read from @mollyesque: "I went to Kansas to see what this Greg Orman character is all about" http://t.co/V4nS RT @darlene09465021: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts... http://t.co/LEoecSJeFb RT @ForecasterEnten: If Orman said he caucuses with the GOP, then this gets one step closer to looking like CT 06 http://t.co/Fvsuenta4W (h RT @ThePlumLineGS: If Greg Orman wins and caucuses with Ds, Ds can hold Senate by winning in NC and holding *either* in Alaska *or* in Iowa. "We have an electoral system that creates strange incentives"-- Exec Director Rob Richie in @CBSNews piece on #kssen http://t.co/jsb10e6pa0 Kansas Ballots Will be Mailed Without Democratic Senate Nominee http://t.co/LelNutab3N via @rollcall #KSSEN Things national press ignoring: Greg Orman Spox @mikephillips1 a fmr senior staffer for @DSCC Chair Michael Bennet &amp; @guycecil #KSsen NEWSFLASH!!! RICH WHITE GUY RUNNING FOR CONGRESS!!! GREG ORMAN HAS GOT WAY MORE MONEY THAN YOU!!!: Kansas Senate... http://t.co/clOOFn3hc5 @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/7vNm45UYfm really needed an insider to solve that puzzle. RT @michaelpfalcone: Bob Dole calls Greg Orman "a Democrat masquerading as an Independent" in intvu w/ @alex_mallin http://t.co/r6NqC9lK4E RT @lachlan: Greg Orman is trying to keep up a nonpartisan image, but he's getting assists from national and KS Dems http://t.co/gPZ9xksbQd RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @kjon: "A vote for Greg Orman is a vote for @BarackObama" - Great new ad from Freedom Partners #KSsen https://t.co/NigPvV49Fc RT @allahpundit: Sources: Milton Wolf may endorse Pat Robertss independent opponent http://t.co/Cie9hmVtCX Palin, in Independence, KS, says Greg Orman isn't truly independent. He's "trying to schnooker you, Kansas." RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t Peeling back the curtain: Democrat Greg Orman's ties to convicted investor run deep http://t.co/ijzYNmeP7d #KSsen RT @LaCivitaC: Greg Orman, call your office:   http://t.co/1r3XTl8Kn7 Is Pat Roberts conservative primary challenger in Kansas going to back GregOrman? http://t.co/XTHQlKz2H0 RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not Greg Orman, call your office:   http://t.co/1r3XTl8Kn7 RT @HouseCracka: Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSA RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/8B5qZKlCPT Greg Orman's campaign ad is good in that it focuses on the issues not defaming his opponent RT @joshtpm: What Exactly Are Dems Getting With Kansas Independent Greg Orman? @TPM http://t.co/7lLGtIwHC9 RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C Senate candidate Greg Orman's business, political interests run wide - Kansas City Star http://t.co/vP7tildubV @OrmanForSenate "The most interesting man in politics" Spread the word about this campaign #kssen #CenterStands http://t.co/CDbdqRUlKN http://t.co/aOvRE2S8UT - Opinion: Kansas race has national impact - Tacked to the wall of Greg Ormans campaign... http://t.co/f9pXfAAV3G RT @Vision4USA: RT: Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http: Bob Dole calls Greg Orman "a Democrat masquerading as an Independent" in intvu w/ @alex_mallin http://t.co/r6NqC9lK4E Snort RT @KansasGOP: Slam:  Im Bob Dole, and I can tell you that Greg Orman is not Bob Dole.  #lsgop  #ksleg http://t.co/0QNbylZ9kD RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. Pat Roberts releases Greg Orman court documents http://t.co/kOIRphCpyt #KSSen #tcot RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems.  Don't be  RT @washdcnews: Sources: Wolf weighs Orman endorsement http://t.co/O5BIkhrMbS So Kansas Dems hate the Koch Brothers and big money in politics, but they want Greg Orman for Senate, who is worth up to $86 million... RT @cynthia4877: GOP desperately trying 2 save KS Senate seat. Polls show Independent Greg Orman leading GOP Pat Roberts.

http://t.co/iUq RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not A financial disclosure released Monday indicates that Senate hopeful Greg Orman's assets top $21 million: http://t.co/pH9lBBnDAi RT @joshtpm: What Exactly Are Dems Getting With Kansas Independent Greg Orman? @TPM http://t.co/7lLGtIwHC9 RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic Sarah Palin says Greg Orman trying to 'snooker' Kansas voters - http://t.co/RNSEUyvXAP http://t.co/Ud344JiotN #palin #teaparty #CombatBrands #Period #Scrutiny #Sen Greg Ormans net worth would place him among w ... http://t.co/3Mqj9xk4NV New #KSSEN Poll: Orman (I)* 45%, Roberts (R) 40% http://t.co/SvspVY5Ew0 RT @mkraju: #KSSEN news: Milton Wolf may endorse Orman if he caucuses with GOP; two will meet Friday. w/@politicoalex. http://t.co/E69qTdZR Former Goldman Sachs Board Member, in prison, appointed Greg Orman as to serve as his representative on the two-member board. #kssen #ksgop So what exactly are Democrats getting with Greg Orman? http://t.co/sj5hgfR9jC #KSSen Based on coverage, So do Ds on #MSNBC.

@TPM: Kochs tag KS Indy candidate as closet D http://t.co/l8Y5gLaPia #KSSen http://t.co/GWeMl3LQXk RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @TPM: Koch brothers tag Kansas independent Senate candidate as closet Democrat http://t.co/1V8DqQWOly #KSSen http://t.co/ux2f0liCcB RT @cynthia4877: GOP desperately trying 2 save KS Senate seat. Polls show Independent Greg Orman leading GOP Pat Roberts.

http://t.co/iUq It was clear in '08 what kind of man Obama was, which is why I can't support anyone who voted for him...like Greg Orman. #PatRoberts Where is Greg orman hiding? And more importantly why?   #Cayman Islands baby.. "Another person said: 'I think if Orman agrees to Wolfs terms, it means the end of Roberts.' http://t.co/7OfR9K2KMV Which party would get Kansas independent Greg Orman's vote?: Greg Orman, an independent Senate candidate from ... http://t.co/Cb0a7anwyN Did you miss Senate candidate, Greg Orman on IGI last night?  It's now online at http://t.co/sPB9QMQkP5 #Gun #IndependentGregOrman #RepublicanParty Pat Roberts and Greg Orman see several ... http://t.co/2kEXOOa6cr Greg Orman has no ideas of his own to run on. Voting for him is a vote for Harry Reid. RT @blakehounshell: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts http://t.co/1N2yTcfczq Orman-Wolf meeting canceled: A meeting between former tea party Senate hopeful Milton Wolf and independent can... http://t.co/yuAIEeZq2I RT @Politics1com: KS USSEN (Rasmussen): Greg Orman (I) 45%, Pat Roberts (R) 40%. "There is no consideration of a Wolf endorsement for Orman," one source said. http://t.co/b1u1s1Vuw5 Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? - Hot Air http://t.co/lJgcfNL8et RT @Vision4USA: RT Greg Orman is a Trojan Horse for the Democrats. He is a not an Independent. Vote @PatRoberts2014 #KSsen #tcot http://t.c @NateSilver538 @FiveThirtyEight What difference would it make if you counted Greg Orman as a Dem? Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO) http://t.co/c7SFiDVmcY RT @KCBizJournal: Independent Senate candidate Greg Orman's wealth exceeds $21 million (and may be as high as $85 million). http://t.co/m0f RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @stevekraske: Turns out that KS Sen. @JerryMoran also has a lot riding on the Roberts-Orman race: http://t.co/nkP9WeCDDp NEWSFLASH!!! RICH WHITE GUY RUNNING FOR CONGRESS!!!: And so . . . RICH GUY GREG ORMAN IS YET ANOTHER ASPIRING ... http://t.co/E6XZEfl4Sg RT @TheRReport: In Kansas, Republican Sen.Pat Roberts fights for his seat  and the Senate  http://t.co/4EWfz4mJZw Milton Wolf weighs Greg Orman endorsement http://t.co/KqIzObTZJQ http://t.co/uk51vgW97t RT @rollcall: #KSSEN Ballots Will Be Mailed Without Dem Nominee http://t.co/Gbh9u719Um #alert RT @michaelpfalcone: Bob Dole calls Greg Orman "a Democrat masquerading as an Independent" in intvu w/ @alex_mallin http://t.co/r6NqC9lK4E Nate Silver has Greg Orman favored to win Kansas #senate seat http://t.co/ZJ8XoSZ05R @OrmanForSenate @GOP #ksleg #p2 http://t.co/OMsoNerMBz RT @BDayspring: Peeling back the curtain: Democrat Greg Orman's ties to convicted investor run deep http://t.co/ijzYNmeP7d #KSsen RT @dhellingkc: Greg Orman claims assets worth between $21.53 million and $85.96 million in first disclosure; annual income btwn $917,290 a RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not If Orman said he caucuses with the GOP, then this gets one step closer to looking like CT 06 http://t.co/Fvsuenta4W (h/t @stevekornacki) Pat Roberts / Greg Orman Debate, Hutchinson KS Part 3: http://t.co/S4u4dG9jpf via @YouTube RT @lachlan: Pat Roberts' failed tea party challenger may endorse Greg Orman if he agrees to caucus with the GOP http://t.co/b72MdaZE0k Sources: Wolf weighs Orman nod - The tea party candidate is considering some political payback by endorsing the Ka... http://t.co/seSv8C7Jzp Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to ind...  http://t.co/nRxbuwZs8y RT @CBSNews: Independent in Kansas race for U.S. Senate appears to have decent shot at winning http://t.co/sssk0xv5D0 http://t.co/n11WLkwruf Kansas independent Senate Candidate Greg Orman has deep ties businessman convicted of securities fraud http://t.co/Q0MpfX6wfW I thought Wolf was a GENUINE conservative. He'd never endorse Orman! &gt; Orman-Wolf meeting canceled http://t.co/XRewsitTj4 via @POLITICO RT @WaPoSean: "Dr. Wolf is not meeting with Greg Orman and there is no consideration of a Wolf endorsement." http://t.co/fHG9dB03AZ RT @UpshotNYT: Greg Orman has a real path to victory in Kansas after last night's court decision. This isn't Kentucky. http://t.co/7utVyt5H Lexington: Stormin Orman http://t.co/ugI169Whe4 Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems. Don't be f RT @HouseCracka: Sarah Palin says Greg Orman trying to snooker Kansas voters | The Wichita Eagle - http://t.co/maWaAOOws2 RT @mkraju: #KSSEN news: Milton Wolf may endorse Orman if he caucuses with GOP; two will meet Friday. w/@politicoalex. http://t.co/E69qTdZR Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman?: http://t.co/VZ3EHCXGAR RT @blakehounshell: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts http://t.co/1N2yTcfczq RT @GOP: Greg Orman: Staffed by Democrats, funded by Democrats, has donated to Democrats, is the de facto Democrat. http://t.co/NFoCy7Y9KL  RT @CentProj: Greg Orman is ready to reshape Washington and give moderates the voice they deserve http://t.co/hCahjJ9F9Z #kssen #CenterStan Kansas is being duped. Greg Orman is a BIG Democrat Donor. Here is just one of his donations to:
Obama for America. http://t.co/oLxIERVaUA Sources: Milton Wolf weighs Greg Orman endorsement http://t.co/HtoDG6aLdH via @POLITICO RT @politico: Milton Wolf may endorse Kansas independent Greg Orman, if Orman caucus with the Senate GOP http://t.co/CEZiDFAbEh RT @KCStar: John McCain campaigns with Pat Roberts, says independent Senate candidate Greg Orman looks like a Democrat: http://t.co/Z2CE6UQ RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  @esugrad72 Greg Orman screaming "I am a victim" in Kansas LOL!

He is a Cross Dressing Democrat masquerading as an Independent! 
#kssen RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems. Don't be f Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? - Hot Air http://t.co/ZxNxzaWRd9 "Independent" Greg Orman hires Democrat operative https://t.co/0U5z8I7GAY I'm losing respect for Sen. Pat Roberts. He should be discussing the issues instead of trying to "Swiftboat" Greg Orman. RT @Taniel: The tough math: If Democrats lose Pryor and Begich, as PPP suggests they will, they pretty much need Greg Orman to get to 50 se RT @OldHydePark: Pat Roberts &amp; Greg Orman c several issues differently in the US Sen8 race in #Kansas  #gun #RepublicanParty Clear contrast between @PatRoberts2014 and Greg Orman in the #KSSen race! #WeVoteProLife http://t.co/alfPexJ17Z RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre The Mystery Candidate Shaking Up Kansas: Is independent candidate Greg Orman's bipartisan http://t.co/ksE0ec1w5X RT @politico: Milton Wolf may endorse Kansas independent Greg Orman, if Orman caucus with the Senate GOP http://t.co/CEZiDFAbEh RT @KCStar: Greg Orman's net worth would place him among wealthiest senators if elected: http://t.co/KVN0HY1S32 Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to independent and it running... GOP: Greg Orman: Staffed by Democrats, funded by Democrats, has donated to Democrats, is the de facto Democrat.   ... RT @SayNoToGOP: Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? - Hot Air http://t.co/lJgcfNL8et RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre RT @MichaelLaRosaDC: Kansas Ballots Will be Mailed Without Democratic Senate Nominee http://t.co/dGk3TY1VGp via @rollcall #KSSEN RT @rubycramer: in an interview on the @CBSEveningNews, Greg Orman (@OrmanForSenate) says he'd caucus with whichever party has the majority RT @GOP: Greg Orman: Staffed by Democrats, funded by Democrats, has donated to Democrats, is the de facto Democrat. http://t.co/NFoCy7Y9KL  RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not Kansas Gov. Brownback &amp; Sen. Roberts are pro-life. Opponents Paul Davis &amp; Greg Orman are not. http://t.co/6ElOyfDDcP #prolife #tcot #Kansas "Slam"? is this high school? @KansasGOP: Slam:  "Im Bob Dole, and I can tell you that Greg Orman is not Bob Dole." http://t.co/JQeCDWE2Cn Orman-Wolf meeting canceled: An insider says Wolf won't support Orman. http://t.co/E9rNIUO7xt #politics #dem #gop RT @ivn: Politics is not something that was intended to take over your life..." - @OrmanForSenate http://t.co/2mobdxAl7a RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star http://t.co/s5ims44AoU #politics RT @cynthia4877: GOP desperately trying 2 save KS Senate seat. Polls show Independent Greg Orman leading GOP Pat Roberts.

http://t.co/iUq The Kansas Senate race is getting EVEN MORE interesting... http://t.co/K5EqVKa2mq Orman Lead in Kansas: A new Rasmussen survey in Kansas finds Greg Orman (I) leading Sen. P... http://t.co/KbJ0uihGkq #dem #gop #politics RT @HouseCracka: Is Kansas going to be duped by the fraud Independent? He is a Democrat. #kssen Do not vote for Orman. He is NOT an indepen RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Meet Greg Orman, the Most Interesting Man inPolitics http://t.co/3qx7nbx75j Orman would be among wealthiest senators, financial disclosure shows:  Greg Orman, the political independent c... http://t.co/MOHLTUaBxz Wow. MT @Timodc Congrats to DNC/DSCC operative @mikephillips1 on new role as spox for Democrat, "Independent" Greg Orman. #KSsen RT @kansansforlife: Kansas Gov. Brownback &amp; Sen. Roberts are pro-life. Opponents Paul Davis &amp; Greg Orman are not. http://t.co/6ElOyfDDcP #p RT @Publici: U.S. Senate Candidate Greg Orman of Kansas has pledged to be an independent [who] wont answer to either party.  http://t.co Greg Orman's Candidacy Threatens Republican Hold in Kansas | http://t.co/naTFa1AG8M #KSsen RT @charlieNPR: Greg Orman, painfully above the fold in Kansas capital paper. Meanwhile, Roberts hasnt polled over 42 since primary http:// Will Dems go all-out to beat Sen. Pat Roberts now? http://t.co/31RvA1UCVi via @POLITICO RT @AP_Politics: Kansas independent US Senate candidate Greg Orman discloses between $21.5 million and $86 million in assets. http://t.co/n Sources: Wolf weighs Orman endorsement: The tea party candidate is considering some political payback by endor... http://t.co/ZACihgb42m In Kansas, Roberts fights for his seat  and the Senate | MSNBC http://t.co/jsqnycglpQ Greg Orman's net worth would place him among wealthiest senators if elected: Independent Senate candidate Greg... http://t.co/xs5KxKPwTy #KSSen: @TheDemocrats Are Buying @OrmanForSenate Outright http://t.co/H6cnhpmYOF @moelane #tcot #p2 #kansas #election2014 RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT: Harry Reid's Trojan Horse to keep the senate - Greg Orman isn't an Independent. Vote @PatRoberts2014 #KSsen #tcot http://t.co/hekYoZz1E5 Pat Roberts / Greg Orman Debate, Hutchinson KS Part 4: http://t.co/jKfilUpN76 via @YouTube Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to independent and it running... RT @KCStar: John McCain campaigns with Pat Roberts, says independent Senate candidate Greg Orman looks like a Democrat: http://t.co/Z2CE6UQ Among indy Greg Orman's campaign donors? A lawyer &amp; former Obama bundler who has represented @LadyGaga &amp; @U2 http://t.co/EWlyQWI8ju #KSSEN Greg Orman in Kansas is huge Democrat Donor. @FoxNewsSunday covers up the lies. He is not an independent. He is a donkey. Politics is not something that was intended to take over your life..." - @OrmanForSenate http://t.co/2mobdxAl7a "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems. Don't be fooled. 
#KSsen Sources: Wolf weighs Orman endorsement http://t.co/9ASjztqJmY RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  @adamskoglund 4 polls out since Taylor dropped showing Independent Orman w/ leads of 5 to 10 pts over Roberts but attacks on Orman will hurt Sarah Palin says Greg Orman trying to snooker Kansas voters http://t.co/7XCtlTEGvU Kansas. Greg Orman a rubber stamp democrat masquerading as "independent." RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. Pat Roberts Ad Hammers Phony Independent Greg Orman; Highlights Ormans History as an Obama Democrat:... http://t.co/I1HzvOvwW0 Open Questions For Kansas Senate Candidate @OrmanforSenate: https://t.co/qOtQ44CLYR #KSsen Sources: Wolf weighs Orman endorsement http://t.co/4tbMto4R1R RT @Corry_Bliss: Shit..."@zimmerdale: Greg Orman in ICT this a.m. Talking issues and ideas...#WheresOrman http://t.co/EiBDVKzFat" RT @CraigAndresKSN: case will decide if DEMOCRATS in Kansas MUST put a name on the ballot, or if it's just Pat Roberts VS. Greg Orman for t Pat Roberts / Greg Orman Debate, Hutchinson KS Part 4: http://t.co/qETl2ki3Iq via @YouTube RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/jFRrJ7hMIl RT @Taniel: The tough math: If Democrats lose Pryor and Begich, as PPP suggests they will, they pretty much need Greg Orman to get to 50 se RT @ThePlumLineGS: If Greg Orman wins and caucuses with Ds, Ds can hold Senate by winning in NC and holding *either* in Alaska *or* in Iowa. RT @RepFinney: U.S. Senate candidate Greg Orman in Wichita today speaking to the African American community. I don't believe... http://t.co RT @KWCH12: Greg Orman releases his financials; net worth in the millions http://t.co/0NazEjRCF9 http://t.co/8yqHUsnNgt RT @Vision4USA: Greg Orman is a Trojan Horse for the Democrats. He is a not an Independent. Vote for Roberts! #KSsen #tcot http://t.co/8R3H Pat Roberts / Greg Orman Debate, Hutchinson KS Part 2: http://t.co/zcBn0fbaNO via @YouTube Shit..."@zimmerdale: Greg Orman in ICT this a.m. Talking issues and ideas...#WheresOrman http://t.co/EiBDVKzFat" If Orman were willing to pledge to caucus with GOP, he wouldn't need Milton Wolf's endorsement. Nice try, Doc. http://t.co/VTbn1qoUCG Vote Greg orman lol Greg Orman retains business tie to jailed Wall Street inside trader.(Former Goldman Sachs Board Member) 

http://t.co/bekKMGbwqw
#kssen RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @KCBizJournal: Independent Senate candidate Greg Orman's wealth exceeds $21 million (and may be as high as $85 million). http://t.co/m0f RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre RT @willrahn: Greg Orman, the Indy who may take out Pat Roberts in Kansas, is a fan of both Coldplay and Nickleback https://t.co/4HIG046hM2 RT @KansasGOP: Slam:  "Im Bob Dole, and I can tell you that Greg Orman is not Bob Dole."  #lsgop  #ksleg http://t.co/VO9acPac2Z Poll: Can Greg Orman defeat Sen. Pat Roberts? http://t.co/WVhg3oBqam Hey @HouseCracka, ICYMI Greg Orman's New Silks company has ties with George Soros.

#KSSen http://t.co/HDdzEOK9eZ RT @CabPolitical: Prediction Map moves to Dems 46 (w/2 Indys who caucus w/them) - GOP 48 - Remaining are Toss-Ups or Orman(I) in KS http:// RT @mikememoli: Palin, in Independence, KS, says Greg Orman isn't truly independent. He's "trying to schnooker you, Kansas." RT @darlene09465021: Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts... http://t.co/LEoecSJeFb Liberal Greg Orman's shameless effort to trick voters continues to be exposed.  The latest?  He hired as his... http://t.co/XdVzQAhbUN Greg Orman disclosed Monday that he owns assets worth between $21.5 million and $86 million http://t.co/8viDzBIpZS RT @Taniel: The tough math: If Democrats lose Pryor and Begich, as PPP suggests they will, they pretty much need Greg Orman to get to 50 se RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre RT @willrahn: Greg Orman, the Indy who may take out Pat Roberts in Kansas, is a fan of both Coldplay and Nickleback https://t.co/4HIG046hM2 RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to both Harry Reid and Barack Obama. He will caucus with Dems. 
 #YokelChang Orman-Wolf meeting canceled: An insider says Wolf won't support Orman. http://t.co/KreAmN70nN RT @albhere: Democrats NEED to support Greg Orman. He will caucus with the Democrats in the Senate. We will retain control!  #Blue http://t RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/jFRrJ7hMIl Bob Dole coming to Sen. Roberts rescue. Calls Greg Orman a Democrat masquerading as an Independent. http://t.co/DjmBGxgEdH Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO) http://t.co/MrgZxfLFPp Orman is a liberal democrap he says Independent Pat Roberts / Greg Orman Debate, Hutchinson KS Part 2: http://t.co/HqKRp1cMdF via @YouTube Orman would be among wealthiest senators, financial disclosure shows: Greg Orman, the political independent ch... http://t.co/ixm86pYS4j Greg Orman been on msg for a while. At Princeton ('91) he quotes Ross Perot, didn't join eating club, college GOPer http://t.co/1JIgWbrvC4 RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic RT @TCJShermanSmith: RT @WIBWNews: Wolf Scheduled To Meet With Orman Over Possible Endorsement #VoteKS http://t.co/GPbK5WGZxS What exactly are Democrats getting with Kansas independent Greg Orman? http://t.co/q9JyQgukna #KSSen http://t.co/xZQQnlJa4F RT @brontyman: Greg Orman: The Most Interesting Man in Politics This November http://t.co/M4d1TAWkiZ via @NBCNews RT @HouseCracka: Kansas:
Greg Orman will vote to keep Obamacare
Donated to Obama
Donated to Hillary
Donated to Harry Reid 
Donated to Al Fr RT @CJ_news: Latest News: Orman's link to jailed investor deeper than portrayed: U.S. Senate front-runner Greg Orman plans ... http://t.co/ Fate of US Senate might rest with this guy, Orman, an independent candidate for the Senate in Kansas, is polling ahehttp://t.co/GXLLWD7qFX High Stakes in Kansas - Shawnee, KansasTacked to the wall of Greg Ormans campaign office is a print of a John Ste... http://t.co/zuILfiqqwS Turns out that KS Sen. @JerryMoran also has a lot riding on the Roberts-Orman race: http://t.co/nkP9WeCDDp NEWSFLASH!!! RICH WHITE GUY RUNNING FOR CONGRESS!!! GREG ORMAN HAS GOT WAY MORE MONEY THAN YOU!!!: Kansas Sena... http://t.co/KpLkOWtJBQ RT @ivn: "96% of Kansans say politicians should support good ideas, not just partisan ideas." http://t.co/8UeVCzXlWZ RT @HouseCracka: Democrats playing DIRTY TRICK on KANSAS.

Greg Orman is BIG Democrat Donor running as INDEPENDENT. 

DIRTY TRICKS IN KANSA RT @EchelonInsights: Adding #KSSEN to #InsightsOnAir Senate track. Greg Orman has 55% of the spots slated to air in next 3 weeks. http://t. RT @mkraju: #KSSEN news: Milton Wolf may endorse Orman if he caucuses with GOP; two will meet Friday. w/@politicoalex. http://t.co/E69qTdZR RT @randomsubu: Simple choice for Kansans: support a man who has been in DC since 1980 and doesn't even live in Kansas, or Greg Orman, the  RT @baseballcrank: Milton Wolf mulls going full Dick Lugar. Never go full Dick Lugar. http://t.co/OEfdh8vysC RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre RT @bjs5555: We DO in the KANSAS Senate Election WANT to VOTE for the Independent Greg Orman @OrmanForSenate to Defeat GOP/TEA Senator Pat  RT @PatRoberts2014: Senator Bob Dole on Greg Orman to ABC News: "The guy is a Democrat masquerading as an Independent" #kssen RT @DDeanBHS: GCSN presents Challenge Coin from Gen. David Petraeus to BHS NJROTC Unit in honor of Greg Orman's father, a WWII Vet. http:// Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman?: Kingmaker. 
The Republica... http://t.co/ViPOruq6YG RT @politico: Milton Wolf may endorse Kansas independent Greg Orman, if Orman caucus with the Senate GOP http://t.co/CEZiDFAbEh RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @CharlieStutes: Here's what happens when TP candidates lose, they give credence to LIBS! http://t.co/heYLPtpPap RT @Croatansound: #Kansas Greg Orman calls himself a (I) but takes $ from #Dems which in my book makes him a (D): #KSsen #KansasCity http:/ Sarah Palin says Greg Orman trying to 'snooker' Kansas voters (VIDEO http://t.co/BIjvV5j1Z2 #palin #teaparty I have the feeling Greg Orman is a big #BaitAndSwitch - a Democrat in "independent" clothing. Why else are Democrats so for him? #KSsen  @YouTube : http://t.co/Lg3ZLcVLAk Greg Orman for U.S. Senate Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman?: Kingmaker. 
The Republica... http://t.co/8QyHQCFkcP RT @HouseCracka: Kansas is being duped. Greg Orman is a BIG Democrat Donor. Here is just one of his donations to:
Obama for America. http:/ RT @ivn: "96% of Kansans say politicians should support good ideas, not just partisan ideas." http://t.co/8UeVCzXlWZ What Exactly Are Dems Getting With Kansas Independent Greg Orman?: Whether they'll admit it or... http://t.co/26Q9Dpt1cA #politics #news RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @GregAkagi: Sources: Milton Wolf weighs Greg Orman endorsement http://t.co/HWyZe0MrVu via @POLITICO #voteks RT @Politics1com: KS USSEN (Rasmussen): Greg Orman (I) 45%, Pat Roberts (R) 40%. RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/jFRrJ7hMIl RT @PMgeezer: "Independent" Greg Orman ran as Dem in 2008, and contributed to HarryReid and BarackObama. He will caucus w/ Dems.  Don't be  RT @TPM: Koch brothers tag Kansas independent Senate candidate as closet Democrat http://t.co/1V8DqQWOly #KSSen http://t.co/ux2f0liCcB #Kansas Greg Orman calls himself a (I) but takes $ from #Dems which in my book makes him a (D): #KSsen #Wichita #TCOT http://t.co/LOo48CirVg @SenJohnMcCain Why does Greg Orman need to be Rep or Dem? You should be focused on the issues...typical misdirection.  #samerhetoric And not a R...where did we lose this one.? @kansasdotcom: Greg Orman discloses assets, investments worth millions http://t.co/r7hcSKItZO RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. Democrats Pin Senate Hopes on a Kansan: Senator Pat Roberts, left, a Republican, and Greg Orman,... http://t.co/wlMPMkAhcD #BreakingNews RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic RT @kjon: "A vote for Greg Orman is a vote for @BarackObama" - Great new ad from Freedom Partners #KSsen https://t.co/NigPvV49Fc Greg Orman's financial disclosure report (PDF): http://t.co/sfboHGhMWw RT @ivn: "96% of Kansans say politicians should support good ideas, not just partisan ideas." http://t.co/8UeVCzXlWZ Report: Orman's wealth exceeds $21M http://t.co/o5C0qa4tSx The Orman-Wolf meeting was canceled after @politico reported it was happening. Update by @mkraju &amp; @politicoalex: http://t.co/plcy6W5NoN. RT @willrahn: Greg Orman, the Indy who may take out Pat Roberts in Kansas, is a fan of both Coldplay and Nickleback https://t.co/4HIG046hM2 RT @LACaldwellDC: Palin just applauded her husband for being a registered independent then slammed Greg Orman for being an ind. and not pic Sources: Wolf weighs Orman endorsement http://t.co/O5BIkhrMbS Kansas Ballots Will be Mailed Without Democratic Senate Nominee: Kansas Secretary of State Kris Kobach has ins... http://t.co/liygFrmlIy If Orman wins in Kansas, hed hold leverage in Washington: Independent U.S. Senate candidate Greg Orman could ... http://t.co/KKpbYwgi9R RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not RT @JessicaTaylor: .@mollyesque has a great look at who Greg Orman is and why he just might win #KSSen  http://t.co/7lf4ADStKt RT @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/eeXAyD4qwv RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C RT @B4INTeaParty: John McCain campaigns with Pat Roberts, says Greg Orman looks like a Democrat http://t.co/XNJ0bepzfP Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star: Kansas Ci... http://t.co/UIDdOf6xeA RT @bktx24051: Meet Greg Orman; running as an Independent in Kansas. Wolf in sheep's clothing. 
http://t.co/vng0MF2ZSz Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star http://t.co/NwtvDAc8qV Poll: Can Greg Orman defeat Sen. Pat Roberts? http://t.co/1dMLsTPjv3 WOLF COULD BACK ORMAN IN KANSAS SENATE RACE  HAGANS HUSBAND TOOK IN STIMULUS MONEY  via @josephjett #politics http://t.co/pEDQEs5bOC RT @BDayspring: Things national press ignoring: Greg Orman Spox @mikephillips1 a fmr senior staffer for @DSCC Chair Michael Bennet &amp; @guyce Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to independent and it running... Independent Senate Candidate Draws Scant Democratic Support http://t.co/fNeqed1KXZ @ktumulty @PhilipRucker I'm in KS. @PatRoberts2014 isn't running a campaign. DC operatives are running it and it's 100% attacks on Orman. Greg Orman is NOT an independent.  He is just another Democratic dirty trick. He is and always has been a left wing Democrat. In Kansas, Democratic donors invest in uncertainty: Greg Orman, the independent U.S. Senate candidate... http://t.co/9xuTXwWye4 #ANS2014 Pat Roberts and Greg Orman see several issues differently in the U.S. Senate race in Kansas http://t.co/Ap5tPhpEbF Conservatives should rally around KS Sen Pat Roberts against Harry Reid-vote dishonest Democrat Greg Orman http://t.co/yh0VuwQ5jm Is Pat Roberts conservative primary challenger in Kansas going to back Greg Orman? - Hot Air http://t.co/CI75pwqk1u RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre RT @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/jFRrJ7hMIl I went to Kansas to see what this Greg Orman character is all about http://t.co/i0qEEVrSbq RT @cynthia4877: GOP desperately trying 2 save KS Senate seat. Polls show Independent Greg Orman leading GOP Pat Roberts.

http://t.co/iUq RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @ThePlumLineGS: Greg Orman says he will caucus with whoever has clear majority. (1/2) RT @BaracksBackers: Rove throws the gauntlet down on Greg Orman knowing #PatRoberts is so despised and hated in #Kansas only chance is to d RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @EMC_Square2: Meet Greg Orman, the man who could decide the Senate maj http://t.co/QzLO7AyvEf @UniteBlueKS @dscc @OrmanForSenate http:// Staking the Senate on #Kansas?: SHAWNEE, Kan. Tacked to the wall of Greg Ormans campaign office is a print of a http://t.co/AsaW57Hx6j It's certainly doable @politico: Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/fOvXi4zHpv Greg Orman for Senate!! RT @jmartNYT: Milton Wolf, M.D., is having some fun getting even for stores about his Facebook habits http://t.co/55FZHxHjzC RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Is Pat Roberts&amp;#8217; conservative primary challenger in Kansas going to back Greg Orman? http://t.co/6DIgpIhAxu "Greg Orman hiring of former DSCC hand highlights personnel predicament"
#KSsen 
#DemocratStooge http://t.co/2rz8gXfkd0 Sources: Wolf weighs Orman endorsement http://t.co/PCMB8Tmxr6 RT @TheTequilaParty: Somos Independents a national independent voter group who endorsed candidate Greg Orman for Senate, and we are... http RT @PatRoberts2014: Senator Bob Dole on Greg Orman to ABC News: "The guy is a Democrat masquerading as an Independent" #kssen Orman-Wolf meeting canceled http://t.co/Ddo9gaC3zZ RT @politico: Milton Wolf may endorse Kansas independent Greg Orman, if Orman caucus with the Senate GOP http://t.co/CEZiDFAbEh "Dr. Wolf is not meeting with Greg Orman and there is no consideration of a Wolf endorsement." http://t.co/fHG9dB03AZ RT @GEGOPS: Who is Greg Orman? Just another yes vote for Obama's failed agenda. https://t.co/zh2ZAQmVHA #kssen #ksleg #kansas RT @willrahn: Greg Orman, the Indy who may take out Pat Roberts in Kansas, is a fan of both Coldplay and Nickleback https://t.co/4HIG046hM2 Sources: Wolf weighs Orman endorsement http://t.co/9VHujclRop #politics #news Meet Greg Orman, the Most Interesting Man in Politics http://t.co/xNRsjxiY7l RT @bjs5555: We DO in the KANSAS Senate Election WANT to VOTE for the Independent Greg Orman @OrmanForSenate to Defeat GOP/TEA Senator Pat  RT @TPM What exactly are Democrats getting with Kansas independent Greg Orman? #KSSen 

// ability for Obama to get judges confirmed The ppl of Kansas DON'T BE FOOLED BY Greg Orman! He is a DEMOCRAT Not Really an "Independent" RT @rubycramer: in an interview on the @CBSEveningNews, Greg Orman (@OrmanForSenate) says he'd caucus with whichever party has the majority RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C RT @BaracksBackers: Rove throws the gauntlet down on Greg Orman knowing #PatRoberts is so despised and hated in #Kansas only chance is to d RT @jameshohmann: The Orman-Wolf meeting was canceled after @politico reported it was happening. Update by @mkraju &amp; @politicoalex: http:// RT @Timodc: Congrats to top-notch Democratic, DSCC operative @mikephillips1 on his new role as spox for Democrat, "Independent" Gre #Congress  Sources: Wolf weighs Orman endorsement: The tea party candidate is considering some political payb... http://t.co/92u5uYQk4W Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to http://t.co/zDsJ21VXnH Milton Wolf mulls going full Dick Lugar. Never go full Dick Lugar. http://t.co/OEfdh8vysC RT @TheRReport: In Kansas, Republican Sen.Pat Roberts fights for his seat  and the Senate  http://t.co/4EWfz4mJZw RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. RT @JenGranholm: B/c of D dropping out in KS senate race to support Ind. candidate Orman, re control of US Senate: GAME ON!  @maddow @Kansa RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not RT @dylanlscott: Wanna know why Greg Orman doesn't need party support? He's worth more than $21 million: http://t.co/53NGBmrG9O #KSSen Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas http://t.co/osLCURkFqh #finance #financenews Pat Roberts and Greg Orman see several issues differently in the U.S. Senate   Kansas Ci... http://t.co/RkBmCeqmPP RT @politico: "There is no consideration of a Wolf endorsement for Orman," one source said. http://t.co/TnGvsS83Mx RT @politico: An insider says Wolf won't support Orman in #KSSen race: http://t.co/lt0J1KSiEC In KS Senate Race #I=D

Greg Orman is a Wolf in Sheep Clothes 
Ran as a DEMONcRAT in 2008

#I=D Latest News: Orman's link to jailed investor deeper than portrayed: U.S. Senate front-runner Greg Orman plans ... http://t.co/4Q1RW6pr7k RT @ThePlumLineGS: Note: Greg Orman camp is criticizing Sen Pat Roberts for claiming we're heading for "natl socialism": http://t.co/mGNv2C RT @bloggingheads: The Senate kingmaker? @billscher &amp; @mattklewis on the potential power wielded by independent KS candidate Greg Orman. ht RT @kjon: "A vote for Greg Orman is a vote for @BarackObama" - Great new ad from Freedom Partners #KSsen https://t.co/NigPvV49Fc Kansas Ballots Will Be Mailed Without Democratic Senate Nominee http://t.co/9I4qFViDOw RT @MikeLoBurgio: Nate Silver has Greg Orman favored to win Kansas #senate seat http://t.co/ZJ8XoSZ05R @OrmanForSenate @GOP #ksleg #p2 http Will Dems go all-out to beat Sen. Pat Roberts now? http://t.co/c3yBbBu0Ee via @POLITICO RT @ThePlumLineGS: Greg Orman says he will caucus with whoever has clear majority. (1/2) What Exactly Are Dems Getting With Kansas Independent Greg Orman? http://t.co/Qzvir6l1TS RT @DUhockeyFan: MT @mikememoli: @SarahPalinUSA in Independence, KS, says Greg Orman isn't truly independent. He's "trying to schnooker you Election 2014 Kansas Senate debate transcript: Independent challenger Greg Ormans opening statement http://t.co/5yICWHTYIP RT @CabPolitical: The "force me to push the Toss-Ups" prediction now moves to GOP Control: Dems 48 - GOP 51 - Orman(KS) 1 http://t.co/O3nkQ "In Kansas, Roberts fights for his seat  and the Senate" http://t.co/JwNzIgyR3i #msnbcdiscuss Orman would be among wealthiest senators, financial disclosure shows:  Greg Orman, the political independent c... http://t.co/yKp7MGUf6x RT @randomsubu: Simple choice for Kansans: support a man who has been in DC since 1980 and doesn't even live in Kansas, or Greg Orman, the  RT @lheal: Every Democrat Senate candidate (including Greg Orman, Democrat from Kansas) would vote for Harry Reid as Senate Majority Leader. RT @ivn: Politics is not something that was intended to take over your life..." - @OrmanForSenate http://t.co/2mobdxAl7a RT @STERLINGMHOLMES: Sources: Wolf weighs Orman endorsement: The tea party candidate is considering some politic... http://t.co/hOsuvGSAaM  Pat Roberts and Greg Orman see several issues differently in the U.S. Senate ... - Kansas City Star http://t.co/3RkCKWXuo9 #news RT @miltonwolfmd: Sorry to disappoint the media, theres no meeting with Greg Orman and I dont have any plans to make an endorsement. Greg Orman claims assets worth between $21.53 million and $85.96 million in first disclosure; annual income btwn $917,290 and $4,523,200 RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  High stakes for politics in Kansas http://t.co/jklGOuuow3 via @detroitnews RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  Poll: Can Greg Orman defeat Sen. Pat Roberts? http://t.co/RjsS4ULH4M Independent candidate threatens to upset GOP hold in Kansas: Greg Orman, a former Democrat who switched to independent and it running... RT @PatRoberts2014: Bob Dole on @OrmanForSenate saying he wanted to be like Bob Dole: "Im Bob Dole &amp; I can tell you that Greg Orman is not RT @EMC_Square2: Meet Greg Orman, the man who could decide the Senate maj http://t.co/QzLO7AyvEf @UniteBlueKS @dscc @OrmanForSenate http:// RT @zimmerdale: Greg Orman in ICT this a.m. Talking issues and ideas, and not mentioning his opponent. Where's my shirt? #WheresOrman http: RT @RussOnPolitics: Another #KSsen poll gives Greg Orman the lead over Senator Pat Roberts. Rasmussen has Orman ahead, 45%-40%. http://t.co Why wld #Kansas #liberals vote  #GregOrman? He's WS investor, Pro #Gun, Pro #BorderSecurity No #Obamacare
http://t.co/vvWCKlGbzX #PatRoberts RT @RichardOHornos: #Kansas ... Will #Democrats go ALL-OUT to beat Sen. @PatRoberts2014 now?  http://t.co/mg4Q3hGaoy via @POLITICO #KSSen  RT @TeaPartyNevada: UPDATE: Sarah Palin says Greg Orman trying to "snooker" Kansas voters in Senate race vs Pat Roberts http://t.co/UeDePO2 Greg Orman @OrmanForSenate is a Harry Reid/Nancy Pelosi #Democrat #kssen He'll vote to conf #EricHoldersNextJob to Supreme Court Pat Roberts and Greg Orman see several issues differently in the U.S. Senate race in Kansas http://t.co/bCUxO63PXE OH, PLEASE DONT: Sources: Milton Wolf weighs Greg Orman endorsement. I can understand a grudge af http://t.co/EGsGWl84or Nate Silver is giving independent Greg Orman a 61 percent chance of beating Pat Roberts... http://t.co/LEoecSJeFb Translated: You get my endorsement if you set your entire campaign message on fire. Oh Dr. Wolf . . . .http://t.co/JHb8nP9Dk6 #kssen Senate candidate Greg Orman's business, political interests run wide - Kansas City Star http://t.co/9ccBlxRc57 Will Democrats go all-out to beat Sen. Pat Roberts? http://t.co/jFRrJ7hMIl Koch Brothers-Backed Group Ties Kansas Independent Greg Orman to Obama in TV Ad http://t.co/gRMI3yQ1Jv RT @rollcall: Kansas overseas election ballots will be sent out without listing a Democratic Senate nominee http://t.co/Gbh9u719Um via @ale RT @LoganDobson: So I guess therell only be one democrat on the ballot in Kansas, then: Greg Orman. RT @Publici: U.S. Senate Candidate Greg Orman of Kansas has pledged to be an independent [who] wont answer to either party.  http://t.co RT @SarahPalinLinks: Greg Orman contributed $4,600 to Barack Obama.  He contributed $9,400 to the Kansas Democrat Party.  Twitter won't let Sarah Palin says Greg Orman trying to 'snooker' Kansas voters - http://t.co/aceajrlgpc http://t.co/pRDsedWx5L RT @CentProj: Greg Orman is "the most interesting man in politics." Help spread the word about this campaign! #kssen #CenterStands http://t Orman's link to jailed investor deeper than first portrayed: U.S. Senate front-runner Greg Orman plans to make... http://t.co/ejsMg7qSvQ RT @ClaireDaviss_FV: Why is ranked choice voting valuable? It would avoid this messy political strategizing. #FairVote http://t.co/XMjefRzN RT @GOP: Greg Orman: Staffed by Democrats, funded by Democrats, has donated to Democrats, is the de facto Democrat. http://t.co/NFoCy7Y9KL  What Exactly Are Dems Getting With Kansas Independent Greg Orman? @TPM http://t.co/7lLGtIwHC9 Greg Orman is nothing more than a liberal in "independent" clothing. #kssen http://t.co/iXhUKJYvA1 RT @willrahn: Greg Orman, the Indy who may take out Pat Roberts in Kansas, is a fan of both Coldplay and Nickleback https://t.co/4HIG046hM2 How a Democrat can win in Kansas? Pretend he's not a Democrat. Meet Greg Orman. Will: High stakes in Kansas Senate race: SHAWNEE, Kan. :  Tacked to the wall of Greg Orman's campaign office i... http://t.co/v7KkWu0Wdq KS USSEN (Rasmussen): Greg Orman (I) 45%, Pat Roberts (R) 40%.